#version: 0.2 - Trained by `huggingface/tokenizers`
0 0
a p
o r
e r
a t
h a
c h
e n
m p
č Ċ
o n
r e
ch e
o o
oo p
d oop
ha doop
a che
or g
ap ache
Ġ org
a s
e t
1 5
t e
i n
1 0
s t
2 0
1 4
te mp
temp t
c e
j a
v a
ja va
I N
as k
en t
Ġ [
20 15
T ask
mp l
1 7
r o
m ap
Ġ IN
F O
ĠIN FO
re d
map red
00 00
4 5
1 8
l i
t i
I mpl
n d
A t
At tempt
o c
Task Attempt
e c
li ent
14 45
s s
C lient
Ġ S
Ġ 2
e w
C on
1 9
l er
nd ler
e d
u n
a in
P ro
Ġ s
00 0
en ew
e as
eas e
o u
at tempt
i s
Ġ ha
Ġha ndler
Ġ f
Ġ attempt
l l
v er
L ease
en er
Ġ on
er ver
M ap
Ġ t
p c
i st
Ġ 1
at or
ti on
P C
I PC
ĠS erver
ec t
L ist
List ener
TaskAttempt Listener
TaskAttemptListener Impl
r a
u ce
in g
i on
v ent
o f
1445 0
i pc
Ġ m
h o
R enew
Lease Renew
LeaseRenew er
st a
7 8
Ġ 0
ce ss
Ġ is
ti l
re ss
4 3
0000 0
Ġ TaskAttempt
m ain
r t
Ġ :
4 9
Ġt o
Ġ Pro
Ġ of
mapred uce
t ain
tain er
I n
r y
U til
v o
N et
c cess
n et
Util s
g ress
ĠPro gress
Net Utils
M et
4 1
Ġ c
o m
s ra
E vent
e l
ch er
f s
i c
at ion
n o
Ġ 18
Map Task
ap p
ho d
Met hod
d fs
Con n
vo k
6 2
Ġ2 1
h dfs
5 7
9 1
sta rt
Ġ A
f l
Con tainer
oc k
0000 00
N o
ock et
Ġ =
ll oc
2 8
Event s
a d
R M
u f
2 3
o b
Ġs un
i t
in vok
invok e
5 3
n g
ro m
Ġf rom
A ccess
Access or
4 4
8 7
re fl
refl ect
lloc ator
Ġ R
1 3
1 6
Ġ 15
Ġ re
S ocket
7 7
r enew
2 4
p tion
x ce
xce ption
s a
Ġ b
ec tion
Ġ java
Ġ e
u l
m e
2 7
Conn ection
i o
Ġ k
Ġ 17
o st
H ost
o mpl
ompl et
r ce
ou rce
9 000
ou t
2 15
et ry
c t
x y
ct or
r u
Ġk v
at ing
st ru
Con stru
Constru ctor
m sra
ou te
q u
e s
o l
91 19
18 215
1445 18215
144518215 9119
2 9
6 0
5 5
re ad
Pro t
H a
no w
Ha ndler
3 3
i l
E xception
e g
4 8
2 6
Ġf or
. .
it h
a x
T o
now n
oc ation
R etry
U n
v ocation
In vocation
Retry Invocation
RetryInvocation Handler
C omplet
u t
i ll
9 6
k nown
Un known
Accessor Impl
Ġ 5
ĠS ource
I O
l a
e st
D el
Ġ start
eg ating
Del egating
p ro
on n
3 0
om m
qu est
onn ect
Ġm ax
R oute
No Route
To Host
NoRoute ToHost
renew Lease
62 78
14 78
14450 6278
144506278 1478
4 7
3 5
2 2
a m
87 49
14450 8749
144508749 1445
4 6
1 2
3 6
3 8
5 0
Ġ Map
j ob
Ġ 14
h read
C omm
oc ol
ha n
Ġ1 6
Ġ2 3
6 6
t ry
Ġre quest
Ġ2 2
Complet ion
un ic
RM Container
n el
han nel
e x
W ith
i mpl
a ll
d e
Ġb uf
T hread
Completion Events
ĠMap CompletionEvents
I nd
Ġ1 0000
Ġstart Ind
Ġmax Events
ĠstartInd ex
c onnect
ra n
ran s
T rans
D is
r m
r un
2 1
C hannel
Socket Channel
SocketChannel Impl
c all
n ew
Ġe vent
Ġm sra
Comm unic
5 8
RM Communic
RMCommunic ator
F S
Ġ W
Ġ 6
un cher
a il
p at
me out
P B
Dis pat
Dispat cher
la ng
f a
5 6
D FS
A llocator
Ġ F
RMContainer Allocator
7 6
3 9
ĠA llocator
Ġ No
DFS Client
A s
sta n
In stan
Ġ l
c k
new Instan
newInstan ce
y n
NoRouteToHost Exception
yn c
As ync
Async Dispatcher
E D
p ill
as t
p ut
a l
Ġ no
Ġ d
8 3
2 5
che d
Ġ 10
r n
1 1
Ġ M
u p
) ;
4 0
Pro xy
a rn
7 0
Prot ocol
b i
msra bi
pro xy
n io
L a
or e
Ġ (
R ed
en d
ched ul
5 9
T i
ic s
at ed
3 7
Container La
ContainerLa uncher
6 00
A R
Ġ in
9 9
Ġ ho
Ġho st
in e
a g
et up
s etup
o de
.. .
r ics
in is
inis h
R pc
Socket IO
With Ti
SocketIO WithTi
SocketIOWithTi meout
Method AccessorImpl
43 2
of t
E ng
Rpc Eng
RpcEng ine
Ġm ore
. $
s un
Ġc om
uf RpcEngine
ob ufRpcEngine
Prot obufRpcEngine
re try
Delegating MethodAccessorImpl
w r
AR N
14450 9
or y
ĠW ARN
43 83
a ccess
432 4383
144509 4324383
Ġ 7
ed Map
ail ed
ro u
wr ap
0 8
Ġd et
l d
6 5
G ener
or m
Gener ated
h er
c or
f orm
Constructor AccessorImpl
c om
m ic
s oft
re ast
ro soft
fa reast
cor p
mic rosoft
Conn ect
form ation
5 4
u rt
Ġf urt
Ġin formation
Ġfurt her
Ġ rou
Ġrou te
Delegating ConstructorAccessorImpl
en ode
am enode
N amenode
l ator
Client Namenode
Trans lator
Protocol Translator
ClientNamenode ProtocolTranslator
ClientNamenodeProtocolTranslator PB
0 9
Ġb y
0 1
u s
Ġkv i
h e
Ġ 8
or t
O N
000 3
Ġ #
edMap s
on tainer
000 2
o w
A N
re am
5 1
5 2
y arn
Ġ 19
Ġ N
te d
out put
0 6
000 4
i v
1 000
Ġ ti
et cher
000 5
Ġc ontainer
23 7
3 2
e e
7 2
4 2
Ġ map
m ory
i d
Red s
i g
8 6
l y
C E
Ġ v
me mory
C or
Ġv Cor
ĠvCor es
14 44
8 0
1445 1444
237 22
14451444 23722
48 57
L I
IN T
IN INT
Ġ 3
60 7
Ġ Host
ag e
et rics
Ġ output
000 1
R A
l ow
Ġt ask
Ġ O
: /
R es
3 4
00 17
:/ /
ĠS chedul
oc al
g et
Ġre try
i tion
r i
ĠM ININT
st ream
stream s
Trans ition
d d
Ġ Transition
ĠTransition ed
e ss
3 1
Ġl en
TaskAttempt Impl
0 4
F N
AN LI
FN ANLI
iv e
O R
on d
at ive
00000 6
: -
7 9
dd ress
77 77
14450 76
t p
t tp
43 7777
1445076 437777
17 0
36 8
19 0
N ative
ED U
1 27
a ck
17 3
a us
ec ond
23 2
R E
10 2
Ġ w
9 46
Ġs h
0 2
0 7
C aus
Caus ed
t h
g th
s te
vo id
53 600
Ġkv start
Ġbuf start
Ġbuf void
Ġ10 4857
Ġlen gth
inish ed
Ġs econd
Ġ 9
IO streams
setup IOstreams
7 1
ed Reds
ig n
Ġc omplet
60 6
70 5
t ask
16 55
18 7
7 24
28 00
Ġe xception
red uce
1445 17
Ġ6 1655
ul t
50 946
144517 50946
14451750946 96
53 0
00000 8
fa ult
49 4
h ttp
14 72
4 17
00000 5
Ġ Method
m etrics
U N
20 6
ail s
13 99
In vok
Invok er
wrap Exception
che ck
00000 7
ĠF ailed
Ġ104857 600
S E
ec ted
a n
14 38
15 21
setup Connection
get Connection
00000 4
invoke Method
Ġ 49
A T
ng e
ha nge
Ġc hange
ĠA ddress
Ġdet ected
ĠN ew
ĠO ld
44 2
00000 2
8 8
0 3
87 9
Method Accessor
Generated MethodAccessor
E Q
U AT
EQ UAT
EQUAT OR
7 91
S A
S RA
7 35
ss ign
ĠA ssign
29 8
7 57
7 00
u til
00 20
57 1
5 26
Ġw ith
ĠS pill
Ġkv end
Ġbuf end
65 53600
ĠSpill ing
k i
Ġ http
00000 3
P R
pro t
prot ocol
Ġf ailed
f inish
y ste
yste m
check Connect
finish Connect
Ġs pill
ĠF inished
c ul
al cul
i ki
w iki
Ġs ee
ĠF or
Ġdet ails
Ġs ocket
ĠR oute
Ġti meout
M ess
With Mess
wrap WithMess
wrapWithMess age
protocol PB
Ġt he
ĠW ill
= <
Ġsecond s
A PR
M APR
N ON
Ġ renew
Ġ ...
Ġl ease
ort ly
EDU CE
Ġsh ortly
MAPR EDUCE
NON MAPREDUCE
0 5
Constructor Accessor
Generated ConstructorAccessor
00000 1
s ho
Ġ 4
u r
il d
p p
Ġ p
S erver
Red uce
R e
00000 9
Ġ2 5
uf fl
ĠM SRA
6 9
C ON
00 16
S S
Ġ Task
p ec
li c
S pill
SE T
ĠR es
Spill Thread
Ġe qu
RE SET
Ġequ ator
IN G
00 18
pec ul
ContainerLauncher Impl
la uncher
Ġ1 2
Ġ /
ĠR etry
E R
ĠR ec
T A
Ġs chedul
L ocal
he ad
r oo
Ġ head
alcul ating
ĠRec alculating
Ġschedul e
roo m
Ġhead room
t er
m it
Ġno t
J ob
Ġt h
Con t
uffl e
Ġ a
M an
Pro cess
Ġ 53
8 9
Ġ1 1
er g
Ġ Complet
Ġ Cont
Res ource
33 33
C h
m ent
Ġth re
66 7
f etcher
Ġ 20
Y arn
sho ld
Ch ild
Yarn Child
ed uce
ĠR educe
Ġ 30
Met rics
v ed
L E
Ġ D
Ġs low
Ġthre shold
F or
CON TA
ut put
_ -
re e
at e
3 78
Ġm et
S low
edMaps For
Ġcomplet edMapsFor
Reduce Slow
ĠcompletedMapsFor ReduceSlow
ĠcompletedMapsForReduceSlow start
M ast
Mast er
lic ation
ol ved
Ġs erver
T ree
Process Tree
O utput
as s
G N
I GN
SS IGN
SSIGN ED
28 0
Ġc onnect
ri ed
R et
l read
Ġt ried
ĠA lread
Ġti me
ri es
ĠRetry ing
Ret ries
ĠAlread y
00 14
de fault
ĠPro cess
00 13
h uffle
Ġ8 9
IN ER
CONTA INER
k en
Ġ2 9
I d
Task Impl
ra ck
ol ver
Res olver
ĠR e
6 8
Ġ job
R ack
l ee
ĠRes olved
Rack Resolver
lee p
I L
3 96
Ġ 57
ĠR UN
ĠRUN N
57 96
S ystem
ĠRUNN ING
U P
00 15
Ġ K
13 5
00 12
Ġ5 5796
ist ory
Metrics System
MetricsSystem Impl
00 11
C CE
U CCE
S t
47 4
Ġc l
ĠProcess ing
Ġ1 3
C LE
AN UP
CLE ANUP
7 5
Container Man
62 6
Ġ mapreduce
Ġ2 4
Ġ5 8
B as
ed ProcessTree
Bas edProcessTree
ĠS UCCE
: <
ad er
Re quest
T y
p e
Ty pe
7 3
F etcher
T E
Ġp ort
S pecul
14 396
Event Type
St ream
00 19
Ġ25 280
on e
c lient
Ġ2 62
Ġ262 14396
i ce
p er
Ġ5 6
Ġ2 6
Ġmax Retries
M erg
Ġ 60
e fault
Ġ2 7
e f
8 4
S huffle
v ice
er vice
626 55
15 474
15474 62655
L i
Li mit
ap i
ag er
1 00
Specul ator
58 1
30 4
Ġ2 8
ĉ ĉ
it y
ĠSchedul ing
ec ur
ecur ity
Ġ P
C H
o t
efault Speculator
Ġcl ass
Ġs ystem
u m
Ġf etcher
5 14
IO Exception
Ġ pro
Ġ1 24
Ġ5 10
end ing
58 4
t mp
9 2
Ġ J
Ġ us
Ġ at
Ġ G
Ġ I
A lloc
R el
ĠR ack
ĠHost Local
ĠSchedul edMaps
ĠSchedul edReds
ĠAssign edMaps
ĠAssign edReds
ĠComplet edMaps
ĠComplet edReds
ĠCont Alloc
ĠCont Rel
ĠP ending
ĠRack Local
ĠPending Reds
f ig
pp Master
RMContainer Request
RMContainerRequest or
Ġ EventType
RA ppMaster
p re
80 30
age ment
IL L
ĠK ILL
app lication
Con fig
00 10
ti es
19 2
per ties
Protocol Proxy
79 4
ContainerMan agement
ContainerManagement ProtocolProxy
ut h
in d
Ġe x
45 56
de pre
depre c
D efaultSpeculator
28 2
Ġm etrics
ĠG ot
135 62
Ġ5 24
Ġ524 65
10 6
Id ent
100 1
l ocal
Ġ E
i r
E W
ĠN EW
9 8
t o
Ġ g
00 22
3333 33
Ġ hdfs
Ġ 48
59 4
Ġ n
c omm
d ir
ess ion
c fs
cfs BasedProcessTree
Ġ j
16 9
9 54
M P
M RAppMaster
29 27
A SSIGNED
Ġ UN
ĠUN ASSIGNED
Ġ1 35
Ġ2 2927
li mit
ĠE x
Ġ C
Container s
f er
o g
ĠA SSIGNED
V M
v m
ĠJ VM
ĠI D
Ġj vm
Ġ ask
Ġtask Attempt
Ġ MapTask
ch ing
00 23
h istory
378 6
Ġ19 304
p en
ED ED
Ġ proxy
ĠO pen
ĠOpen ing
pp lication
44 6
pplication Master
Ġ CONTAINER
62 2
M O
RE MO
REMO TE
B uf
Ġ0 4
ef ore
Buf fer
Comm it
Ġ5 28
Map Output
9 7
10 4857
104857 584
Ġs u
Ġ6 3
Ġ56 794
Ġ 43
45 1
12 1
o un
oun t
Ġ30 954
ĠRe ader
D N
I Q
Ġk ill
Ġ43 581
or ted
4 19
76 8
In put
Resource Limit
Commit ter
S ched
u ler
Shuffle Sched
uler Impl
ShuffleSched ulerImpl
c on
ĠSUCCE EDED
000 9
55 2
Ġ49 594
a rt
49 27
s pecul
specul ate
te s
23 9
er c
Ġcomplet ed
78 6
66 5
Ġd one
46 4
Ġby tes
Ġ6 4927
Ġ49 451
79 2
Ġ49 47
6 7
Ġkill ed
Ġs eg
ment s
Ġseg ments
Event Handler
27 47
Ġt hread
a lloc
alloc ate
U s
8 1
Ġ1 37
Ġ3 96
m s
23 333333
Input Stream
Ġ396 73
Ġc ode
Ġ5 25
Ġ58 622
Ġ new
514 12
2747 51412
Ġ525 29
15 3
Merg er
6 3
Event Fetcher
15 3786
153786 4556
get Resource
getResource s
6 58
u e
69 3
Job Impl
L ED
ĠS CH
EDU LED
ĠSCH EDULED
3 24
S K
Ġre p
13 10
g ing
Ġ 47
unic ation
comm unication
ce iv
ceiv ed
Man ager
Ġ53 419
2 91
Ġ2 96
2 78
L og
16 5
Ġ296 30
con f
38 8
16 4
e vent
55 9
sta ging
f ter
c l
35 8
il e
ou ld
ĠA fter
Ġ53 665
23 3
m o
t al
Ġto tal
H istory
3 47
s ecurity
Ġ3 20
mo te
Ġ320 70
r ted
000 8
Ġ Us
ĠUs ing
ĠSUCCE SS
Ġto ken
9 77
57 3
6 4
A M
l e
ow n
8 36
000 6
Ġ57 693
ĠC ould
ĠS leep
Ġ510 66
ĠSleep ing
r ent
ur rent
i z
Job History
66 66
4 49
Ġ30 607
7 28
00 24
in al
Ġpro cess
Ġ49 792
Ġ sta
Ġsta rted
Ġ čĊ
Ġ124 27
To ken
3 20
in t
x t
in int
6 70
0000 11
44 66
To M
38 4
000 7
ec ut
Ġf inal
m ax
job history
L in
U p
Merg e
c ontainer
ĠN M
Ġ2 91
56 38
Ġm inint
Ġ20 324
IO Util
Ġs p
Ġl ocal
u ll
Ġ up
Ġ application
Ġ "
S chedul
ed S
Re ader
Ġtoken s
Ġ 33
5 15
Ġus e
C ount
Ġ net
Ġnet Schedul
5 28
18 3
Ti me
06 1
Protocol PB
65 2
i x
0000 12
D S
F ix
i m
o lic
Ġs leep
ax im
With Fix
ĠM IL
LI SE
Ġp olic
CON DS
ĠRetry Up
um Count
ToM axim
max Retries
edS leep
Ġsleep Time
WithFix edSleep
ĠMIL LISE
Ġpolic y
ĠRetryUp ToMaxim
umCount WithFixedSleep
ĠMILLISE CONDS
ĠRetryUpToMaxim umCountWithFixedSleep
f i
a uth
ĠS t
un ching
Ġ B
Ġ63 282
18 8
ĠRes ource
D G
D AM
DG DAM
Ġcontainer Id
Ġus ing
g er
Log ger
24 0
Ġ30 358
R OR
Ġ ER
Ġs et
46 8
ĠER ROR
Ġ1 14
76 9
Ġn ull
23 6
ccess f
Ġ4947 9
ĠS ervice
iz e
5 00
li t
ur ation
Config uration
3 15
Ġ In
Ġ 40
u st
A pplicationMaster
) .
n ap
o ad
Ġ hadoop
Ġ Ident
er io
Ġs nap
pro perties
Ġl oad
ĠSchedul ed
sho t
Ġp erio
Metrics Config
ĠK ind
Ġpro perties
to ken
ĠEx ecut
Ġsnap shot
Ġload ed
Ġperio d
ĠExecut ing
Ġsu ccessf
ust er
Ġ deprec
ste ad
deprec ation
MapOutput Buffer
ĠIn stead
Ġdeprec ated
Ġ now
Ġ60 153
A ddress
ĠAssign ed
Output Stream
Ġ114 21
Ġs up
ĠS huffle
ApplicationMaster ProtocolPB
2 44
Client Impl
ApplicationMasterProtocolPB ClientImpl
Manager Impl
Merge ManagerImpl
' t
Ġ17 464
W ind
99 0
ow s
Wind ows
u rn
Ġ 552
at a
Ġsuccessf ul
I MP
S IMP
ĠS ecurity
ĠA uth
SIMP LE
ĠSecurity Logger
Ġ IO
Ġ streams
ĠCould n
Ġre l
Ġ40 658
6 44
f n
Ġ ch
an li
fn anli
iv en
Ġg iven
JobHistory EventHandler
( )
Ġch ild
Ġc urrent
39 9
i fi
Ġ ag
Ġb efore
Ġretry ing
Job Token
Ident ifi
Ġag ain
JobToken Identifi
JobTokenIdentifi er
ĉĉ ĉĉ
n m
s ession
Ġ dfs
ap pc
Ġs ession
us erc
cl uster
appc ache
userc ache
C alcul
p orted
u x
Ġ Lin
Pro cfsBasedProcessTree
Ġon ly
ator ProcessTree
ect or
ĠPro cfsBasedProcessTree
ĠResource Calcul
Ġsup ported
Windows BasedProcessTree
Ġcurrent ly
ĠLin ux
ĠResourceCalcul atorProcessTree
36 3
13 42
2 16
Ġ limit
Ġsp lit
6 20
00 21
l ock
2 77
8 5
Ġ510 86
Ġre s
Ġre t
A UN
L AUN
i ag
Ġ La
Ġ ContainerMan
st ics
no stics
TE MP
Ġ135 62
urn ed
Ġret urned
LAUN CH
iag nostics
ĠLa unching
ĠContainerMan ager
TEMP T
S T
T TEMPT
ĠA TTEMPT
ĠM erg
AR T
ST ART
3 18
o ll
Ġask ed
M s
N Ms
Ġ getResources
Ġf inished
Ġk nown
ource limit
Ġnew Containers
Ġrel ease
Ġres ourcelimit
Ġfinished Containers
Ġknown NMs
Ġ11 16
Ġ1 00
is k
60 80
Ġ6 70
Ġs ize
s ort
t ing
27 0
o mp
19 7
o s
oll ector
Ġ528 39
1342 17
53 5
Ġ6 5
Ġ8 388
134217 728
m b
t xt
Ġ Container
Ġs oft
Ġc ollector
Ġ65 53600
Ġ8388 6080
ĠD iagnostics
Ġrep ort
Ġ '
e b
ĠKILL ING
6 40
Ġ10 559
96 8
Ġ14 3
5 19
13 0
ĠN um
215 5
Ġd isk
D ata
Ġ528 81
Ġ19 061
ĠMerg ing
il ter
S ervice
l ed
ĠRe ceived
45 5
Socket Dispatcher
Ġ53 652
10 24
Ġ7 28
0000 10
ĠRe ad
art ing
ĠSt arting
77 2
24 8
ĠB efore
i ted
ist er
Ġ5 2155
S ing
Ġmax Sing
Shuffle Limit
le ShuffleLimit
ĠmaxSing leShuffleLimit
Ġsh uffle
Ġ56 183
Ġn on
erg e
d o
Ġ 76
Ġm erge
z er
Ġ2 23
9 0
Ġ2 00
16 8
Ġ 78
o p
77 6
Ġf et
Ġc omm
Ġl ast
Ġ Events
Ġ Completion
62 8
Ġfet ching
M ININT
20 8
us h
Ġcomm it
Ġ200 59
M SRA
35 9
ĠA pplicationMaster
Ġ19 667
7 378
H ttp
14 2
Ġ21 6
Ġex ited
66 4
Ġt han
Ġ7 378
Ġ47 468
28 8
Ġ18 44
Dis k
14 4
Ġ Ġ
Ġex it
ĠEx it
zer o
Ġa b
h uffl
at er
re ater
in ce
ĠS huffl
Ġs ince
Ġ21 69
Ġg reater
ĠShuffl ing
I SK
ec omp
Ġd ecomp
ĠD ISK
Ġab out
O n
Ġ18 836
Disk MapOutput
On DiskMapOutput
c hannel
1 20
c ce
p ass
ed ed
Ġs orted
Ġl ef
ĠTask s
ĠD own
Ġsu cce
Ġlef t
Ġsucce eded
Ġre mote
20 5
58 2
Ġ4 236
13 6
Ġcommit ting
3 26
ĠR eg
786 1
ĠReg ister
9 3
F ile
29 28
17 2
7 26
47 2
Ġ5 7861
2 24
7 37
Ġ14 56
l ush
Ġf lush
91 2
18 6
7 62
45 6
14 5
Ġa nd
6 87
Ġ 446
TA SK
Ġw as
ĠA nd
66 9
644 84
Ġ ack
44 8
a ry
30 5
18 4
b e
Ġ2 43
B lock
Ġ 399
Ġ st
50 4
art be
artbe at
10 4
Ġ399 35
3 45
Ġ48 24
91 1
ĠRegister ing
or d
10 8
24 6
99 8
89 3
2 23
T ING
15 53
44 0
18 9
lloc ated
Ġcontainer s
Ġa llocated
e ment
g ement
now led
ĠD one
Ġack nowled
Ġacknowled gement
78 9
13 59
P erc
Perc ent
Ġ2 49
29 6
p age
29 2
27 6
33 0
1 28
78 8
Ġ 77
62 270
Ġ89 0
ass ign
ĠS to
ĠSto pp
Ġ47 384
43 7
re s
26 4
output s
5 16
Ġ assign
os ed
s h
00 6
20 7
p b
3 10
57 6
53 2
Ġ6 1553
20 9
28 6
i b
14 7
Ġc onn
50 8
Http Server
Ġ29 28
88 8
5 17
Ġ1 25
Ġex ist
/ _
or ary
et ails
temp orary
ĠProcess or
Committer Event
Ġ ur
Ġcl osed
Ġur l
10 68
Ġconn ection
c ib
ĠA n
Ġfor cib
Ġassign ed
Ġexist ing
Ġforcib ly
a b
" :
" ;
in ation
est ination
Ġd estination
ĠD etails
48 8
13 2
99 3
Ġ53 359
60 8
8 87
9 08
15 2
5 43
Re mote
ed Reduce
Map ResourceLimit
edMap Resource
edMap Percent
Ġcomplet edMapPercent
Reduce ResourceLimit
Ġtotal ResourceLimit
Ġfinal MapResourceLimit
Ġfinal ReduceResourceLimit
ĠnetSchedul edReduce
ĠnetSchedul edMapResource
ĠnetScheduledReduce Resource
2 53
4 45
49 6
ĠStopp ing
Q ue
li st
7 45
7 55
14 0
5 53
49 3
13 3
g rou
Ġs pecul
Ġb ack
50 6
ĠAssign ing
Ġprocess ing
grou nd
Ġback ground
46 3
9 4
8 96
Ġ 4466
6 36
m ed
Ġ552 26
Ġ57 581
2 50
Ġ RM
7 4
map Output
Ġs ent
Ġha sh
Ġre ceived
Ġrep ly
20 4
20 3
a k
ak e
i te
Ġ60 515
c ount
w ord
519 51
Ġ la
60 1
19 5
53 6
channel s
2 62
in put
47 0
A nd
53 4
87 5
Ġ6 44
7 36
Que ue
14 9
19 6
he artbeat
Ġ223 30
5 13
F ilter
re ed
Ġf reed
3 28
m ake
Remote Request
make RemoteRequest
76 7
C TING
Ġ CONTA
Ġ644 10
ĠCONTA CTING
Ġ 44
Ġ reduce
49 130
26 6
Un res
check Address
olved Address
Unres olvedAddress
UnresolvedAddress Exception
i ate
ter med
termed iate
2 29
s ervice
comm it
70 8
Ġ4947 0
41 6
55 0
3 62
d one
in termediate
63 142
ĉĉĉĉ ĉĉ
326 63142
6 49
ation s
08 9
00 8
87 6
2 00
49 7
9 84
87 2
62 3
62 9
26 6666
59 9
page input
266666 68
16 0
Ġ552 19
29 7
8 66
b a
Re ad
3 43
55 8
57 9
Ġ2 44
7 10
Ġ89 3
25 2
18 0
Ġf ile
59 5
And Process
2 28
45 2
56 8
528 39
5 78
15 8
Ġ8 91
0 333333
0333333 35
7 20
6 46
37 9
59 7
ĠA dd
79 8
li b
48 3
3 14
77 7
l og
13 9
Ġ8 6
38 9
Ġ14 5
76 4
1 13
ad d
m ort
w eb
29 5
29 9
58 8
ba y
mort bay
1 12
53 7
56 3
09 3
19 24
Committer EventHandler
word count
16 6666
166666 67
7 43
Ġ19 5
9 20
9 22
23 1
66 8
DFS InputStream
Ġ2 233
7 78
91 3
70 9
9 76
14 8
7 96
78 4
Ġ16 77
77 0
44 4
Ġ 46
06 3
62 4
4 23
5 45
7 25
17 6
58 9
86 4
l ing
nd ling
Ha ndling
ĠRes p
event Handling
eventHandling Thread
46 9
15 0
28 345
89 32
Ġ list
/ .
15 7
8 65
99 2
39 2
Ġ3 26
0 51
Ġ IPC
ond er
5 23
7 47
I T
30 6
22 1
347 40
ĠResp onder
Ġlist ener
1 16
3 77
4 18
F a
Fa ctor
28 4
39 5
27 2
26 9
6 80
8 43
Ġ3 417
Ġ58 136
Ġ326 43
Buffer ed
W r
Ġ124 28
17 9
1 23
38 5
25 1
8 16
78 5
ĠĠ Ġ
70 6
ĠS ocket
3 41
2 56
Ġ19 20
Output Committer
File OutputCommitter
6 42
8 00
48 16
10 9
Ġ15 8
60 9
Ġ19 911
L ine
d own
17 5
78 3
ut down
6 19
ra ct
78 7
58 0
5 48
6 33
8 40
2 55
8 48
59 8
Ġcomplet e
98 5
0 32
4 00
0000 13
86 7
Ġ 768
62 1
22 5
15 6
st op
53 1
96 6
ĠKILL ED
59 2
99 9
h ist
j hist
10 5
Socket InputStream
55 6
1 14
2 49
58 5
40 8
15 5
39 3
4 28
41 2
wr ite
Ġ 62270
00 9
55 14
83 45
Ġ7 320
8 20
8 06
o pp
98 1
Ġst opp
et e
ru e
48 0
7 12
read In
3 44
87 4
Ġsh utdown
Ġstopp ed
0 60
35 23
Ġ -
215 2
68 4
46 1
57 7
60 3
69 2
6 50
19 3
25 4
0 96
16 3
36 6
92 16
3523 2152
7 52
76 5
2 60
7 27
u b
29 72
13 3333
08 1
133333 34
8 44
78 0
28 7
48 1
48 5
1 000000
4 62
10 7
53 8
13 8
Ġ63 463
6666 667
1000000 1
2 58
6 39
43 0
16 384
27 3
38 0
DFS OutputStream
9 96
14 1
70 7
0 6666667
0000 14
50 7
67 4
13 1
291 25
Ġ728 13
6 11
30 8
9 14
9 43
ĠW e
Ġa re
m l
x ml
449 50
2 57
33 6
Ġ 990
36 7
66 3
3 12
28 45
77 1
33 7
33 9
35 2
29 4
3 00
7 23
9 79
46 5
39 4
4 41
9 09
49 0
8 192
43 6
16 6
34 17
49 1
Factor y
9 00
45 0
4 26
9 05
30 26
36 5
50 1
239 215
ab le
5 60
8 56
9 59
83 2
79 7
7 11
9 18
d n
Ġ1 21
96 99
4 22
5 44
9 19
2 19
6 32
6 79
7 58
30 1
7 19
7 99
27 4
Ġ89 08
29125 216
Ġ72813 04
0 28
6 57
7 46
A b
18 43
56 4
00 7
st ract
18 5
Ab stract
7 38
9 06
96 3
6 30
Event Dispatcher
68 1
0 77
1 10
2 000000
9 15
i q
Ġ1 378
28 9
Ġreduce s
Wr it
2000000 2
1 26
ja r
48 4
Ġstart ing
all Queue
web app
6 37
49 470
27 9
09 0
669 80
45 7
78 1
88 9
Ġ89 32
8 53
45 3
Native Buffer
7 21
43 3
87 7
30 535
to NativeBuffer
readIn toNativeBuffer
3 11
8 10
8 33
e y
te xt
91 6
47 3
38 6
Ġ14 33
66 40
Ġ57 3
6 78
8 35
87 3
26 3
56 9
76 86
40 9
Native ConstructorAccessorImpl
97 55
48 6
99 4
79 0
97 4
3 60
Ġ2 17
96 9
5 20
9 80
8 39
44 28
88 2
8 62
9 49
6 91
6 83
8 57
s econd
li second
Ġm il
535 20
lisecond s
Ġmil liseconds
4 29
9 17
Ġ2 106
06 4
4 43
7 18
9 75
41 3
16 1
27 1
1 15
3 42
6 77
9 02
1 62
9 83
19 4
Ġc on
69 0
89 320
Ġ89 320
106 96
8 55
17 4
57 0
80 7
06 8
9 30
87 04
26 7
40 1
Ġ8 543
06 9
9 78
20 48
0000 15
Ġ2 28
Ġ57 318
Block Reader
1 29
2 17
un ched
Ġ15 000
36 1
ative Attempt
Ġw e
ĠD efaultSpeculator
Specul ativeAttempt
Ġ1844 62
Ġspecul ating
Ġspecul ations
Ġla unched
add SpeculativeAttempt
Ġ- -
4 20
8 23
9 53
10 769
60 2
33 4
66 6
6 48
c urrent
41 1
con current
3 13
45 9
88 5
Ġ4 87
0 29
0 54
4 27
6 13
8 15
23 4
0 40
17 7
44 7
Ġ6 77
106 88
3 474
8 22
50 2
56 1
0 99
3 87
Ġ all
00 2
4 60
5 12
8 18
8 19
20 1
23 0
16 60
66 1
ex t
Ġ48 78
5 47
5 46
8 28
19 15
55 135
2 43
7 60
8 29
9 29
50 3
86 1
0 65
4 10
58 25
88 4
8 51
9 48
47 6
39 7
59 3
0 23
1 22
8 08
9 86
A B
R un
45 4
33 2
37 4
Ġ58 25
0 13
2 27
6 47
76 80
Abstract Service
0 18
5 91
8 42
9 57
33 3
22 2
2 26
3 53
8 30
Ġ app
10 1
87 1
30 769
70 4
30769 232
0 62
8 17
d b
Ġ17 18
Ġ17 30
88 1
0 16
7 59
8 47
9 42
14 3
el ete
96 4
47 1
37 3
0 49
8 58
M M
O MM
57 4
77 9
55 5
38 3
39 8
Us er
OMM IT
0 20
7 39
8 99
Ġmap s
Ġ76 80
3 40
7 48
0 52
9 28
9 38
18 88
23 5
80 4
99 5
80 2
89 8
7 54
8 50
0000 16
33 1
37 2
5 21
7 14
62 5
57 23
09 5
do Read
0 45
7 40
9 03
Ġ53 993
0 17
8 26
27 52
56 7
40 6
89 5
6 89
19 46
Ġre ad
29 07
50 5
50 9
70 3
79 5
ĠD efault
239 23
JobHistory Utils
0 78
8 78
43 5
77 05
46 6
Ġ7 32
08 6
Job F
455 62
0 56
7 30
9 39
10 737
Ġm e
62 304
57 2
35 664
Ġ243 00
1068 5723
0 27
0 55
8 49
77 5
106 35664
239 22
8 41
8 38
9 04
L oop
28 5
12 5
Ġno de
83 4
1068 1946
ab led
5 96
6 72
7 50
9 10
00 1
45 06
18 1
26 1
96 1
35 6
09 7
69 7
0 87
4 15
4 77
9 40
9 01
Ġ en
53 3
27 5
86 8
86 9
69 5
Ġthre w
Filter InputStream
1924 7705
Buffered InputStream
9 60
t y
14 6
25 93
37 5
09 2
0 36
7 17
9 36
A pp
Ġ T
Ġ TASK
14 71
78 2
Ġc lient
62 7
77 4
30 7
Data OutputStream
Writ able
10696 4506
0 48
2 12
6 15
43 9
49 9
55 4
read AndProcess
25 9
Ġ291 25
do Run
channel Read
ĠAdd ed
Ġread AndProcess
doRun Loop
2 14
3 17
3 48
4 87
76 1
Ġd elete
OR T
89 7
Ġ44 089
AB ORT
0 70
4 78
6 35
7 41
8 80
00 5
68 5
6 45
7 29
O per
Service Oper
ServiceOper ations
4 14
9 37
0 66
5 10
6 53
9 56
j ect
13 65
96 5
46 16
70 1
08 4
0 14
7 16
9 41
9 73
Ġ21 65
38 1
11 1
2 45
3 49
9 47
23 8
36 9
Line Reader
10688 1365
10 3
19 8
29 3
40 3
Ġ89 15
5 18
5 27
7 34
43 1
Ġ8 658
07 4
Data InputStream
BlockReader Factory
6 62
6 34
7 56
R Client
_ _
et ty
Ġf ilter
33 5
ĠM RAppMaster
89 0
cl ass
ĠAdd ing
0 38
9 44
9 27
9 07
00 4
0 22
9 89
19 266
26 8
56 5
19266 446
0 24
0 34
2 10
6 96
s um
45 8
53 9
77 66
86 3
278 13
1 18
6 18
6 71
6 75
8 59
Ġ history
15 1
30 2
47 5
36 4
39 0
Ġ89 09
27813 601
5 40
7 49
49 5
35 4
70 2
7 44
9 58
10 66
18 2
01 28
6 31
8 14
8 83
9 62
Ġt rue
879 4
0 37
5 49
5 22
9 72
15 23
192 550
Ġ33 977
1915 8794
192550 35
5 62
7 33
13 4
89 2
0 46
7 22
8 13
9 45
15 9
17 1
58 286
83 7
65 1
79 3
192 58286
2 13
6 17
8 91
9 26
n ext
20 2
40 4
65 4
278 250
278250 75
0 50
6 43
13 58
60 4
69 4
69 8
Ġ446 62
1066 108
2 18
8 12
9 91
u nd
Ġ red
83 1
40 5
an t
Stream er
98 2
Ġ2233 00
und ant
Ġred undant
0 83
5 0010
6 14
6 38
19 21
09 8
80 5
362 40
3 27
6 88
26 5
35 1
46 7
0 30
1 19
3 23
3 70
4 25
8 45
9 52
59 0
08 5
09 4
Data Streamer
Ġ44 15
1921 1523
6 12
7 53
13 7
38 09
58 3
Ġ60 514
278 3809
3 76
6 99
7 15
8 60
8 09
9 33
a ce
ss u
Ġ2 46
21 1
08 2
0 33
7 66
O B
S UCCE
49 2
38 80
ĠJ OB
ĠC op
ĠC OMMIT
968 57
Ġ78 83
Ġst at
276 96857
SUCCE EDED
0 19
1 17
2 41
7 13
9 55
06 7
278 113
Ġ249 14
278113 13
6 10
9 87
9 70
57 5
33 8
2 20
6 60
9 24
oo l
48 2
0 76
3 22
6 76
43 8
Ġ124 278
1924 2907
0 43
5 87
23 92
76 3
40 2
106 493
106493 875
5 29
Ġ ot
38 2
ĠI ssu
Ġot her
ĠIssu ing
0 47
5 11
6 16
8 27
84 27
523 68
0 59
15 52
19 9
58 6
40 7
5 57
8 46
9 32
16 02
60 437
58 24
39 06
Ġ7 280
07 5
646 42
0 15
0 41
6 86
S ub
0000 17
28 3
Ġ3 10
106 60437
278 1602
JobF inish
1 24
8 54
d g
d am
53 237
60 5
58 081
Ġ19 70
Ġ11 165
dg dam
53237 19
8 25
19 1
28 1
77 3
37 1
08 0
Ġ4 77
1310 14
Lin k
0 58
7 42
9 35
14 96
19 209
48 9
35 0
36 3906
99 7
89 4
19209 063
363906 56
6 59
9 34
9 88
a mp
19 04
19 977
ĠR amp
24 2
363 19977
ĠRamp ing
8 24
45 83
76 006
5 24
6 41
9 71
36 40
36240 12
0 91
0 31
9 21
80 563
Native MethodAccessorImpl
277 76006
Ġ1116 50
3640 4583
0 53
15 4
30 3
54 2
Ġ19 74
106 80563
0 72
3 57
87 0
1 135
6 73
8 86
15 38
1310 1135
1 623
9 50
55 68
Ġ33 96
534 25
5 25
7 51
G ro
20 56
In formation
96 7
up Information
07 1
07 3
do As
File OutputStream
User Gro
Sub ject
1538 4616
UserGro upInformation
0 39
3 91
4 24
8 52
R out
Ġ {
Ġ }
17 92
Rout er
36 3880
80 3
239 19
295 472
363880 28
C omp
E N
o ver
47 9
08 8
573 26
Ġ33 97
os ite
Comp osite
Composite Service
s e
87 280
12 553
192 12553
6 55
9 23
Ġ un
re shold
17 8
Map per
12 288
0 21
6 56
43 4
Ġ10 29
Ġ63 87
Ġsp ace
service St
23923 388
0 44
0 11
7 32
9 31
i a
Ġ46 59
0 25
0 42
Ġ JobHistoryEventHandler
41 60
23 08
30 56
3 16
7 31
29 60
36 389
Ġ135 908
347 43
44950 968
36389 23
3 19
3 55
49 8
55 1
FS DataOutputStream
1310 19
277 65
File System
0 769
9 25
49 12
44 65
aus e
27765 483
0769 2308
T h
Ġ add
44 78
48 42
Ġ135 90
3 29
9 51
Ġ2 170
11 264
Ġ60 19
347 437
363 7686
Ġen abled
347437 17
0 10
5 66
6 197
449 649
8345 12
Th reshold
449649 66
d ate
Ġs ervice
23 104
23 506
16 7
26 896
363 23506
423 13
4478 9755
3 46
8 01
44 8704
Block ing
serviceSt op
3 21
ec ause
87 44
Ġb ecause
55 452
0 57
3 25
57 2845
30 9
Ġ58 24
Ġme mory
5 41
Ġt oo
28 768
215 04
21 128
68 2
Ġ57 315
Ġ57 2845
4556 3
573 150
Ġ143 28768
Ġ143 21128
44950 172
572845 12
Ġ57315 093
Ġ572845 31
573150 72
0 12
4 21
53 34
29 48
99 80
Blocking Queue
6 1
ĠA M
44 88
68 578
449 68578
277 725
277725 25
0 35
6 189
H e
Ġ FS
Ġ 70
Ġ 9699
10 448
57 3026
30 72
25 664
59 24
Ġ57 310
Ġ57 3026
Ġ24 248
573 10448
Ġ143 276
Ġ143 25664
artbeat Handler
Buffered OutputStream
239215 85
9699 280
He artbeatHandler
Ġ9699 305
573026 56
Ġ57310 469
Ġ573026 75
Ġ24248 20
Ġ143276 12
Ġ2 47
19 97
Ġ2169 91
Ġ2169 88
6197 233
6189 8744
0 79
s erver
0000 18
57 19
79 52
8 21
o ved
Ġt mp
Container Allocator
ĠM oved
34740 62
53520 21
53425 497
5334 1997
29 0
Ġ9 777
4556 43
97 45
977 7952
Ġ244 4488
Ġ9777 968
47 56
76 46
39 24
03 76
Ġ243 6
/ *
8 11
A m
C allQueue
E T
F IL
I p
M RClient
O X
T ER
W eb
b er
f ilter
i es
l f
Ġ pat
00 3
00 75
er iz
re t
ĠIN IT
ec ret
ĠS ET
Ġ2 442
ed BlockingQueue
Ġs pec
Ġc allQueue
no de
Ġk ey
215 26
la ck
am filter
ĠO utput
Ġ9 745
PR OX
573 21504
ĠNum ber
Ġla unching
web proxy
ub eriz
Ġ1433 0376
Ġ573 21526
Ġcon text
App s
ĠT he
Link edBlockingQueue
Ġadd ing
9745 888
Ġ2436 472
Am Ip
CallQueue Manager
FIL TER
Web Apps
Ġpat h
ĠINIT ED
ĠSET UP
lack list
ĠOutput Committer
Ġ9745 912
PROX Y
AmIp Filter
S el
Ġ 66980
19 57
Ġ16 745
80 705
Ġ9 770
Ġ24 41
977 0128
449 80705
66980 528
Ġ2442 532
Ġ66980 545
Ġ16745 132
Ġ9770 147
19 25
53 528
47 36
46 40
72 14
Ġ9 7646
990 53
976 4640
Ġ2441 160
53528 25
Ġ97646 56
57 33
77 98
670 990
5638 0075
Ġ670 99053
736 83
Ġ1677 4756
670990 24
7 3786
Ġ EventFetcher
00 44
ache d
17 363
Ġ7 3786
Ġ19 57
Resource Request
75 27
977 6
363 17363
90 12
131019 34
Ġ247 16
Con text
49 40
53 52
24 7
Ġb lock
59 190
606 7
893 21
297 44
45563 135
3 000
K ey
V al
Ġ16 768
51 28
Ġ89 18
92 504
Ġ48 92504
446 60
97 60
573 189
670 70
670 736
620 7798
Ġ670 73683
Ġ143 29744
448 6067
920 19
4428 99
Ġ57318 998
next Key
1957 0016
Ġ1957 0044
5352 1925
Val ue
Ġ16768 416
573189 76
670736 64
nextKey Value
b l
14 449
19 4428
53 88
13 4736
33 9776
Ġ5 669
Ġ16 767
70 175
Ġ19 442899
607 20
Ġ57 339776
92 000
Ġ48 60720
670 92000
ĠB P
Ġ670 92019
Ġ670 70175
page out
Ġ1677 3000
Ġ1433 4940
7214 7527
5733 9760
67070 144
bl k
14449 72147527
194428 80
134736 9012
Ġ16767 536
9 768
0000 19
Ġ2 45
49 56
Ġ5 89
Ġ14 57
Ġ14 330
Ġ9 81
67 10
573 23104
Ġ890 76
231 22
Ġ573 23122
Ġ14330 776
Ġ mapred
Ġ2 88
49 57
57 73
44 85
33 81
76 89
Ġ19 22
620 4
R ec
t rue
18 14
29 52
58 36
Ġ9 768
89 1904
Ġ76 891904
Ġ244 2056
9768 224
5773 621
7689 1888
Ġ1922 2972
Ġ9768 248
19 558
el ine
96 12
Ġd ata
Ġ19 558
ri or
Ġ9 7766
Ġ48 896
977 6640
Ġ244 4160
981 1792
Ġ245 2948
Ġ981 1814
19558 576
Ġ19558 607
Ġ97766 58
Ġ48896 44
a w
r or
Ġc ount
29 343
ĠW a
Ġ6 710
89 318
573 18
4466 00
Ġ1116 49
908 1
94 87
Ġ1677 6204
6710 4816
Ġ6710 4842
0 26
8 2
45 26
19 51
19 514
19 4956
Ġ1 3786
62 104
76 88
Ġ7 33
Ġ19 4957
ĠRec over
Ġ89 17
Ġ89 318
315 75
619 9081
Ġ487 3924
4485 9612
194956 96
62104 22
Ġ194957 18
49 139
29 500
50 233
50 208
Ġ16 76
Ġ16 762
Ġ19 514
102 24
an k
ĠReduce Task
Ġ60 517
233 48
670 63
670 50208
Ġ670 50233
Ġ143 29500
755 6
195 49
Ġ57318 028
Ġ4878 508
Writable RpcEngine
57318 000
19514 032
Ġ16762 552
Ġ19514 051
53 43
Ġ17 23348
29 53
48 47
30 31575
76 726
76 834512
Ġ19 18
Ġ19 208
102 55
Ġ48 87280
63 207
620 9487
Ġ670 63207
Ġ76 8345
195 10224
Ġ195 49139
Ġ195 10255
53520 28
Ġ487 7556
Ġ1676 5796
67063 184
19549 120
Ġ19208 628
Ġ768345 31
49 28
60 48
12 771
Ġ19 2
Ġ29 343
84 45
Ġ33 98
Ġ76 726
Ġ195 12771
Ġ4878 188
29343 344
1951 2752
Ġ733 5836
76726 640
Ġ1918 1660
Ġ29343 368
Ġ76726 657
e ue
Ġ qu
on se
ĠS ize
24 07
Ġ7 3
Ġ60 516
620 8445
207 32
1660 4526
Ġqu eue
L ast
s ki
14 76
43 25
24 192
24 209
26 76
88 2953
Ġ60 513
768 24192
5638 263
315 2
Ġ76 882953
Ġ446 59
Ġ1920 6048
Ġ768 24209
7688 2928
5343 203
Ġ192 20732
6 196
26 56
Ġ22 18
559 5
620 844
Ġ217 009
Ġstat us
6196 791
13 92
46 72
120 4
Ġ1920 1204
7680 4816
Ġ7680 4847
41 18
Ġ18 446
58 60
Ġ6 330
Ġ29 2
205 12
2928 5568
440 2952
Ġ2928 5595
Ġ893 21
Ġ732 1392
P ool
f e
43 663
Ġ18 445
13 72
Ġ19 200
535 43663
7680 2656
Ġ7680 2676
Ġ19200 664
Ġ9 755
88 92
Ġ243 8892
253 12
642 60
9755 568
Ġ9755 595
N ew
20 537
24 00
60 240
30 24
58 240
Ġ7 315
86 40
Ġ29 260
768 20512
Ġ223 29
582 56
145 60
292 60240
292 58240
Ġ1920 5128
Ġ768 20537
Ġ73 14560
Ġ292 58256
Ġ7315 060
Ġ29260 262
19 515
30 80
Ġ16 7686
66 19
670 747
Ġ670 747
2928 1472
2928 3056
Ġ2928 1496
Ġ2928 3080
Ġ7320 368
Ġ7320 764
23919 508
Ġ167686 84
670747 36
Ġ670747 57
E x
20 37
29 1843
Thread Pool
40 42
Ġ7 2960
Ġ29 1843
ecut or
Ex ecutor
291843 36
ThreadPool Executor
Ġ72960 84
Ġ291843 53
16 12
60 180
48 35
40 720
Ġ8 6640
Ġ19 516
86 62
86 55
Ġ24 62
Ġ48 789
1310 4042
Ġ216 60180
Ġ2169 727
866 40720
19515 984
Ġ86640 743
Ġ19516 006
Ġ48789 96
6 330
Q u
i ed
44 76
534 2037
f y
45 15
ti fy
62 47
16 13
Ġd own
4556 1612
Ġ216 990
866 19
34740 61
JobFinish EventHandler
Rec ord
R aw
Ġ <
29 76
48 48
12 00
36 48
59 04
Ġ8 6619
86 584
Ġ104857 599
Local FileSystem
Ġ124 277
Ġ2165 4848
86619 392
Raw LocalFileSystem
Ġ86619 412
p onse
Ġ21 63
16 64
36 70
Ġ8 65
51 20
446 579
Ġ1116 4476
Ġ216 461
Ġ446 579
Ġ8658 4515
86584 496
446579 04
Ġ216461 24
Ġ446579 29
p ted
re g
17 24
ru pted
55 4835
56 168
Ġl ocation
Ġin ter
01 16
Ġ19 206
135 87
Ġ135 87
768 25312
239 24
5638 1613
Ġ216 56168
253 34
Ġ86 6247
Ġ86 554835
Ġ768 25334
8662 4672
8655 4816
Ġ2163 8704
Ġinter rupted
Ġ19206 328
Ġ866247 03
78 83
57 262
33 12
Ġ14 315
Ġ57 262
5638 0
2928 3648
Ġ2928 3670
256 49
Ġ7320 912
Record Reader
23924 798
57262 128
Ġ14315 532
Ġ57262 153
6 144
Ġ RMCommunicator
ti fi
Ġis AM
Ġ21 6278
ĠNo tify
Ġno tifi
25 28
11 225
Ġth at
112 00
865 11200
Ġ217 0116
Last Retry
Ġ865 11225
ĠisAM LastRetry
Ġ216278 00
Ġnotifi ed
18 28
Ġ18 639
26 72
86 57
80 53
Ġ58 255
2928 5904
1359 0
Ġ2928 5924
Ġ732 1476
reg ister
8 488
23 18
26 88
Ġd ue
Ġ9 726
Ġ4 776
ree mp
Ġ124 280
97 26896
291 224
Ġ243 1724
Ġ893 22
4465 91
Ġ9726 918
Ġ21 64
47 116
86 607
86 588
607 341
Ġp reemp
169 0
ĠC all
1310 2318
Ġ216 47116
Ġ86 607341
Ġ2165 1828
Ġ8658 8488
86607 312
86588 464
o ing
p ager
41 32
Ġp rior
Ġschedul ed
ĠG oing
Ġla ck
Ġ22330 668
Ġ86 5719
8932 2672
548 83
Ġ8932 2688
10737 418
8657 1888
Ġ2164 2972
Ġpreemp t
pager ank
Ġ865719 06
5 168
P e
r ror
4466 1664
5638 4325
Ġ1116 57
Ġ1456 3
Ġ446 603
Ġ4466 1690
Ġ22330 280
Ġ29125 237
Ġ11165 416
Ġ111650 76
89321 120
44660 304
Ġ89321 138
ĠCall ing
Pe er
Ġ446603 27
7 168
Ġ ob
Attempt Id
p ort
77 69
06 368
07 36
Ġ104857 597
8053 06368
register ed
S ecurity
Ġ Thread
15 79
Task HeartbeatHandler
58 248
11 008
Ġ7 282
Ġ216 99
Ġ228 40
89318 224
ĠRecover ing
Ġ89318 249
Ġ22329 556
Security Util
E n
f ill
69 53
396 11008
5638 328
515 2
7378 5152
Ġ7378 517
Ġ990 2752
Ġ184462 88
Ġ7378517 9
D ING
P EN
m ary
y ing
Ġ Commit
58 28
Ġ19 708
Ġg o
sum mary
ĠCop ied
ĠCop ying
ĠCOMMIT TING
PEN DING
4 232
g n
or ing
ContainerLauncher Router
Ġ7 377
Res ponse
73 7769
ĠI gn
Ġ135 89
291 229
Ġ291 229
os e
Ġ728 0736
Ġ1844 4232
Ġ7377 6953
737769 28
ĠIgn oring
291229 44
Ġ291229 62
f f
s ol
20 60
Reduce Task
Block OutputStream
10737418 24
Ġob sol
Ġobsol ete
m er
ti me
28 240
69 22
282 60
291 28240
4466 1552
Ġ291 28260
Ġ1116 5388
Ġ728 2060
Ġ4466 1579
Ġ891 30
239215 06
er ia
Ġ6 78
Ġ48 25
cl ose
Ġ291 252
eria li
a r
41 16
27 06
Ġ5 80
Ġ158 24
45562 187
m an
Ġ id
Ġ 62304
18 64
53 25
239 246
Ġ8908 233
89320 208
Ġ89320 237
3474 145
23922 287
Ġ223300 52
Ġ3396 796
13587 184
Ġ13587 203
239246 37
5 215
e an
o d
Ġ18 446600
Ġ10 48
Ġcl ean
Ġ58 246
67 108
186 41
Ġ891 14
3474 2972
Ġ29125 233
34743 145
73786 400
Ġ73786 427
67108 8640
3 440
Ġ 776
ec k
No de
Ġ10 44
Ch eck
205 13
Ġ145 629
Wr app
45562 57
Context Impl
56380 385
1 628
3 464
8 528
C ache
P l
Ġ out
Ġ de
fl ush
28 158
28 20513
27 64
39 85
39 608
Ġ58 2
1310 2706
347 3985
4466 3440
85 49
Ġ1116 5860
Ġ4466 3464
230 769
Ġ33977 08
Ġ135908 58
13590 832
5215 0
P r
Ġ6 33
ail u
edMap per
65 57
Ġ1844 69
582 550
Ġ1456 17
687 0
Ġ58255 090
Ġ14563 768
Wrapp edMapper
230769 25
582550 72
2 237
7 132
l ler
ro ller
19 20
23 39
53 6870
Access Cont
Ġjava x
Ġ17 0
il eg
37 12
iv ileg
Ġ58 00
240 96
455 13
do Pr
7378 8528
Ġ7378 8549
Ġ1844 7132
536870 912
AccessCont roller
ivileg ed
doPr ivileged
9 395
Ġ 99
45 488
24 69
26 53
Ġ3 4
1310 3712
582 45488
Ġ1456 1372
Ġ125 17
Ġ582 45513
u g
14 40
19 96
24 80
Ġ22 17
40 96
Ġ19 709
31 12
Ġ124 26
4556 5325
Ġ135 919
Ġ33 979
1359 1920
9395 24096
Ġ135919 36
Ġ33979 80
6 798
b u
b le
f et
u sa
Ġ it
57 60
33 60
Ġ14 55
Ġun usa
Ġunusa ble
25 783
86 88
79 59
Ġ104857 595
an y
St art
63 299
244 8
Ġ1456 3112
Ġ893 25783
Ġ2233 1440
8932 5760
5825 2448
Ġ5825 2469
ailu res
3 106
43 20
1655 56
Ġ11 165556
446 622
347 44
Ġ44662 252
446622 24
5 456
Ġ17 01
26 843
Ġl og
83 40
Ġ104857 598
998 06
Ġ77 5
Ġ22330 620
8932 2480
Ġ158 25
Sel ect
Ġ89322 507
26843 5456
S ort
e m
m ToM
s Threshold
Ġ io
er Manager
er Pl
Con sum
12 28
58 30
Ġ6 99
40 2653
Output sThreshold
Ġ124 29
Merge OutputsThreshold
ĠShuffle Consum
ĠMerg erManager
Ġmerge Threshold
998 08
Ġ77 62
Ġme mToM
Ġmemory Limit
ug in
Sort Factor
em MergeOutputsThreshold
Ġio SortFactor
erPl ugin
402653 184
ĠShuffleConsum erPlugin
ĠmemToM emMergeOutputsThreshold
T O
10 240
19 776
ou nd
28 707
53 419
16 16
Ġ5 12
30 43
Ġ60 18
446 599
291 223
291 286
Ġ291 2237
Ġ291 28707
197 96
Ġ223 299
Ġ446 599
893 19776
Ġ893 19796
Ġ7280 588
Ġ111649 84
Ġ7282 172
446599 36
291223 52
291286 88
Ġ2912237 9
Ġ223299 44
Ġ446599 53
5 192
7 488
S H
17 76
78 24
56 72
Ġ7 37
7378 5168
Ġ7378 5192
120 7959
Ġ77 55
Ġ184462 92
1207959 552
7 506
9 5
P er
f ile
Ġ Event
18 79
Ġ2 1068
Ġ18 64
57 28
it ing
48 96
08 64
2800 4
Ġ89 07
291 228
Ġ291 228
Ġapp attempt
23922 452
Ġ7280 708
man ager
291228 32
Ġ291228 56
19 80
78 836
27 984
Ġ5 00
Ġ5 114
58 246
Ġ19 45
06 20
06 72
AT E
626 88
446 62688
291 27984
4466 3024
Ġ291 28004
5638 294
Ġ1116 5672
Ġ728 1996
Ġ78 836
7378 7488
Ġ7378 7506
Ġ1456 1616
1359 0864
1359 0672
Ġ125 20
Ġ4466 3043
Ġ2233 1228
8932 4912
Ġ8932 4928
89320 288
Ġ89320 305
Ġ33977 16
Ġ44662 712
Ġ223300 72
Ġ3397 668
Ġ135908 92
Ġ13590 701
ContainerAllocator Router
Ġ18446 872
Ġ111657 56
Ġ58246 483
58246 464
O T
Ġ2 284
91 296
ul ti
96 00
22 497
12 26
298 1
Job EventDispatcher
1310 4132
Ġ291 22497
Ġ728 0620
Ġ1844 7824
737 91296
913 12
291224 80
Ġ737 91312
9 318
A P
Ġ Job
17 17
it er
39 504
73 12
455 629
186 39504
Ġ12428 473
Line RecordReader
2392 1879
Ġ4659 876
34743 196
! /
: \
A d
A p
B lacklist
C ap
C RE
F ailures
J etty
K EN
N AP
S a
S lf
S ecret
S NAP
T e
U pp
Y ARN
a bi
a rted
b o
c ached
d s
d ob
f in
i Committer
j Log
j Logger
l ob
m eline
r iter
s ha
s lf
t ract
u ch
u ice
w s
x ies
Ġ ,
Ġ Instan
Ġ Connect
Ġ yarn
Ġ protocol
Ġ default
Ġ Input
Ġ Log
Ġ Http
Ġ HttpServer
Ġ jar
Ġ uberiz
Ġ Upp
Ġ YARN
ap ter
or With
re quest
re ated
20 92
Task EventType
Task EventDispatcher
Task Failures
ti ated
TaskAttempt EventType
TaskAttempt EventDispatcher
Ġs etup
Ġs ecret
Ġattempt Id
ing Input
ing En
Ġm od
Ġm any
Ġm ulti
Ġm uch
sta mp
app AttemptId
Container Cap
RM Proxy
77 44
sa fet
Ġb lacklist
Ġb ound
ul es
ctor ies
ut ting
pro xies
Ġmax TaskFailures
Ġmax ContainerCap
Dis able
Channel Connect
ĠW eb
ĠW riter
PB Impl
fa ctories
ĠF ile
ĠNo t
ĠM RClient
Ġin put
Rpc Server
orm al
09 60
Ġti meline
Ġcontainer token
Ġv ia
Ġw eb
Ġp ool
SET UP
mit ting
Job EventType
Ġjob Token
Ġcl uster
Request Log
Speculator EventDispatcher
ĠP utting
ot ingInput
ĠJ etty
local bo
ĠE mitting
Ġg lob
Ġg uice
Ġn ormal
comm on
Ġj etty
ĠEx tract
ĠC reated
Committer EventType
Ġnew Ap
1310 2981
ĠSt arted
ĠB lock
ĠResource Manager
lit y
Ġsplit s
Http RequestLog
ĠRegister ed
Ġreduce ResourceRequest
258 59
Factory PBImpl
webapp s
Ġcon fig
User s
Ġnode Blacklist
App Data
__ __
Ġstat ic
JobFinish Event
Ġservice Data
MRClient ProtocolPB
MRClient Service
node manager
Ġkey s
Ġkey Id
uberiz ed
fe Start
Qu otingInput
time stamp
Ġde fin
Select ChannelConnect
TO KEN
SH OT
Per Node
ĠJob Id
Ad apter
CRE ATE
Sa feStart
Secret Manager
SNAP SHOT
Te mp
abi lity
jLogger Adapter
sha re
ĠInstan tiated
ĠConnect ing
ĠLog ging
Ġuberiz ing
ĠUpp er
orWith SafeStart
request s
ingEn abled
Ġmod ules
safet y
Ġblacklist Disable
ĠmaxTaskFailures PerNode
ĠmaxContainerCap ability
ĠMRClient Service
RpcServer FactoryPBImpl
Ġcontainertoken s
Ġweb app
ĠjobToken SecretManager
localbo x
Ġglob al
ĠnewAp iCommitter
ĠnodeBlacklist ingEnabled
nodemanager s
QuotingInput Filter
Ġdefin ed
SelectChannelConnect orWithSafeStart
ĠblacklistDisable Percent
SelectChannelConnectorWithSafeStart up
5 786
S um
1445 24
19 52
ou s
57 90
il es
47 92
455 609
7378 4896
Ġ7378 4912
93 76
589 57
Ġ184462 24
5825 1952
Ġ5825 1980
Ġ145629 88
455609 44
0000 20
13 102
38 14
58 623
37 92
Ġ135 9318
5638 1226
1359 3152
973 44
Ġ3398 288
13102 192
Ġ1359318 0
A IL
F rom
n ing
45 559
Map ContextImpl
33 64
FS Output
Ġ19 445
Ġ58 248
Ġ33 97344
Ġ1116 4792
7378 7744
7378 3792
Ġ7378 7766
Ġ7378 3814
Ġ1456 2092
Ġ249 515
Ġ22330 212
710 9
34740 54
Ġ2106 77
89320 848
Ġ89320 865
1358 9376
131014 53
Ġ5669 5786
Ġ44659 194
Ġ18445 948
446591 68
58248 368
Ġ13589 393
Ġ291252 41
Ġ184469 36
Sum mer
45559 394
FSOutput Summer
Ġ58248 388
) :
15 84
57 365
28 16
Ġre ached
24 28
ĠF AIL
Ġmap ResourceRequest
Ġ60 5
Ġ60514 806
Ġ5669 5790
T c
r on
at us
ch ron
53 456
yn chron
Process or
Ġ58 253
Ġ63 299
Up date
582 53456
Ġ1456 3364
1359 0128
Ġ60515 791
Ġ60515 787
Ġ3397 532
Ġ13590 155
Tc p
Ġ58253 484
st atus
53 44
60 600
St r
Ġ135 816
ull y
Ġ33 953
ĠSt ack
ĠSt ate
Ġ145 60600
1358 1584
Ġ60514 810
5824 2400
Ġ5824 2428
ĠWa ited
ĠWa iting
ĠBlock ed
status Update
Ġ135816 06
Ġ33953 96
re ate
29 68
56 378
Ġ3 1
628 16
Ġ125 13
Ġ60515 100
Ġ60515 836
Ġ60515 104
Ġ60515 840
Ġ1378 7
Ġ60514 392
Ġ60517 368
Ġ60517 372
Ġ1723348 04
Ġ217009 502
Ġ605 14396
56378 38
20 888
14 24
Ġc all
58 40
58 251
79 22
Ġ58 251
97 13
239 20888
197 36
Ġst op
Ġ145 62816
23922 269
Ġ1723348 08
Ġ60516 677
58251 264
Ġ58251 292
d isk
g h
i p
Ġ run
Ġ Communic
Task Re
ou gh
Ġf iles
Ġ18 636
62 24
Ġin to
her e
cor ds
34 24
pre cords
Ġfinal Merge
Ġ216 999
Ġ60515 385
Ġen ough
ĠT here
Sel ector
Ġ60516 681
ski p
ski precords
Ġ60513 769
Ġ60513 765
port er
reate BlockOutputStream
Ġcall ed
Ġrun ning
ĠCommunic ation
TaskRe porter
Ġ216999 709
re ce
15 232
43 80
run New
Ġ8 54
1310 1342
Ġ12427 373
do IO
Ġ60515 389
Writ er
rece ive
runNew Mapper
et urn
15 14
20 32
ĠR eturn
60 96
152 28
Ġ2170 15232
Ġ2170 15228
Ġ589 50
Ġdata node
ip eline
ĠReturn ing
Ġ 36
10 56
77 28
99 48
153 60
1310 1445
1310 1514
Ġ124278 21
Ġ589 57
Ġ217009 506
Ġ21699 9713
10 71
Ġ18 637
22 788
84 00
500 81
Filter OutputStream
34740 257
Ġ12428 089
239215 8
Ġ2169727 50
bu ild
P ing
l ost
Ġ *
Ġ 32
eas ed
78 96
In f
ill ing
Rpc Response
form IO
206 8
ĠK illing
per formIO
Ġ12427 533
Ġrel eased
186 37
Block L
788 35
readIn t
Ġ2169727 54
Ġ216990 140
receive RpcResponse
Ping InputStream
S eriali
Ġ Token
FS FileOutputStream
ĠNo de
Local FSFileOutputStream
Ġ60 133
Ġ12427 301
Ġ125 14
Ġ46 60
Writable Seriali
Ġ216991 624
Ġ216988 123
Ġ216990 144
78 88
76 206
83 25
70 92
Ġ20 45
240 76
Ġst ate
Ġ216991 628
Ġ216988 127
E H
H EH
a ved
Ġ History
ce Job
nd ing
ĠS aved
sta nding
43 86
91 17
Ġfor ceJob
Un registered
99 29
ow ed
Ġsh ould
69 60
Ġth is
ĠJ HEH
ĠE rror
Ġ2169 762
Ġ2169 76206
Ġall owed
Ġservice s
Ġ2170116 67
Ġ2170116 63
Check er
Ġout standing
ĠforceJob Completion
Ġshould Unregistered
Ġ2169762 10
B y
k To
at eg
0000 21
78 56
48 49
40 35
ee kTo
102 56
206 4
206 13
700 8
Ġup date
Ġ728 16
Ġ249 517
430 78
23919 39
Str ateg
Inf o
Strateg y
P os
en ce
10 85
Ġs o
Ġf inish
28 83
44 68
87 13
Ġb e
48 56
48 51
Ġ19 7
ition Cache
Re fer
Ġ20 43
68 56
291 300
Ġ291 300
277 4
305 53
2392 493
Ġ1970 88
Ġclean ly
10256 411
Pos itionCache
Ġfinish ing
Refer ence
0 2064
i re
Ġ Exception
14 11
17 872
Con ver
43 120
13 60
13 248
Ġ17 2
Ġ17 2968
215 795
ctor y
29 44
48 491
48 450
Ġ5 41
Ġ5 418
Ġ5 400
Ġ6 30553
Ġd ire
54 77
72 912
Ġ104857 591
187 296
88 78
69 187296
Ġ89 105
Ġ89 20613
Ġ48 215795
Ġ63 29
67 36
63 41
216 02064
216 72912
Ġ4824 6341
Ġ890 9929
133 12
94 24
692 17872
Ġ121 126
Ġ121 22788
3474 2883
Ġ1730 4468
Ġ70 1411
Ġ8917 573
Conver ter
Ġ172968 24
48491 152
48450 768
Ġ5418 228
Ġ5400 516
Ġdire ctory
Ġ89105 41
Ġ121126 92
p ar
Ġ staging
at s
et ting
17 48
45 54
1445 23
ĠS etting
Ġ2 36
19 888
ing Checker
49 47
Host Exception
60 72
55 98
48 507
Unknown HostException
Ġ5 412
Ġ5 420
35 40
36 96
Ġ22 2764
ĠF inal
Ġd iagnostics
80 752
69 205
ĠTask HeartbeatHandler
89 1056
ĠP ingChecker
ContainerManagementProtocolProxy Data
98 14
Ġ48 2339
Token Service
ĠSt ats
240 56
500 490
Ġsup er
216 486
216 80752
Ġ4824 1717
Ġ890 5477
ĠStopp ed
Ġ125 122
Remote BlockReader
Ġ891 1085
692 13248
Ġ121 26896
Ġ121 24056
Ġ677 160
Ġ1730 3312
Ġ1730 1360
Ġ8915 441
Ġ70 9216
Ġ89130 37
Ġ99 03
4849 6224
Converter Utils
48507 584
Ġ5412 172
Ġ5420 188
69205 440
Ġ482339 39
216486 88
9 735
C OMMIT
E rror
d f
g o
p ending
v ro
Ġ 786
Ġ JobF
18 53
Ġ2 33
41 12
Ġc an
87 00
13 24
read With
12 78
25 60
59 84
Ġ8 5
inished Event
ĠRes ult
396 37
Ġ57 9117
4556 311
Ġ48 2
347 39637
652 568
130 652568
208 28
508 56
74 24
306 96
Ġ121 28
862 30696
Ġ8918 393
7888 3312
Ġ197 20828
ĠJobF inishedEvent
Ġcan Commit
readWith Strategy
Ġ579117 93
L ock
O b
d es
15 37
10 79
Ġ2 50856
19 86
78 97
62 97
28 17
48 514
Ġ5 8030
35 21
58 315
Ġ6 76
Ġ6 959
39 20
Ġ19 750
79 0018
88 62
69 24
69 224
84 273
100 3424
1310 4554
64 60
216 674
296 30
Ġ890 8325
Ġ891 3521
Ġ8908 433
Ġ1730 6072
1358 6736
Ġ3396 684
Ġ4825 2774
34744 292
Ġ541 6856
Ġ12128 560
Ob ject
48514 240
Ġ58030 301
Ġ6959 20
Ġ19750 456
790018 24
69224 288
216674 24
1 156
Ġ Del
et ing
15 44
Ġ2 69
16 36
27 1024
Ġ17 305
Ġ17 184
55 629
46 624
36 420
58 26
58 186
76 448
Ġ10 31
Ġ10 374
37 57
52 00
Ġ19 743
79 25
03 87
Ġ12 50
0014 23
Ġ89 089
68 200
Ġ58 001423
Ġ48 250
Ġsuccessf ully
Ġ78 36420
456 80
Ġ243 380
893 239
789 88
789 76448
Ġ890 8713
Ġ145 46624
Ġ145 78988
313 45680
23923 99
Ġ1974 4112
Ġun registered
Ġ89076 37
6922 1776
Ġ89114 49
Ġ5800 4947
9735 20
7897 2944
58315 952
ĠDel eting
Ġ17305 444
58186 496
Ġ10374 147
Ġ19743 236
Ġ89089 53
Ġ48250 246
3 147
P ipeline
a it
v e
00 57
00 76
or k
15 72
15 03
18 52
Ġ2 215
78 9948
23 84
23 152
23 267
Ġ17 306
Ġ17 3106
60 780
26 00
ocation s
Ġ22 1986
58 88
Ġ10 501
59 80
946 88
946 736
Ġ12 140
Ġ26 993
Ġ26 60780
106 43120
98 55
Ġ48 271024
4927 6
ĠB ad
Ġ78 68200
208 00
93 2960
Ġ890 6557
Ġ890 3757
Ġ890 7925
310 5
887 94688
692 20800
Ġ1730 5200
Ġ8909 197
5824 7008
Ġ1974 8700
Ġ1457 2400
Ġ1457 5980
5828 9600
6922 5888
Ġ678 23152
Ġ4825 4386
Ġ580 23267
Ġ145617 52
5830 3920
Selector Impl
BlockL ocations
4856 3056
Ġ236 684
Ġ233 240
Ġ482 49276
1079 7312
6924 2560
3147 2800
789948 00
Ġ17306 472
Ġ173106 40
Ġ221986 72
Ġ10501 292
Ġ12140 764
Ġ26993 28
9 580
S eekTo
b lock
15 32
in it
14 576
18 768
main ing
49 620
62 80
57 76
ĠA ll
13 01
Ġre maining
27 17
33 85
Ġ5 1
Ġ5 417
Ġ5 419
Ġ5 428
66 45
Ġ10 426
99 1424
Ġ7 43078
Ġ8 544
Ġ19 75
71 008
Ġ20 27
68 11
Ġ24 7856
Ġ24 1544
794 24
4556 3385
282 44
98 480
1310 1853
216 71008
216 79424
455 60
168 16
Ġ78 49620
Ġ890 6297
314 613
609 5
633 00
966 176
217 14576
313 98480
Ġ8909 889
Ġ70 7922
Ġ8918 797
Ġ89076 57
Ġ89130 25
Ġ1048 9855
Ġ699 496
Ġ786 5344
block SeekTo
Ġ5417 752
Ġ5419 856
Ġ5428 644
Ġ10426 966
314613 76
T ext
W ork
Ġ as
Ġ 35
10 767
20 45
14 201
17 94
0000 22
41 246
62 96
91 152
53 008
53 884
60 83
55 52
Ġ22 196
Ġ6 38
Ġ6 86
Ġ10 445
08 28
54 204
Ġ19 738
79 0076
170 65
735 6
69 04
Ġ12 1278
Ġ89 223
Ġ57 9814
98 45
98 543
Ġ135 909
500 776
130 24
Ġ78 53884
Ġ78 54204
Ġ1456 6280
1553 6
789 53008
1359 0960
Ġ125 19
579 5
579 21
Ġ244 148
Ġ891 3333
314 16816
314 15536
976 592
110 3
360 90
Ġ8915 445
Ġ33977 40
Ġ477 69
Ġ8918 205
Ġ89076 13
Ġ8917 765
Ġ678 14201
Ġ580 36090
Ġ89114 41
Ġ1044 4035
Ġ170 28244
4851 1200
8878 5728
Ġ676 57921
8862 9424
Ġ269 1852
5826 5120
Ġ1031 1532
Ġ1250 90
Ġ2215 7356
Ġ1975 1904
Ġ2027 4616
6811 2976
45560 43
10767 408
41246 128
Ġ22196 432
Ġ10445 315
Ġ19738 252
790076 16
Ġ121278 00
Ġ89223 21
Ġ579814 81
i et
00 65
10 705
10 709
14 08
17 280
45 5598
18 608
43 28
41 39
41 188
77 448
27 44
29 788
55 457
48 519
26 992
38 368
Ġ22 1843
58 23
Ġ6 776
76 468
59 51
37 296
08 40
52 17
06 577
42 56
02 56
606 4
Ġ12 56
Ġ20 21
Ġ20 216
Ġ89 208
Ġ89 17065
Ġ89 06577
Ġ57 994
Ġ26 74
Ġ26 796
Ġ26 77448
Ġ26 76468
233 12
347 38368
5638 114
Ġ33 978
519 20
Ġ78 532
Ġ78 629
582 17280
Ġ890 2817
517 85
887 26992
887 37296
887 23312
Ġ891 1537
314 13024
314 51920
680 462
107 18608
Ġ121 29788
Ġ8908 585
10696 720
Ġ228 43
Ġ677 55457
Ġ677 51785
Ġ8909 297
Ġ1974 1496
Ġ1029 7092
Ġ1457 0840
Ġ2218 1748
Ġ2218 0828
Qu iet
5828 3360
Ġ1048 0387
Ġ1044 1503
flush Buffer
Ġ1455 4320
Ġ1701 1572
7896 5984
1794 872
10705 872
10709 792
455598 53
41188 368
48519 152
Ġ221843 24
Ġ6776 5795
Ġ20216 843
Ġ89208 53
Ġ57994 455
Ġ2674 180
Ġ26796 52
Ġ78532 56
Ġ78629 80
680462 88
Quiet ly
3 6095
6 792
D at
D own
P ack
a vro
c f
10 59
20 496
14 361
1445 162
Ġ2 279
ic Dat
87 120
16 07
24 73
60 560
ut Down
96 38
Ġ5 140
35 876
36 67
Ġ16 996
Ġ16 980
Ġ10 2717
34 175
07 48
05 440
69 76
Ġ12 1301
Ġ20 1156
Ġ89 14361
um Writer
63 60
iz er
Ġ12427 161
205 60560
305 48
Ġ77 5719
sh utDown
887 076
887 05440
140 32
149 09
680 53
stop Quietly
write By
485 20496
339 40
Ġ677 36095
Ġ677 33940
410 87120
Writable Utils
Ġ8915 597
Ġ8915 685
Ġ8909 881
Ġ246 35876
2392 2384
Ġ2217 6904
Ġ2217 6360
6798 5776
98543 504
6792 1408
Pack et
icDat umWriter
Ġ5140 140
Ġ16996 444
Ġ16980 352
Ġ102717 80
Ġ121301 24
Ġ201156 17
Ġ775719 91
shutDown Job
887076 16
v i
Ġ2 409
13 13
24 273
Ġ17 013
Ġ5 414
46 152
Ġ16 99
58 368
76 00
Ġ10 2907
08 46
52 624
Ġ19 46
05 141
Ġ20 1915
Ġ20 214
Ġ89 324
Ġ89 14909
Ġ89 24273
Ġ89 05141
75 28
Ġ26 720
84 272
347 46152
216 58368
lock s
Ġ1116 53
Ġ249 528
133 40
Ġ4466 0065
680 52624
Ġ2106 80
10688 160
Ġ8915 293
Ġ7883 53
Ġ111650 12
Ġ1029 6460
Ġ1029 6064
446600 48
4118 5840
4118 4256
Ġ21699 85
4116 3024
Ġ633 006
Ġ170 13340
Ġ686 843
Ġ2021 2744
Ġ2279 488
68053 360
Ġ17013 156
Ġ5414 592
Ġ102907 56
Ġ201915 10
Ġ20214 328
Ġ26720 40
A I
A r
c b
Ġ 37
re vi
10 18
10 409
20 4383
20 4928
14 336
18 20
78 17
78 977
Ġ17 0014
60 21
48 6083
Ġ5 40
47 168
22 192
Ġ6 58
39 60
25 45
Ġ7 20
09 44
232 12
724 8
Ġ20 2
Ġ20 189
Ġ89 213
Ġ89 10409
68 0057
Ġ510 9580
5638 47
515 779
399 3
144 00
Ġ77 486083
Ġ77 515779
984 87280
778 47168
770 56
256 410
Ġ8908 913
146 1
Ġ246 14400
Ġ1974 4380
Ġ1029 0256
Ġ2462 1820
4116 1024
Ġ5800 6021
6798 1552
Ġ1455 8340
Ġ8907 141
Ġ5114 312
Ġ51 23212
2045 7248
9845 7600
5823 3360
5217 28
Ġ1256 521728
9638 08
Ġ2409 52
Ġ1699 5388
Ġ1946 1792
AI TING
revi ous
204383 20
204928 48
78977 520
Ġ170014 28
Ġ20189 504
Ġ89213 93
680057 12
256410 27
2 179
Ġ 38
10 708
20 24
20 65
20 453
19 12
62 176
77 726
27 46
Ġ5 113
35 24
12 45
56 53
Ġ10 447
59 40
65 24
Ġ19 43
Ġ19 44
06 60
31 13
04 221
03 297
05 296
Ġ20 12
280 96
Ġ89 04221
Ġ89 03297
73 44
Ġ26 77056
98 491
2747 2
318 68
Ġ78 546
Ġ890 6645
204 876
Ġ891 3993
314 18768
778 50
778 05296
Ġ3417 2179
985 22192
985 27472
5514 3696
Ġ1378 5924
Ġ246 30548
Ġ246 31868
Ġ2462 2816
Response Processor
Ġ775 19736
Ġ512 1912
Ġ7755 5951
Ġ7755 0660
Ġ1945 1324
____ .
10708 224
20453 872
Ġ5113 468
Ġ10447 270
98491 264
Ġ78546 92
204876 48
3 776
5 2155
S up
s eriali
z ation
Ġ 1445
10 69
10 112
14 47
78 08
43 04
44 2473
13 73
77 762
Ġ5 097
50 60
Ġ6 32
56 598
25 16
up date
Ġ7 13
52 16
Ġ19 443
34 172
7777 3776
417 1
Ġ11 164
Ġ89 069
Ġ24 603
98 47
98 4139
291 26
347 4171
4466 0000
Ġ291 26
240 33
Ġ216 992
Ġ2169 800
Ġ2169 867
Ġ2169 874
305 12
Ġ77 442473
887 28096
Ġ4466 0022
203 91152
Ġ891 1373
Ġ12428 465
Ġ8543 052
Ġ677 56598
Ġ11165 000
Ġ2170 23
Ġ44659 148
Ġ2218 2024
446591 20
WritableSeriali zation
par k
Lock Sup
writeBy tes
77726 544
1245 3667
Ġ1943 1636
Ġ1944 0748
77762 992
Ġ5097 788
Ġ19443 444
34172 208
Ġ11164 780
Ġ89069 89
Ġ24603 496
984139 84
LockSup port
D efault
T rack
0000 23
45 72
45 75
ing RecordReader
78 32
41 186
ad ef
23 165
Ġ17 291
55 18
read Line
read Default
33 36
96 64
38 240
Ġ14 6
21 6296
58 21
76 36
Ġ10 33
Ġ10 296
Ġ10 297
40 16
09 75
Ġ19 66
Ġ19 462
Ġ20 217
Ġ89 23165
Ġ48 193
0024 0
Ġ12427 277
Ġ12427 909
Ġ12427 657
Ġ223 30512
205 00240
186 36
186 72
687 40
788 39
Ġ77 538
149 18
649 28
8932 2048
680 510
985 10112
485 62176
Ġ8908 109
Ġ8908 521
Ġ8932 2065
691 64928
Ġ8909 157
4118 8688
New Track
Ġ2462 7528
Peer Cache
fill Buffer
ff db
Ġ1701 2764
Ġ512 5060
Ġ8907 785
Ġ540 7424
Ġ658 166
Ġ202 14918
77850 144
41186 432
Ġ17291 232
readDefault Line
216296 96
Ġ10296 608
Ġ10297 172
Ġ19462 536
Ġ20217 188
Ġ48193 401
Ġ77538 589
680510 56
NewTrack ingRecordReader
f c
m inint
u edS
20 457
77 7832
55 147
48 480
26 512
35 08
46 88
50 315
Ġ14 553
Ġ14 6557
58 05
83 224
Ġ10 74
Ġ7 0003
Ġ7 379
Ġ7 1018
65 21
65 968
Ġ19 456
86 943
Ġ12 1200
396 8
Ġ28 86943
4556 358
Ġ63 879
552 19
552 26
63 57
500 57
737 90
246 73
Ġ249 521
330 2339
Ġ77 50315
Que uedS
133 44
Ġ22330 324
558 60
778 26512
778 13344
589 50
914 064
3417 45
Abstract QueuedS
Ġ1378 62
Ġ8932 1313
89320 368
Ġ89320 393
Ġ228 516
Ġ223300 92
Ġ246 18672
Ġ124278 89
89321 296
Ġ8917 205
Check sum
Ġ34 173
Ġ19709 236
Ġ12426 893
Ġ12426 761
99808 464
78836 944
Ġ5114 320
Ġ1945 3336
Ġ78836 928
58623 168
Ġ19445 800
ynchron izer
Ġ2012 2746
9847 4688
5821 2032
Ġ1966 3524
20457 280
777832 00
48480 304
Ġ14553 008
Ġ146557 92
Ġ70003 77
Ġ71018 41
Ġ19456 628
Ġ121200 76
Ġ2886943 49
Ġ249521 16
Ġ7750315 4
AbstractQueuedS ynchronizer
. <
> (
L oc
49 76
Ġ21 376
28 66
87 36
77 12
60 166
48 30
36 64
66 56
58 613
83 24673
25 488
ated Block
Ġ7 269
09 28
51 004
06 352
72 53
get BlockLocations
Ġ49 0846
Ġ20 318
Ġ20 83224
For Pipeline
68 36
Ġ28 8340
239 24033
67 39
291 264
Ġ12427 969
Ġ12427 529
Ġ291 264
5638 554
130 12
Ġ446 60166
305 44
Block ForPipeline
893 25488
Ġ249 51004
Ġ44 65968
578 30544
Ġ145 62
Ġ145 13012
922 501
Ġ2233 1372
Ġ3417 5940
Ġ3417 4575
249 9
5514 6096
Ġ1378 6524
Ġ8932 5514
855 06352
Ġ8543 992
Ġ8543 648
Ġ1718 45
020 80
Ġ7883 2499
Ġ124278 73
8427 0944
Ġ111650 36
4465 9664
9980 4016
44660 144
Ġ288 922501
Ġ111649 16
Ġ13786 864
Ġ18639 482
99806 912
Ġ210677 36
Ġ63299 431
78835 408
Ġ72816 00
Ġ249517 28
Ġ197088 52
1059 02080
34175 968
Ġ788353 80
Ġ720 2545
Ġ1445 7636
update BlockForPipeline
Ġ713 3113
55147 456
5805 2048
341745 92
Loc atedBlock
Ġ21376 588
Ġ7269 537
Ġ490846 64
Ġ20318 567
Ġ2083224 7
Ġ288340 204
291264 00
Ġ291264 20
Ġ4465968 2
LocatedBlock s
2 576
i ver
p art
ce iver
17 234
Ġ2 888
49 594
41 28
Ġ18 642
Conn ected
62 33
48 620
36 4572
38 875
Ġ14 513
Ġ14 650
Ġ14 653
new Connected
58 56
58 497
Ġ6 977
Ġ6 985
Ġ6 995
25 98
Ġ10 5653
Ġ7 129
Gener icDatumWriter
Ġ19 628
get RemoteBlockReader
88 84
Re ceiver
Ġ20 47
396 14
396 14032
Ġ28 8324673
552 00
1310 5518
5638 0975
Ġ20324 632
186 395
310 1
Ġ195 48620
Ġ46 598
580 55200
Ġ990 3508
Ġ2106 7
227 38875
842 62
next BlockOutputStream
next Tcp
Ġ288 364572
5860 3152
7883 2528
Ġ19708 132
Ġclean up
58623 440
From Tcp
Ġ19445 134
Work er
Packet Receiver
Ġ146 55860
58613 888
Ġ2888 17234
Ġ18642 505
Ġ14513 800
Ġ14650 788
Ġ14653 472
newConnected Peer
Ġ6977 013
Ġ6985 233
Ġ6995 969
Ġ105653 983
Ġ7129 173
Ġ19628 334
getRemoteBlockReader FromTcp
186395 20
Ġ46598 80
nextTcp Peer
9 296
15 25
10 88
Ġ2 1069
91 232
91 202
53 68
13 62
27 94
26 708
96 416
30 71
30 785
58 608
56 80
Ġ3 107
02 184
Ġ104857 592
73 24
