{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"er":261,"Ġ1":262,"00":263,"Ġ2":264,"in":265,"Ġ0":266,"or":267,"ti":268,"on":269,"ĠD":270,"Ġs":271,"it":272,"ce":273,"ec":274,"un":275,"005":276,"ta":277,"17":278,"Ġ16":279,"03":280,"an":281,"Ġc":282,"Ġ[":283,"Ġ2005":284,"ĠDec":285,"ck":286,"te":287,"ar":288,"ld":289,"ro":290,"al":291,"27":292,"ork":293,"work":294,"worker":295,"oti":296,"es":297,"Sta":298,"Ġ22":299,"Ġ2227":300,"Ġin":301,"hi":302,"Ġ17":303,"02":304,"noti":305,"()":306,"init":307,"hild":308,"notice":309,"jk":310,"Ġchild":311,"et":312,"ag":313,"is":314,"oun":315,"ound":316,"bo":317,"Ġ04":318,"ot":319,"Ġ1702":320,"En":321,"en":322,"anag":323,"anager":324,"Manager":325,"err":326,"error":327,"mo":328,"Ġworker":329,"Env":330,"ĠworkerEnv":331,"ow":332,"ht":333,"Sun":334,"ĠP":335,"Ġ05":336,"15":337,"se":338,"Ġo":339,"ed":340,"Mon":341,"Stack":342,"us":343,"mod":344,"ll":345,"ĠI":346,"fal":347,"false":348,"ock":349,"re":350,"ard":351,"ore":352,"Ġsc":353,"Ġjk":354,"board":355,"oreboard":356,"Ġscoreboard":357,"Found":358,"lot":359,"ĠFound":360,"Ġslot":361,"pd":362,"Ġd":363,"tr":364,"erv":365,"pro":366,"id":367,"ity":368,"ing":369,"ower":370,"Ġ6":371,"ue":372,"Ġf":373,"13":374,"Vis":375,"tiv":376,"ess":377,"as":378,"le":379,"true":380,"om":381,"38":382,"ocked":383,"one":384,"hone":385,"ctiv":386,"la":387,"Ġ/":388,"ut":389,"ĠPhone":390,"con":391,"per":392,"ice":393,"14":394,"tpd":395,"ties":396,"Ġsta":397,"workers":398,"etc":399,"httpd":400,"Ġok":401,"proper":402,"conf":403,"properties":404,"ervice":405,"Service":406,"ManagerService":407,"Ġstate":408,"Ġmod":409,"Activ":410,"ad":411,"Ġerror":412,"20":413,"tion":414,"tus":415,"Bar":416,"Status":417,"ĠPhoneStatus":418,"ĠPhoneStatusBar":419,"ic":420,"mm":421,"16":422,"ull":423,"ig":424,"ect":425,"nt":426,"ight":427,"Activity":428,"ness":429,"Ġn":430,"26":431,"owerManagerService":432,"400":433,"reen":434,"Ġb":435,"creen":436,"Ġ-":437,"ate":438,"roll":439,"and":440,"screen":441,"Val":442,"Rect":443,"ounds":444,"Bounds":445,"StackVis":446,"StackBounds":447,"Ġdocked":448,"Ġfull":449,"Ġfullscreen":450,"wa":451,"umm":452,"ind":453,"ary":454,"mode":455,"ummary":456,"47":457,"ĠPowerManagerService":458,"Ġset":459,"01":460,"com":461,"00500":462,"40000500":463,"ff":464,"roid":465,"android":466,"ation":467,"Wind":468,"get":469,"Window":470,"im":471,"Ġ18":472,"46":473,"Ġ3":474,"Ġ06":475,"lay":476,"Ġ8":477,"10":478,"Ġ7":479,"33":480,"bi":481,"55":482,"ke":483,"play":484,"pp":485,"Ġ=":486,"isplay":487,"ew":488,"Ġu":489,"ask":490,"In":491,"Visi":492,"user":493,"ĠActivity":494,"04":495,"ĠDisplay":496,"Ġget":497,"Con":498,"lity":499,"Ġre":500,"troll":501,"Controll":502,"Controller":503,"Power":504,"ĠV":505,"Ġm":506,"06":507,"Ġ1820":508,"bility":509,"Visibility":510,"right":511,"Ġbright":512,"ĠDisplayPower":513,"Ġbrightness":514,"ĠDisplayPowerController":515,"ste":516,"yste":517,"Ġ07":518,"pdate":519,"ĠActivityManager":520,"ystem":521,"=-":522,"Ġr":523,"lg":524,"ication":525,"18":526,"uto":527,"ble":528,"08":529,"ith":530,"Ui":531,"UiVisibility":532,"Ġ10":533,"ol":534,"vis":535,"Ġcom":536,"39":537,"Ġe":538,"49":539,"st":540,"11":541,"59":542,"Locked":543,"fa":544,"ul":545,"ted":546,"System":547,"SystemUiVisibility":548,"fication":549,"all":550,"face":551,"ple":552,"ĠA":553,"pol":554,"ent":555,"icy":556,"policy":557,"36":558,"Ġnew":559,"Ġ13":560,"able":561,"48":562,"lock":563,"Noti":564,"Notification":565,"Id":566,"Ġvis":567,"On":568,"serv":569,"server":570,"ho":571,"56":572,"58":573,"gr":574,"Ġold":575,"Ġdi":576,"),":577,"adj":578,"ĠdockedStackVis":579,"ĠdockedStackBounds":580,"ĠfullscreenStackVis":581,"ĠfullscreenStackBounds":582,"wake":583,"ĠsetSystemUiVisibility":584,"Ġmask":585,"ĠnewVal":586,"ĠoldVal":587,"Ġdiff":588,"Light":589,"auto":590,"ful":591,"ks":592,"man":593,"ost":594,"ual":595,"uas":596,"wks":597,"inpro":598,"itmode":599,"boot":600,"boost":601,"enable":602,"ady":603,"waitmode":604,"comple":605,"userId":606,"Ġready":607,"gress":608,"wakeful":609,"manual":610,"uasummary":611,"wksummary":612,"inprogress":613,"bootcomple":614,"boostinprogress":615,"waitmodeenable":616,"wakefulness":617,"bootcompleted":618,"Lights":619,"07":620,"54":621,"51":622,"52":623,"Ġ26":624,"cent":625,"19":626,"Sc":627,"wm":628,"tent":629,"Ġ9":630,"ĠsetLights":631,"ĠsetLightsOn":632,"37":633,"at":634,"Ġ20":635,"ĠW":636,"57":637,"Ġcall":638,"BM":639,"HBM":640,"ĠHBM":641,"ur":642,"ud":643,"53":644,"21":645,"32":646,"50":647,"vent":648,"Ġupdate":649,"Alg":650,"ĠR":651,"ĠStack":652,"orith":653,"rollAlg":654,"ScrollAlg":655,"ĠStackScrollAlg":656,"orithm":657,"ĠStackScrollAlgorithm":658,"..":659,"22":660,"ver":661,"Ġ210":662,"Ġl":663,"Ġ19":664,"29":665,"000":666,"lap":667,"verlap":668,"44":669,"nim":670,"Ġevent":671,"am":672,"lag":673,"lags":674,"Ġta":675,"urface":676,"nimat":677,"Ġ2105":678,"op":679,"Ġw":680,"05":681,"ipp":682,"ipping":683,"43":684,"69":685,"Ġdo":686,"12":687,"09":688,"end":689,"Ġuid":690,"GE":691,"TA":692,"ten":693,"App":694,"ve":695,"Ġ28":696,"41":697,"unn":698,"Ġnot":699,"put":700,"Ġfalse":701,"SK":702,"iting":703,"TASK":704,"AL":705,"EAL":706,"Ġho":707,"Ġout":708,"imiting":709,"Ġcaller":710,"ĠREAL":711,"Ġlimiting":712,"Ġdoes":713,"GET":714,"unning":715,"TASKS":716,"Ġhold":717,"Ġoutput":718,"40":719,"tencent":720,"oc":721,"ĠgetT":722,"ĠgetR":723,"45":724,"Surface":725,"Ġ101":726,"28":727,"ac":728,"Ġp":729,"cl":730,"ui":731,"de":732,"io":733,"Ġis":734,"Ġ32":735,"cel":736,"ancel":737,"move":738,"Ġflags":739,"ocation":740,"Ġcancel":741,"Ġ176":742,"pend":743,"ĠT":744,"Ġt":745,"uspend":746,"est":747,"31":748,"Ex":749,"Int":750,"Update":751,"25":752,"intent":753,"Ġflg":754,"1000":755,"67":756,"roy":757,"udio":758,"estroy":759,"30":760,"Ġsuspend":761,"200":762,"Location":763,"Inter":764,"rget":765,"ĠWindow":766,"State":767,"Ġtarget":768,"Ġpid":769,"Pro":770,"Tim":771,"ss":772,"cess":773,"remove":774,"Ġ10111":775,"ĠWindowManager":776,"Time":777,"Out":778,"ans":779,"ĠbrightnessIn":780,"ĠbrightnessOut":781,"Ġrate":782,"ĠAnimat":783,"ĠAnimating":784,"Intent":785,"rans":786,"333":787,"Process":788,"23":789,"WindowManagerService":790,"AppProcess":791,"unningAppProcess":792,"ĠgetRunningAppProcess":793,"ĠgetRunningAppProcesses":794,"Pad":795,"ĠPhoneInter":796,"faceManager":797,"Ġ2626":798,"ĠPhoneInterfaceManager":799,"ĠNotification":800,"asks":801,"ame":802,"ĠNotificationManager":803,"\",":804,"Block":805,"ding":806,"ĠS":807,"Ġoverlap":808,"lation":809,"opPad":810,"ĠgetTopPad":811,"ranslation":812,"ĠgetTopPadding":813,"No":814,"iew":815,"...":816,"Lock":817,"View":818,"eS":819,"WindowState":820,"uld":821,"Ġsho":822,"BlockLocation":823,"uldBlockLocation":824,"ĠshouldBlockLocation":825,"Ġ{":826,"Ġ03":827,"ĠeventTime":828,"34":829,"mp":830,"qq":831,"Ġuser":832,"/.":833,"35":834,"ake":835,"xx":836,"removeWindow":837,"si":838,"Ġ}":839,"Ġcmp":840,"ActivityNo":841,"Ġ369":842,"UpdateLocked":843,"ĠuserActivityNo":844,"ĠuserActivityNoUpdateLocked":845,"Cl":846,"el":847,"anel":848,"kipping":849,"Ġwith":850,"ĠSkipping":851,"\".":852,"24":853,"PowerManagerService":854,"Wake":855,"Ġ\"":856,"Ġtr":857,"Ġblock":858,"ĠAudio":859,"Locks":860,"WakeLocks":861,"Ġblocker":862,"ĠAudioManager":863,"Di":864,"Hid":865,"Overlap":866,"destroy":867,"dHid":868,"qui":869,"ensi":870,"edActiv":871,"tive":872,"mmedActiv":873,"atedHid":874,"Ġex":875,"ĠupdateCl":876,"ĠupdateDi":877,"ĠisOverlap":878,"ĠTranslation":879,"eSensi":880,"mmedActivatedHid":881,"ĠupdateClipping":882,"ĠupdateDimmedActivatedHid":883,"eSensitive":884,"ĠupdateDimmedActivatedHideSensitive":885,"ww":886,"Ġac":887,"Ġ27":888,"mobi":889,"leqq":890,"mobileqq":891,"uded":892,"cluded":893,"Excluded":894,"ĠwithExcluded":895,"601":896,"activ":897,"ang":898,"hang":899,"Ġby":900,"ter":901,"0000":902,"ĠPanel":903,"ĠPanelView":904,"42":905,"108":906,"ffff":907,"has":908,"Ġ5":909,"Ġ326":910,"Ke":911,"ch":912,"Ġ(":913,"Ġto":914,"destroySurface":915,"Key":916,"Animat":917,"Ġname":918,"Ġ28601":919,"Animator":920,"=\"":921,"hide":922,"tras":923,"Ġtag":924,"Ġws":925,"Ġextras":926,"76":927,"null":928,"ĠcancelNotification":929,"WindowStateAnimator":930,"96":931,"ex":932,"pe":933,"Ġ59":934,"Ġ15":935,"Auto":936,"Ġfor":937,"2619":938,"Autohide":939,":-":940,"79":941,"Ġ12":942,"cli":943,"89":944,"Ġke":945,"Ġkey":946,"Chang":947,"fi":948,"Ġ11":949,"Tasks":950,"ecent":951,"ord":952,"ecord":953,"Ġinter":954,"Ġres":955,"fo":956,"ory":957,"Ġ273":958,"ase":959,"87":960,"ype":961,"40000":962,"ack":963,"ele":964,"gu":965,"age":966,"ount":967,"Ġret":968,"Ġcalled":969,"guard":970,"ir":971,"ml":972,"Ġ...":973,"ffect":974,"Ġrunning":975,"ĠgetTasks":976,"action":977,"91":978,"Record":979,"to":980,"ule":981,"Ġ146":982,"cep":983,"Ġ67":984,"60":985,"Ġ255":986,"activity":987,"To":988,"um":989,"671":990,"913":991,"cqui":992,"ring":993,"asing":994,"ĠAcqui":995,"ĠRele":996,"ĠAcquiring":997,"ĠReleasing":998,"99":999,"Type":1000,"bid":1001,"den":1002,"lication":1003,"ner":1004,"qu":1005,"var":1006,"Ġ21":1007,"ĠDir":1008,"Ġinde":1009,"html":1010,"ectory":1011,"Ġrule":1012,"Ġ2639":1013,"www":1014,"Ġforbid":1015,"client":1016,"cept":1017,"ĠDirectory":1018,"Ġindex":1019,"Ġforbidden":1020,"100":1021,"78":1022,"88":1023,"ap":1024,"uid":1025,"00000":1026,"Ġ23":1027,"Inner":1028,"Ġ3694":1029,"Changed":1030,"pand":1031,"Ġ49":1032,"Ġ100":1033,"itor":1034,"fy":1035,"ifi":1036,"ken":1037,"Ġi":1038,"Ġon":1039,"Ġnoti":1040,"ĠSurface":1041,"2618":1042,"Ġ8671":1043,"Ġ2633":1044,"Ġact":1045,"Ġ2113":1046,":[":1047,"pl":1048,"qt":1049,"},":1050,"Ġnull":1051,"Info":1052,"ĠgetRecent":1053,"Ġ17630":1054,"xxxx":1055,"removeWindowLocked":1056,"removeWindowInner":1057,"Ġintercept":1058,"ĠgetRecentTasks":1059,"removeWindowInnerLocked":1060,"ĠinterceptKey":1061,"Display":1062,"Effect":1063,"Sound":1064,"sta":1065,"tal":1066,"Ġ1737":1067,"ast":1068,"585":1069,"Ġ324":1070,"active":1071,"SoundEffect":1072,"Am":1073,"CK":1074,"Screen":1075,"led":1076,"nd":1077,"ĠĊ":1078,"Ġlock":1079,"Ġ104":1080,"arm":1081,"lease":1082,"Active":1083,"Ġrelease":1084,"quire":1085,"Ġacquire":1086,"Amount":1087,"Ġ10454":1088,"101":1089,"86":1090,"Tag":1091,"name":1092,"ub":1093,"ĠDestroy":1094,"Ġsurface":1095,"Ġ10113":1096,"ĠDestroying":1097,"77":1098,"IN":1099,"Up":1100,"Wifi":1101,"],":1102,"kg":1103,"system":1104,"Ġa":1105,"Ġ236":1106,"Monitor":1107,"ream":1108,"2060":1109,"Ġ313":1110,"Scan":1111,"destroySurfaceLocked":1112,"Keyguard":1113,"ackage":1114,"DisplayScan":1115,"WifiDisplayScan":1116,"systemui":1117,"62":1118,"600":1119,"Call":1120,"call":1121,"gin":1122,"index":1123,"Ġ327":1124,"Ġ720":1125,"ĠsuspendAutohide":1126,"Ġ3137":1127,"68":1128,"TI":1129,"ab":1130,"ef":1131,"flags":1132,"our":1133,"phone":1134,"rt":1135,"ts":1136,"ĠKeyguard":1137,"Ġ14":1138,"Ġ128":1139,"unch":1140,"1702":1141,"Application":1142,"Ġ17632":1143,"UpdateMonitor":1144,"Ġ27357":1145,"Token":1146,"ource":1147,"ĠKeyguardUpdateMonitor":1148,"Pe":1149,"Sto":1150,"ek":1151,"tag":1152,"pped":1153,"ending":1154,"Ġ17621":1155,"Ġ3693":1156,"Peek":1157,"Stopped":1158,"920":1159,"=[":1160,"With":1161,"ible":1162,"pkg":1163,"own":1164,"InCall":1165,"Ġ2618":1166,"ĠcancelPeek":1167,"Expand":1168,"ĠcancelNotificationWith":1169,"abled":1170,"ĠcancelNotificationWithTag":1171,"303":1172,"508":1173,"708":1174,"RI":1175,"ose":1176,"oll":1177,"Ġ55":1178,"ĠSystemUiVisibility":1179,"Enabled":1180,"usic":1181,"UiVisibilityChanged":1182,"ffffffff":1183,"Ġ27353":1184,"Ġ14638":1185,"apse":1186,"Ġ2318":1187,"fyUiVisibilityChanged":1188,"ĠnotifyUiVisibilityChanged":1189,"Ġ1280":1190,"ollapse":1191,"220":1192,"Flags":1193,"Pla":1194,"Source":1195,"he":1196,"larm":1197,"ode":1198,"Ġandroid":1199,"anUp":1200,"Ġcle":1201,"Ġdown":1202,"ueue":1203,"Ġ8303":1204,"188":1205,"ĠAlarm":1206,"NotificationVisibility":1207,"290":1208,"SurfacePla":1209,"Ġ10091":1210,"ApplicationRecord":1211,"anUpApplicationRecord":1212,"ĠcleanUpApplicationRecord":1213,"700":1214,"ACK":1215,"AIN":1216,"Collapse":1217,"LJ":1218,"MAIN":1219,"WL":1220,"Work":1221,"sEnabled":1222,"ySoundEffect":1223,"Ġ58":1224,"Ġqu":1225,"erySoundEffect":1226,"tation":1227,"launch":1228,"264":1229,"2626":1230,"560":1231,"444":1232,"1080":1233,"1001":1234,"RILJ":1235,"WorkSource":1236,"ĠquerySoundEffect":1237,"ĠquerySoundEffectsEnabled":1238,"*\",":1239,"66":1240,"]=":1241,"][":1242,"no":1243,"pad":1244,"ugin":1245,"}}":1246,"Ġchang":1247,"tepad":1248,"Ġbnd":1249,"WindowToken":1250,"555":1251,"Ġremove":1252,"1896":1253,"ample":1254,"67585":1255,"=\"*":1256,"example":1257,"Expanded":1258,"notepad":1259,"Ġbnds":1260,"189667585":1261,"121":1262,"514":1263,"97":1264,"Audio":1265,"Event":1266,"og":1267,"Ġ:":1268,"Ġtrue":1269,"Ġ54":1270,"Ġ50":1271,"Ġst":1272,"try":1273,"ash":1274,"Ġ37":1275,"395":1276,"ult":1277,"Ġ2096":1278,"530":1279,"ĠcancelAutohide":1280,"Ġ17622":1281,"40000600":1282,"//":1283,"2560":1284,"2555":1285,"317":1286,"98":1287,"908":1288,"Bef":1289,"Com":1290,"Pop":1291,"Queue":1292,"Re":1293,"Recent":1294,"St":1295,"Spl":1296,"Tq":1297,"WX":1298,"au":1299,"base":1300,"cts":1301,"code":1302,"out":1303,"pon":1304,"pWindow":1305,"package":1306,"sActivity":1307,"upWindow":1308,"Ġ,":1309,"Ġal":1310,"Ġpolicy":1311,"Ġ57":1312,"Ġ2395":1313,"incall":1314,"tacts":1315,"2702":1316,"2739":1317,"Ġ1736":1318,"Entry":1319,"1554":1320,"ller":1321,"recent":1322,"oreQueue":1323,"Ġde":1324,"Ġdat":1325,"138":1326,"contacts":1327,"Ġnum":1328,"2691":1329,"4000":1330,"layout":1331,"Ġ8290":1332,"stub":1333,"entInfo":1334,"opActivity":1335,"Ġ2838":1336,"ocus":1337,"Ġcanceled":1338,"ĠtopActivity":1339,"removeLocked":1340,"Ġ3697":1341,"000002":1342,"0000700":1343,"10840000":1344,"10800000":1345,"Ġkeyguard":1346,"Ġkeycode":1347,"file":1348,"Ġinteractive":1349,"Ġresult":1350,"total":1351,"Ġ14640":1352,"plugin":1353,"qtl":1354,"ĠinterceptKeyBef":1355,"ĠinterceptKeyTq":1356,"staller":1357,"endingIntent":1358,"InCallActivity":1359,"18800000":1360,"10804000":1361,"ĠremoveNotification":1362,"ashActivity":1363,"Compon":1364,"PopupWindow":1365,"RecentsActivity":1366,"SplashActivity":1367,"WXEntry":1368,"ause":1369,"ĠpolicyFlags":1370,"incallui":1371,"recents":1372,"oreQueueing":1373,"ĠkeyguardActive":1374,"totalTasks":1375,"ĠinterceptKeyBeforeQueueing":1376,"ComponentInfo":1377,"WXEntryActivity":1378,"800":1379,"CH":1380,"La":1381,"Or":1382,"Sh":1383,"Top":1384,"Translation":1385,"YTranslation":1386,"cast":1387,"pTop":1388,"vio":1389,"ĠC":1390,"ĠM":1391,"ĠU":1392,"Ġ46":1393,"Ġactive":1394,"road":1395,"Ġ2250":1396,"():-":1397,"End":1398,"153":1399,"usNotification":1400,"revio":1401,"Ġfro":1402,"ade":1403,"Ġbroad":1404,"Ġ1815":1405,"ĠgetLocation":1406,"111":1407,"365":1408,"ĠnewYTranslation":1409,"484":1410,"NotificationSh":1411,"OnScreen":1412,"ĠupdateNotificationSh":1413,"Ġlocation":1414,"Ġprevio":1415,"ĠoverlapAmount":1416,"Ġtotal":1417,"765":1418,"clipTop":1419,"Ġ2556":1420,"ĠAlarmManager":1421,"Ġchange":1422,"Ġstop":1423,"usNotificationEnd":1424,"Ġbroadcast":1425,"ĠgetLocationOnScreen":1426,"ĠupdateNotificationShade":1427,"ĠpreviousNotificationEnd":1428,"clipTopAmount":1429,"'t":1430,"63":1431,"75":1432,"85":1433,"92":1434,"93":1435,"Child":1436,"Music":1437,"ON":1438,"Qs":1439,"Th":1440,"eed":1441,"lose":1442,"ren":1443,"Ġ4":1444,"Ġus":1445,"Ġlayout":1446,"unIn":1447,"Ġcause":1448,"Ġclose":1449,"Ġinit":1450,"ĠPendingIntent":1451,"read":1452,"Ġfind":1453,"Ġfocus":1454,"Ġstart":1455,"207":1456,"Ġneed":1457,"553":1458,"Visible":1459,"ĠDisplayManagerService":1460,"ĠmExpanded":1461,"ĠrunIn":1462,"497":1463,"598":1464,"482":1465,"LightsLocked":1466,"Ġ2644":1467,"ĠupdateLightsLocked":1468,"Ġlog":1469,"Ġ2839":1470,"ĠisMusic":1471,"ĠThe":1472,"899":1473,"Changes":1474,"Ġ2558":1475,"10111":1476,"Ġ23650":1477,"reamType":1478,"WifiDisplayScanLocked":1479,"WifiDisplayScanRe":1480,"NotificationVisibilityChanges":1481,"ĠcleanUpApplicationRecordLocked":1482,"Stream":1483,"ĠremoveNotificationChild":1484,"ĠCan":1485,"Ġfrom":1486,"ĠstopWifiDisplayScanLocked":1487,"Thread":1488,"Ġcaused":1489,"ĠcloseQs":1490,"ĠmExpandedVisible":1491,"ĠrunInThread":1492,"ĠlogNotificationVisibilityChanges":1493,"ĠisMusicActive":1494,"WifiDisplayScanRequ":1495,"ĠremoveNotificationChildren":1496,"233":1497,"94":1498,"Mi":1499,"OO":1500,"VI":1501,"audio":1502,"for":1503,"Ġ2514":1504,"Ġ09":1505,"anim":1506,"278":1507,"perfor":1508,"Ġ--":1509,"1041":1510,"Ġeuid":1511,"529":1512,"AppWindowToken":1513,"289":1514,"Ġ17633":1515,"26197":1516,"Ġapp":1517,"AudioMi":1518,"audioserver":1519,"perform":1520,"AudioMix":1521,"547":1522,"80":1523,"807":1524,"Count":1525,"CTI":1526,"Play":1527,"Package":1528,"SE":1529,"Sa":1530,"Vol":1531,"bar":1532,"tView":1533,"uch":1534,"Ġh":1535,"ĠĠ":1536,"Ġro":1537,"Ġplay":1538,"Ġanim":1539,"Ġsystem":1540,"notify":1541,"isten":1542,"edAutohide":1543,"Ġ63":1544,"208":1545,"105":1546,"Ġ7111":1547,"pplication":1548,"398":1549,"Ġeffect":1550,"499":1551,"583":1552,"070":1553,"091":1554,"AppStopped":1555,"veSurface":1556,"act":1557,"ĠTex":1558,"ĠtreamType":1559,"uspendedAutohide":1560,"eSuspendedAutohide":1561,"destroyOr":1562,"Ġexpand":1563,"Ġ27365":1564,"Ġ2794":1565,"761":1566,"26198":1567,"Ġresum":1568,"Ġ2555":1569,"activityStopped":1570,"Touch":1571,"ume":1572,"Ġnotification":1573,"2201":1574,"StreamVol":1575,"Player":1576,"SaveSurface":1577,"ĠplaySoundEffect":1578,"notifyAppStopped":1579,"ĠeffectType":1580,"ĠTextView":1581,"destroyOrSaveSurface":1582,"ĠresumeSuspendedAutohide":1583,"StreamVolume":1584,"352":1585,"517":1586,"769":1587,"Aud":1588,"Ce":1589,"De":1590,"Last":1591,"TE":1592,"cer":1593,"ment":1594,"vice":1595,"Ġg":1596,"Ġ38":1597,"008":1598,"info":1599,"cement":1600,"00508":1601,"ested":1602,"Ġinsta":1603,"ntCollapse":1604,"andle":1605,"010":1606,"011":1607,"WindowSurfacePla":1608,"ĠActivityRecord":1609,"ĠgetLast":1610,"498":1611,"599":1612,"Ġcalling":1613,"Ġ2107":1614,"Ġ2808":1615,"Ġaction":1616,"ibleStreamVolume":1617,"SurfacePlacement":1618,"80000508":1619,"performSurfacePlacement":1620,"AudibleStreamVolume":1621,"Cell":1622,"ĠinstantCollapse":1623,"WindowSurfacePlacer":1624,"ĠgetLastAudibleStreamVolume":1625,"057":1626,"1207":1627,"409":1628,"502":1629,"518":1630,"64":1631,"746":1632,"84":1633,"EW":1634,"Panel":1635,"TY":1636,"ion":1637,"ton":1638,"ved":1639,"yer":1640,"zone":1641,"Ġ<":1642,"Ġ48":1643,"Ġ208":1644,"Ġse":1645,"cei":1646,"0057":1647,"150":1648,"154":1649,"Ġ64":1650,"Ġ66":1651,"utton":1652,"Ġbe":1653,"ateCollapse":1654,"469":1655,"layed":1656,"Ġ868":1657,"Ġ8289":1658,"106":1659,"550":1660,"58482":1661,"224":1662,"291":1663,"694":1664,"Ġ2809":1665,"Ġ323":1666,"670":1667,"Note":1668,"Ġforce":1669,"790":1670,"calling":1671,"Ġ3714":1672,"Ġalarm":1673,"Ġdelayed":1674,"Layer":1675,"ĠanimateCollapse":1676,"CellInfo":1677,"120758482":1678,"Panels":1679,"Ġ8682":1680,"ĠanimateCollapsePanels":1681,"202":1682,"237":1683,"241":1684,"318":1685,"307":1686,"546":1687,"507":1688,"://":1689,"Cho":1690,"He":1691,"QQ":1692,"SU":1693,"Sub":1694,"Ten":1695,"av":1696,"application":1697,"bus":1698,"chi":1699,"em":1700,"gis":1701,"hed":1702,"ien":1703,"me":1704,"music":1705,"rec":1706,"sh":1707,"set":1708,"ula":1709,"vnd":1710,"yp":1711,"Ġ56":1712,"Ġ53":1713,"Ġend":1714,"Ġ156":1715,"001":1716,"003":1717,"iness":1718,"installer":1719,"orage":1720,"time":1721,"tart":1722,"tel":1723,"archi":1724,"270":1725,"Ġ603":1726,"essage":1727,"204":1728,"161":1729,"4000000":1730,"476":1731,"460":1732,"Ġ308":1733,"107":1734,"Installer":1735,"045":1736,"066":1737,"080":1738,"08000":1739,"392":1740,"storage":1741,"lockscreen":1742,"564":1743,"589":1744,"Ġ2643":1745,"190":1746,"atter":1747,"577":1748,"299":1749,"Ġwh":1750,"Ġ3258":1751,"Ġtype":1752,"Ġtyp":1753,"LockScreen":1754,"qqmusic":1755,"xxx":1756,"10808000":1757,"Ġrestart":1758,"872":1759,"992":1760,"994":1761,"apk":1762,"Ġ10027":1763,"xxxxxxxx":1764,"774":1765,"Ġ23689":1766,"oseSub":1767,"packageinstaller":1768,"CHOO":1769,"ĠbroadcastIntent":1770,"ĠPendingIntentRecord":1771,"VIEW":1772,"PackageInstaller":1773,"ceived":1774,"Ġbegin":1775,":///":1776,"ChooseSub":1777,"QQfile":1778,"SUB":1779,"Tencent":1780,"business":1781,"emula":1782,"gister":1783,"ientation":1784,"recv":1785,"archive":1786,"attery":1787,"LockScreenActivity":1788,"xxxxxxxxxxx":1789,"CHOOSE":1790,"PackageInstallerActivity":1791,"ChooseSubActivity":1792,"emulated":1793,"**":1794,"046":1795,"10057":1796,"250":1797,"338":1798,"346":1799,"311":1800,"459":1801,"527":1802,"516":1803,"539":1804,"61":1805,"603":1806,"609":1807,"83":1808,"820":1809,"811":1810,"90":1811,"932":1812,"ACTI":1813,"Battery":1814,"Ed":1815,"ME":1816,"Message":1817,"Pid":1818,"Sess":1819,"ak":1820,"back":1821,"iz":1822,"lu":1823,"mScreen":1824,"mInCall":1825,"mWifiDisplayScanRequ":1826,"os":1827,"qzone":1828,"ting":1829,"tur":1830,"xc":1831,"Ġ>":1832,"Ġx":1833,"Ġy":1834,"Ġid":1835,"Ġqui":1836,"erts":1837,"006":1838,"030":1839,"Ġclock":1840,"arch":1841,"isable":1842,"Ġoff":1843,"Ġover":1844,"Ġdisable":1845,"136":1846,"ome":1847,"162":1848,"164":1849,"igation":1850,"Ġnav":1851,"261":1852,"Ġback":1853,"475":1854,"Ġ367":1855,"Ġ==":1856,"Ġrecent":1857,"ĠmWifiDisplayScanRequ":1858,"061":1859,"065":1860,"Ġrecord":1861,"182":1862,"183":1863,"084":1864,"visible":1865,"590":1866,"595":1867,"568":1868,"569":1869,"077":1870,"542":1871,"528":1872,"Ġ2642":1873,"198":1874,"374":1875,"228":1876,"294":1877,"295":1878,"297":1879,"441":1880,"691":1881,"Ġ3255":1882,"estCount":1883,"Ġ502":1884,"Ġtoken":1885,"destroySurfaces":1886,"ĠcancelNotificationLocked":1887,"Ġreset":1888,"995":1889,"783":1890,"Ġ23469":1891,"ĠonNotificationVisibility":1892,"26187":1893,"ledNotification":1894,"TICK":1895,"}}},":1896,"Ġalerts":1897,"ĠUI":1898,"Ġhome":1899,"Ġrotation":1900,"istener":1901,"TouchEvent":1902,"ĠnotificationLight":1903,"Ġsearch":1904,"NoteEd":1905,"callingPid":1906,"setting":1907,"Ġ30852":1908,"Session":1909,"ize":1910,"mScreenOn":1911,"mWifiDisplayScanRequested":1912,"turn":1913,"Ġquick":1914,"igationbar":1915,"Ġnavigationbar":1916,"ĠmWifiDisplayScanRequestCount":1917,"ĠonNotificationVisibilityChanged":1918,"NoteEditor":1919,"settings":1920,"056":1921,"102":1922,"213":1923,"249":1924,"248":1925,"240":1926,"306":1927,"357":1928,"305":1929,"432":1930,"450":1931,"429":1932,"405":1933,"608":1934,"659":1935,"635":1936,"70":1937,"707":1938,"709":1939,"818":1940,"819":1941,"850":1942,"80000":1943,"95":1944,"926":1945,"937":1946,"942":1947,"For":1948,"Ne":1949,"New":1950,"Spe":1951,"Trans":1952,"UI":1953,"Wir":1954,"Xml":1955,"bor":1956,"blity":1957,"ge":1958,"hon":1959,"handle":1960,"hbor":1961,"il":1962,"ick":1963,"listener":1964,"phon":1965,"sDe":1966,"yManager":1967,"Ġor":1968,"erUI":1969,"Ġ133":1970,"Ġ139":1971,"002":1972,"Ġ218":1973,"tick":1974,"Ġsending":1975,"tail":1976,"170":1977,"178":1978,"038":1979,"277":1980,"028":1981,"repe":1982,"erval":1983,"ingCellInfo":1984,"139":1985,"1346":1986,"1393":1987,"382":1988,"386":1989,"146":1990,"148":1991,"149":1992,"209":1993,"166":1994,"ighbor":1995,"ActivityStack":1996,"ActivityManagerService":1997,"262":1998,"Value":1999,"479":2000,"getValue":2001,"466":2002,"Ġ366":2003,"339":2004,"ppWindowToken":2005,"Visiblity":2006,"04807":2007,"ĠgetNe":2008,"ĠmVisiblity":2009,"062":2010,"064":2011,"189":2012,"119":2013,"ĠAppWindowToken":2014,"368":2015,"Ġ1309":2016,"485":2017,"4869":2018,"Ġvisible":2019,"587":2020,"076":2021,"079":2022,"525":2023,"atInt":2024,"atch":2025,"ĠWifi":2026,"296":2027,"443":2028,"ams":2029,"amap":2030,"698":2031,"ĠgetRing":2032,"Ġ3259":2033,"Ġ3257":2034,"ĠTele":2035,"242":2036,"0000008":2037,"Ġ503":2038,"2619913":2039,"40000000":2040,"781":2041,"Ġ23685":2042,"uncherUI":2043,"974":2044,"LauncherUI":2045,"80583":2046,"activityStoppedLocked":2047,"7690":2048,"viceId":2049,"Ġ3807":2050,"Head":2051,"40000008":2052,"Ġwhen":2053,"80000608":2054,"NewsDe":2055,"Transact":2056,"Wired":2057,"XmlActivity":2058,"listenerTag":2059,"phonyManager":2060,"tailXmlActivity":2061,"repeatInt":2062,"134680583":2063,"ighboringCellInfo":2064,"Ġ3664":2065,"ĠgetNeighboringCellInfo":2066,"ĠTelephonyManager":2067,"NewsDetailXmlActivity":2068,"repeatInterval":2069,")],":2070,"115":2071,"122":2072,"216":2073,"300":2074,"354":2075,"414":2076,"410":2077,"436":2078,"458":2079,"451":2080,"419":2081,"428":2082,"538":2083,"65":2084,"614":2085,"619":2086,"669":2087,"640":2088,"719":2089,"757":2090,"743":2091,"735":2092,"846":2093,"839":2094,"859":2095,"853":2096,"896":2097,"879":2098,"938":2099,"916":2100,"955":2101,"939":2102,"936":2103,"944":2104,"931":2105,"967":2106,"979":2107,"AN":2108,"AT":2109,"Anim":2110,"Button":2111,"BAT":2112,"Da":2113,"FIN":2114,"Mode":2115,"PE":2116,"RO":2117,"RT":2118,"RY":2119,"Ro":2120,"Runn":2121,"Size":2122,"TOO":2123,"ax":2124,"aPlayer":2125,"eo":2126,"eta":2127,"iaPlayer":2128,"locked":2129,"mis":2130,"nal":2131,"oin":2132,"oing":2133,"queue":2134,"sUp":2135,"th":2136,"vid":2137,"xy":2138,"Ġhi":2139,"Ġen":2140,"Ġed":2141,"Ġper":2142,"Ġhas":2143,"Ġhide":2144,"Ġhe":2145,"Ġ122":2146,"Ġ1208":2147,"004":2148,"Ġ227":2149,"inLayer":2150,"onEvent":2151,"onTransact":2152,"Ġsource":2153,"ceChanged":2154,"ecu":2155,"tach":2156,"171":2157,"173":2158,"175":2159,"031":2160,"039":2161,"Ġcro":2162,"otionEvent":2163,"Ġinfo":2164,"ĠinRo":2165,"022":2166,"025":2167,"ediaPlayer":2168,"Ġscreen":2169,"Ġsched":2170,"Ġdisplay":2171,"idth":2172,"Ġ60":2173,"Ġ604":2174,"387":2175,"388":2176,"389":2177,"141":2178,"143":2179,"144":2180,"147":2181,"201":2182,"tusbar":2183,"Ġbutton":2184,"Ġblocked":2185,"471":2186,"018":2187,"467":2188,"104":2189,"332":2190,"552":2191,"554":2192,"player":2193,"Invisible":2194,"ĠActivityManagerService":2195,"ĠActivityInfo":2196,"049":2197,"Ġreceived":2198,"Ġregister":2199,"Ġmanager":2200,"ĠmBlock":2201,"Ġmake":2202,"ĠmHead":2203,"Ġmax":2204,"Ġmeta":2205,"ĠminLayer":2206,"180":2207,"185":2208,"187":2209,"olType":2210,"story":2211,"uling":2212,"ĠACTI":2213,"360":2214,"366":2215,"483":2216,"488":2217,"489":2218,"NotificationInter":2219,"566":2220,"586":2221,"071":2222,"524":2223,"192":2224,"196":2225,"375":2226,"379":2227,"attach":2228,"571":2229,"223":2230,"225":2231,"Ġ19609":2232,"Ġwidth":2233,"435":2234,"696":2235,"090":2236,"099":2237,"GED":2238,"GER":2239,"TART":2240,"281":2241,"Ġpkg":2242,"Ġpoin":2243,"ĠTak":2244,"Excep":2245,"Existen":2246,"Intercept":2247,"Proxy":2248,"235":2249,"ĠSTART":2250,"sion":2251,"Ġ},":2252,"terCount":2253,"Ġ3267":2254,"ĠtoolType":2255,"763":2256,"766":2257,"791":2258,"794":2259,"1002":2260,"882":2261,"Ġ23484":2262,"Ġ10020":2263,"ĠonNotification":2264,"ĠonExpand":2265,"ĠonIntercept":2266,"2618516":2267,"statusbar":2268,"10113":2269,"10112":2270,"866":2271,"ĠdownTime":2272,"}}}":2273,"ExpandedInvisible":2274,"ĠdeviceId":2275,"CHAN":2276,"ĠMotionEvent":2277,"ĠMediaPlayer":2278,"2332":2279,"VITY":2280,"Ġhandle":2281,"Ġrot":2282,"Touches":2283,"PlayerActivity":2284,"Device":2285,"TERY":2286,"Ġgoing":2287,"Ġ3848":2288,"ĠactionButton":2289,"4097":2290,"TYPE":2291,"shot":2292,"ACTION":2293,"lug":2294,"geFlags":2295,"Ġorientation":2296,"Ġ13094":2297,"261991304":2298,"Animation":2299,"BATTERY":2300,"Data":2301,"FINGER":2302,"Runnable":2303,"TOOL":2304,"mission":2305,"queueNotificationInter":2306,"sUpExisten":2307,"video":2308,"Ġhistory":2309,"ĠenqueueNotificationInter":2310,"ĠedgeFlags":2311,"Ġpermission":2312,"Ġheight":2313,"Ġ12236":2314,"Ġ22775":2315,"ceChangedRunnable":2316,"Ġcrop":2317,"ĠinRotation":2318,"Ġscreenshot":2319,"Ġschedule":2320,"ĠbuttonState":2321,"ĠmBlockTouches":2322,"ĠmakeExpandedInvisible":2323,"ĠmHeadsUpExisten":2324,"ĠmaxLayer":2325,"ĠmetaState":2326,"attachApplication":2327,"ĠpointerCount":2328,"ĠTaking":2329,"Exception":2330,"ĠonExpanding":2331,"ĠonInterceptTouchEvent":2332,"261851646":2333,"CHANGED":2334,"ĠhistorySize":2335,"ĠenqueueNotificationInternal":2336,"ĠmHeadsUpExistenceChangedRunnable":2337,");":2338,"047":2339,"050":2340,"126":2341,"215":2342,"246":2343,"211":2344,"259":2345,"236":2346,"232":2347,"244":2348,"245":2349,"2108":2350,"21080":2351,"327":2352,"304":2353,"359":2354,"319":2355,"321":2356,"312":2357,"341":2358,"345":2359,"403":2360,"402":2361,"408":2362,"425":2363,"549":2364,"536":2365,"602":2366,"616":2367,"652":2368,"622":2369,"641":2370,"625":2371,"630":2372,"689":2373,"687":2374,"718":2375,"736":2376,"756":2377,"729":2378,"745":2379,"778":2380,"81":2381,"82":2382,"802":2383,"816":2384,"808":2385,"856":2386,"821":2387,"809":2388,"840":2389,"830":2390,"834":2391,"8670":2392,"903":2393,"927":2394,"950":2395,"940":2396,"945":2397,"928":2398,"988":2399,"At":2400,"All":2401,"And":2402,"Bind":2403,"CON":2404,"Def":2405,"ED":2406,"FO":2407,"Hand":2408,"IME":2409,"LA":2410,"LO":2411,"Lo":2412,"Lw":2413,"Met":2414,"Run":2415,"STE":2416,"Tick":2417,"YSTE":2418,"af":2419,"ati":2420,"dis":2421,"eceived":2422,"ger":2423,"ging":2424,"gory":2425,"har":2426,"ient":2427,"ler":2428,"ms":2429,"ntent":2430,"patch":2431,"pati":2432,"ric":2433,"rted":2434,"sLocked":2435,"uti":2436,"Ġ.":2437,"ĠE":2438,"Ġun":2439,"Ġ**":2440,"erMode":2441,"Ġ127":2442,"Ġ147":2443,"007":2444,"inis":2445,"orient":2446,"Ġservice":2447,"172":2448,"17499":2449,"032":2450,"Ġcon":2451,"272":2452,"Start":2453,"Started":2454,"hich":2455,"026":2456,"etric":2457,"erred":2458,"155":2459,"Ġof":2460,"eduling":2461,"ush":2462,"ust":2463,"ĠICON":2464,"ĠIntent":2465,"register":2466,"ingDisplay":2467,"Ġ61":2468,"130":2469,"cons":2470,"140":2471,"205":2472,"165":2473,"igger":2474,"Ġnon":2475,"266":2476,"ategory":2477,"roidRun":2478,"462":2479,"465":2480,"Ġ368":2481,"Ġ3066":2482,"336":2483,"Input":2484,"043":2485,"ĠgetAll":2486,"Ġrequ":2487,"Powered":2488,"Ġmetric":2489,"069":2490,"181":2491,"186":2492,"087":2493,"Ġcompati":2494,"396":2495,"399":2496,"496":2497,"593":2498,"594":2499,"597":2500,"ĠApplication":2501,"361":2502,"364":2503,"367":2504,"480":2505,"481":2506,"487":2507,"hod":2508,"561":2509,"565":2510,"582":2511,"541":2512,"512":2513,"521":2514,"191":2515,"573":2516,"578":2517,"Ġcallback":2518,"531":2519,"535":2520,"324":2521,"325":2522,"328":2523,"505":2524,"509":2525,"ĠReceived":2526,"Ġ2106":2527,"Ġlast":2528,"442":2529,"Ġwhich":2530,"434":2531,"693":2532,"124":2533,"TATI":2534,"vel":2535,"280":2536,"282":2537,"ĠTIME":2538,"675":2539,"676":2540,"678":2541,"TimeUpdate":2542,"TimeTick":2543,"ĠSYSTE":2544,"342":2545,"Ġtrigger":2546,"Ġexecu":2547,"cheduling":2548,"764":2549,"768":2550,"963":2551,"9600":2552,"792":2553,"793":2554,"797":2555,"Ġ12025":2556,"897":2557,"898":2558,"Ġrescheduling":2559,"871":2560,"873":2561,"40000208":2562,"993":2563,"Ġ2121":2564,"784":2565,"883":2566,"888":2567,"Ġicons":2568,"CKED":2569,"770":2570,"772":2571,"INFO":2572,"Callback":2573,"TIME":2574,"661":2575,"Ġchanged":2576,"971":2577,"973":2578,"Ġ50926":2579,"Ġ5769":2580,"Ġ5784":2581,"Orientation":2582,"ĠMust":2583,"ĠUn":2584,"ĠUSE":2585,"9231":2586,"Ġgot":2587,"ĠcallingPackage":2588,"performSurfacePlacementInner":2589,"performSurfacePlacementLo":2590,"show":2591,"timeException":2592,"BatteryL":2593,"ĠrotationFor":2594,"Speed":2595,"handleMessage":2596,"ĠWifiController":2597,"ĠgetRingerMode":2598,"ROTATI":2599,"ĠregisterCallback":2600,"ĠhandleTimeUpdate":2601,"ĠscheduleTimeTick":2602,"21085":2603,"AtTime":2604,"AndroidRun":2605,"Binder":2606,"Deferred":2607,"Handler":2608,"LOCKED":2609,"Method":2610,"dispatch":2611,"harging":2612,"util":2613,"Ġunregister":2614,"Ġ***":2615,"1749923":2616,"ĠICONS":2617,"InputMethod":2618,"ĠgetAllCellInfo":2619,"Ġrequested":2620,"Ġmetrics":2621,"Ġcompatible":2622,"ĠSYSTEM":2623,"ĠtriggerAtTime":2624,"Ġexecute":2625,"OrientationLw":2626,"ĠUSER":2627,"performSurfacePlacementLoop":2628,"ĠrotationForOrientationLw":2629,"ROTATION":2630,"ĠscheduleTimeTickEvent":2631,"AndroidRuntimeException":2632,"dispatchMessage":2633,")}":2634,"016":2635,"055":2636,"059":2637,"054":2638,"103":2639,"127":2640,"113":2641,"129":2642,"214":2643,"210":2644,"254":2645,"252":2646,"253":2647,"24000000":2648,"2198":2649,"313":2650,"320":2651,"326":2652,"310":2653,"308":2654,"349":2655,"351":2656,"340":2657,"417":2658,"427":2659,"413":2660,"426":2661,"418":2662,"439":2663,"449":2664,"448":2665,"452":2666,"503":2667,"520":2668,"526":2669,"533":2670,"506":2671,"537":2672,"627":2673,"613":2674,"638":2675,"626":2676,"633":2677,"655":2678,"606":2679,"649":2680,"654":2681,"653":2682,"612":2683,"631":2684,"667":2685,"642":2686,"660":2687,"688":2688,"71":2689,"72":2690,"74":2691,"717":2692,"713":2693,"738":2694,"747":2695,"701":2696,"733":2697,"751":2698,"721":2699,"744":2700,"712":2701,"734":2702,"724":2703,"779":2704,"815":2705,"814":2706,"847":2707,"810":2708,"806":2709,"858":2710,"832":2711,"844":2712,"843":2713,"869":2714,"828":2715,"831":2716,"889":2717,"887":2718,"900":2719,"902":2720,"914":2721,"957":2722,"921":2723,"943":2724,"969":2725,"912":2726,"941":2727,"989":2728,"978":2729,"986":2730,"::":2731,"Ac":2732,"ATE":2733,"Bec":2734,"Blu":2735,"DO":2736,"Destroy":2737,"EN":2738,"ER":2739,"Fal":2740,"Fre":2741,"Focus":2742,"Fact":2743,"Finis":2744,"Is":2745,"IWindow":2746,"Mgr":2747,"NCH":2748,"Of":2749,"Op":2750,"Pl":2751,"Phone":2752,"PRI":2753,"PendingIntent":2754,"Plug":2755,"Qzone":2756,"Sim":2757,"Tr":2758,"UP":2759,"Uid":2760,"UNCH":2761,"VATE":2762,"WN":2763,"We":2764,"]}":2765,"ain":2766,"br":2767,"batch":2768,"bPl":2769,"co":2770,"cancel":2771,"chang":2772,"count":2773,"category":2774,"df":2775,"dNotification":2776,"ez":2777,"fMgr":2778,"ged":2779,"hec":2780,"hBattery":2781,"ibr":2782,"kn":2783,"king":2784,"ly":2785,"ling":2786,"log":2787,"nec":2788,"oot":2789,"oper":2790,"pr":2791,"pans":2792,"push":2793,"res":2794,"sing":2795,"sFor":2796,"tt":2797,"ty":2798,"tec":2799,"tone":2800,"tpush":2801,"view":2802,"vibr":2803,"Ġas":2804,"Ġad":2805,"ĠLock":2806,"Ġtick":2807,"ĠStart":2808,"Ġvel":2809,"Ġvibr":2810,"erphone":2811,"Ġ1000":2812,"Ġ141":2813,"Ġ10057":2814,"009":2815,"Ġ24":2816,"Ġ216":2817,"Ġ211":2818,"Ġ258":2819,"Ġ207":2820,"Ġ257":2821,"Ġ2153":2822,"Ġ01":2823,"ĠDe":2824,"Ġsound":2825,"Ġsub":2826,"Ġsize":2827,"179":2828,"17346":2829,"036":2830,"Ġcol":2831,"Ġcat":2832,"Ġcollapse":2833,"Ġchec":2834,"tell":2835,"arking":2836,"rocess":2837,"271":2838,"275":2839,"279":2840,"020":2841,"02333":2842,"etoot":2843,"bott":2844,"mote":2845,"ĠProcess":2846,"151":2847,"158":2848,"1556":2849,"1522":2850,"15564":2851,"reas":2852,"relayout":2853,"remote":2854,"protec":2855,"Ġfling":2856,"132":2857,"135":2858,"380":2859,"385":2860,"142":2861,"1499":2862,"Ġstack":2863,"206":2864,"tionState":2865,"tionsLocked":2866,"163":2867,"168":2868,"169":2869,"260":2870,"265":2871,"Ġbounds":2872,"470":2873,"472":2874,"ĠsetSpe":2875,"ĠsetWired":2876,"019":2877,"ationType":2878,"getKey":2879,"WindowAnimator":2880,"464":2881,"468":2882,"330":2883,"334":2884,"3310":2885,"551":2886,"557":2887,"042":2888,"0404":2889,"0489":2890,"ĠgetDevice":2891,"ĠgetData":2892,"Connec":2893,"Ġrebatch":2894,"060":2895,"063":2896,"184":2897,"085":2898,"089":2899,"391":2900,"397":2901,"Ġemp":2902,"596":2903,"faul":2904,"362":2905,"Ġ13003":2906,"486":2907,"NotificationLocked":2908,"562":2909,"563":2910,"075":2911,"078":2912,"0798":2913,"540":2914,"5244":2915,"193":2916,"195":2917,"197":2918,"19106":2919,"tentView":2920,"370":2921,"371":2922,"372":2923,"572":2924,"579":2925,"570404":2926,"21000":2927,"322":2928,"ĠRef":2929,"222":2930,"2227":2931,"293":2932,"298":2933,"29192":2934,"440":2935,"445":2936,"695":2937,"123":2938,"093":2939,"095":2940,"096":2941,"Ġ10112":2942,"284":2943,"285":2944,"287":2945,"28601":2946,"Ġplug":2947,"ĠisBatteryL":2948,"ĠisBlu":2949,"Ġ3247":2950,"Ġ1765":2951,"Ġthe":2952,"Expans":2953,"IntfMgr":2954,"cessory":2955,"PadActivity":2956,"ĠSending":2957,"Click":2958,"000000":2959,"00000000":2960,"Ġ549":2961,"762":2962,"964":2963,"261986":2964,"2619507":2965,"795":2966,"799":2967,"Ġ12278":2968,"894":2969,"895":2970,"Ġresid":2971,"874":2972,"875":2973,"877":2974,"878":2975,"40000108":2976,"acking":2977,"Ġ6733":2978,"Ġ6751":2979,"Ġ6750":2980,"Ġ6741":2981,"Ġ6740":2982,"Ġ6725":2983,"ToHe":2984,"10020":2985,"10037":2986,"785":2987,"786":2988,"884":2989,"885":2990,"ĠonTouchEvent":2991,"ĠonTr":2992,"2618499":2993,"1011":2994,"861":2995,"863":2996,"861522":2997,"771":2998,"UpFact":2999,"KeyguardMonitor":3000,"uginProxy":3001,"}})":3002,"121161":3003,"AudioEvent":3004,"AudioFocus":3005,"Ġ5092":3006,"ĠstreamType":3007,"980":3008,"Stub":3009,"Ġdefaul":3010,"auseOf":3011,"ĠMarking":3012,"6309":3013,"ĠstartAnimation":3014,"233570404":3015,"261972":3016,"2619733":3017,"2619732":3018,"Ġapply":3019,"performDeferred":3020,"ĠanimationType":3021,"091223":3022,"ĠexpandBec":3023,"2619887":3024,"Ġgt":3025,"ionChanged":3026,"Ġseen":3027,"NotePadActivity":3028,"callingUid":3029,"237091223":3030,"Ġwhat":3031,"603735":3032,"ACTIVITY":3033,"akerphone":3034,"10200000":3035,"handleAudioEvent":3036,"166121161":3037,"ĠWifiService":3038,"ĠgetRingtone":3039,"WiredAc":3040,"ĠACTION":3041,"ĠACTIVITY":3042,"ĠonNotificationExpans":3043,"ĠonNotificationClick":3044,"DeviceConnec":3045,"ĠonExpandingStarted":3046,"ĠonExpandingFinis":3047,"LAUNCH":3048,"ĠcontentView":3049,"Ġ509262332":3050,"ĠUnkn":3051,"SpeedUpFact":3052,"BinderProxy":3053,"219829192":3054,"77903":3055,"DOWN":3056,"Falsing":3057,"Freez":3058,"IsPowered":3059,"IWindowSession":3060,"OptionsLocked":3061,"PhoneIntfMgr":3062,"PRIVATE":3063,"PlugType":3064,"QzoneWe":3065,"bPluginProxy":3066,"cooper":3067,"cancelNotificationLocked":3068,"change":3069,"gedType":3070,"hBatteryInfo":3071,"logic":3072,"pri":3073,"reshBatteryInfo":3074,"sForStream":3075,"ĠaddNotification":3076,"Ġvibrate":3077,"ĠsubId":3078,"173466309":3079,"Ġcolor":3080,"ĠcollapseSpeedUpFact":3081,"Ġcheck":3082,"etooth":3083,"bottom":3084,"155652":3085,"155645244":3086,"reason":3087,"protected":3088,"ĠflingToHe":3089,"149977903":3090,"ĠsetSpeakerphone":3091,"ĠsetWiredDeviceConnec":3092,"04890":3093,"ĠgetDevicesForStream":3094,"ĠgetDataEnabled":3095,"Ġrebatching":3096,"Ġempty":3097,"191063310":3098,"ĠRefreshBatteryInfo":3099,"ĠpluggedType":3100,"ĠisBatteryLow":3101,"ĠisBluetooth":3102,"cessoryManager":3103,"ĠonTracking":3104,"86152250":3105,"Ġ509202333":3106,"Ġdefaults":3107,"auseOfFalsing":3108,"ĠapplyOptionsLocked":3109,"performDeferredDestroy":3110,"ĠexpandBecauseOfFalsing":3111,"60373518":3112,"ĠgetRingtonePlayer":3113,"WiredAccessoryManager":3114,"ĠonNotificationExpansionChanged":3115,"ĠonExpandingFinished":3116,"LAUNCHER":3117,"ĠUnknown":3118,"FreezingDisplay":3119,"QzoneWebPluginProxy":3120,"cooperation":3121,"ĠcollapseSpeedUpFactor":3122,"ĠflingToHeight":3123,"ĠsetSpeakerphoneOn":3124,"ĠsetWiredDeviceConnectionState":3125,"QzoneWebPluginProxyService":3126}