{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"er":261,"Ġ1":262,"00":263,"Ġ2":264,"in":265,"Ġ0":266,"or":267,"čĊ":268,"ti":269,"on":270,"ĠD":271,"Ġs":272,"it":273,"ce":274,"ec":275,"un":276,"005":277,"ta":278,"17":279,"Ġ16":280,"03":281,"an":282,"Ġc":283,"Ġ[":284,"Ġ2005":285,"ĠDec":286,"ck":287,"te":288,"ar":289,"ld":290,"ro":291,"al":292,"27":293,"ork":294,"work":295,"worker":296,"oti":297,"es":298,"Sta":299,"Ġ22":300,"Ġ2227":301,"Ġin":302,"hi":303,"Ġ17":304,"02":305,"noti":306,"()":307,"init":308,"hild":309,"notice":310,"jk":311,"Ġchild":312,"et":313,"ag":314,"is":315,"oun":316,"ound":317,"bo":318,"Ġ04":319,"ot":320,"Ġ1702":321,"En":322,"en":323,"anag":324,"anager":325,"Manager":326,"err":327,"error":328,"mo":329,"Ġworker":330,"Env":331,"ĠworkerEnv":332,"ow":333,"ht":334,"Sun":335,"ĠP":336,"Ġ05":337,"15":338,"se":339,"Ġo":340,"ed":341,"Mon":342,"Stack":343,"us":344,"mod":345,"ll":346,"ĠI":347,"fal":348,"false":349,"ock":350,"re":351,"ard":352,"ore":353,"Ġsc":354,"Ġjk":355,"board":356,"oreboard":357,"Ġscoreboard":358,"Found":359,"lot":360,"ĠFound":361,"Ġslot":362,"pd":363,"Ġd":364,"tr":365,"erv":366,"pro":367,"id":368,"ity":369,"ing":370,"ower":371,"Ġ6":372,"ue":373,"Ġf":374,"13":375,"Vis":376,"tiv":377,"ess":378,"as":379,"le":380,"true":381,"om":382,"38":383,"ocked":384,"one":385,"hone":386,"ctiv":387,"la":388,"Ġ/":389,"ut":390,"ĠPhone":391,"con":392,"per":393,"ice":394,"14":395,"tpd":396,"ties":397,"Ġsta":398,"workers":399,"etc":400,"httpd":401,"Ġok":402,"proper":403,"conf":404,"properties":405,"ervice":406,"Service":407,"ManagerService":408,"Ġstate":409,"Ġmod":410,"Activ":411,"ad":412,"Ġerror":413,"20":414,"tion":415,"tus":416,"Bar":417,"Status":418,"ĠPhoneStatus":419,"ĠPhoneStatusBar":420,"ic":421,"mm":422,"16":423,"ull":424,"ig":425,"ect":426,"nt":427,"ight":428,"Activity":429,"ness":430,"Ġn":431,"26":432,"owerManagerService":433,"400":434,"reen":435,"Ġb":436,"creen":437,"Ġ-":438,"ate":439,"roll":440,"and":441,"screen":442,"Val":443,"Rect":444,"ounds":445,"Bounds":446,"StackVis":447,"StackBounds":448,"Ġdocked":449,"Ġfull":450,"Ġfullscreen":451,"wa":452,"umm":453,"ind":454,"ary":455,"mode":456,"ummary":457,"47":458,"ĠPowerManagerService":459,"Ġset":460,"01":461,"com":462,"00500":463,"40000500":464,"ff":465,"roid":466,"android":467,"ation":468,"Wind":469,"get":470,"Window":471,"im":472,"Ġ18":473,"46":474,"Ġ3":475,"Ġ06":476,"lay":477,"Ġ8":478,"10":479,"Ġ7":480,"33":481,"bi":482,"55":483,"ke":484,"play":485,"pp":486,"Ġ=":487,"isplay":488,"ew":489,"Ġu":490,"ask":491,"In":492,"Visi":493,"user":494,"ĠActivity":495,"04":496,"ĠDisplay":497,"Ġget":498,"Con":499,"lity":500,"Ġre":501,"troll":502,"Controll":503,"Controller":504,"Power":505,"ĠV":506,"Ġm":507,"06":508,"Ġ1820":509,"bility":510,"Visibility":511,"right":512,"Ġbright":513,"ĠDisplayPower":514,"Ġbrightness":515,"ĠDisplayPowerController":516,"ste":517,"yste":518,"Ġ07":519,"pdate":520,"ĠActivityManager":521,"ystem":522,"=-":523,"Ġr":524,"lg":525,"ication":526,"18":527,"uto":528,"ble":529,"08":530,"ith":531,"Ui":532,"UiVisibility":533,"Ġ10":534,"ol":535,"vis":536,"Ġcom":537,"39":538,"Ġe":539,"49":540,"st":541,"11":542,"59":543,"Locked":544,"fa":545,"ul":546,"ted":547,"System":548,"SystemUiVisibility":549,"fication":550,"all":551,"face":552,"ple":553,"ĠA":554,"pol":555,"ent":556,"icy":557,"policy":558,"36":559,"Ġnew":560,"Ġ13":561,"able":562,"48":563,"lock":564,"Noti":565,"Notification":566,"Id":567,"Ġvis":568,"On":569,"serv":570,"server":571,"ho":572,"56":573,"58":574,"gr":575,"Ġold":576,"Ġdi":577,"),":578,"adj":579,"ĠdockedStackVis":580,"ĠdockedStackBounds":581,"ĠfullscreenStackVis":582,"ĠfullscreenStackBounds":583,"wake":584,"ĠsetSystemUiVisibility":585,"Ġmask":586,"ĠnewVal":587,"ĠoldVal":588,"Ġdiff":589,"Light":590,"auto":591,"ful":592,"ks":593,"man":594,"ost":595,"ual":596,"uas":597,"wks":598,"inpro":599,"itmode":600,"boot":601,"boost":602,"enable":603,"ady":604,"waitmode":605,"comple":606,"userId":607,"Ġready":608,"gress":609,"wakeful":610,"manual":611,"uasummary":612,"wksummary":613,"inprogress":614,"bootcomple":615,"boostinprogress":616,"waitmodeenable":617,"wakefulness":618,"bootcompleted":619,"Lights":620,"07":621,"54":622,"51":623,"52":624,"Ġ26":625,"cent":626,"19":627,"Sc":628,"wm":629,"tent":630,"Ġ9":631,"ĠsetLights":632,"ĠsetLightsOn":633,"37":634,"at":635,"Ġ20":636,"ĠW":637,"57":638,"Ġcall":639,"BM":640,"HBM":641,"ĠHBM":642,"ur":643,"ud":644,"53":645,"21":646,"32":647,"50":648,"vent":649,"Ġupdate":650,"Alg":651,"ĠR":652,"ĠStack":653,"orith":654,"rollAlg":655,"ScrollAlg":656,"ĠStackScrollAlg":657,"orithm":658,"ĠStackScrollAlgorithm":659,"..":660,"22":661,"ver":662,"Ġ210":663,"Ġl":664,"Ġ19":665,"29":666,"000":667,"lap":668,"verlap":669,"44":670,"nim":671,"Ġevent":672,"am":673,"lag":674,"lags":675,"Ġta":676,"urface":677,"nimat":678,"Ġ2105":679,"op":680,"Ġw":681,"05":682,"ipp":683,"ipping":684,"43":685,"69":686,"Ġdo":687,"12":688,"09":689,"end":690,"Ġuid":691,"GE":692,"TA":693,"ten":694,"App":695,"ve":696,"Ġ28":697,"41":698,"unn":699,"Ġnot":700,"put":701,"Ġfalse":702,"SK":703,"iting":704,"TASK":705,"AL":706,"EAL":707,"Ġho":708,"Ġout":709,"imiting":710,"Ġcaller":711,"ĠREAL":712,"Ġlimiting":713,"Ġdoes":714,"GET":715,"unning":716,"TASKS":717,"Ġhold":718,"Ġoutput":719,"40":720,"tencent":721,"oc":722,"ĠgetT":723,"ĠgetR":724,"45":725,"Surface":726,"Ġ101":727,"28":728,"ac":729,"Ġp":730,"cl":731,"ui":732,"de":733,"io":734,"Ġis":735,"Ġ32":736,"cel":737,"ancel":738,"move":739,"Ġflags":740,"ocation":741,"Ġcancel":742,"Ġ176":743,"pend":744,"ĠT":745,"Ġt":746,"uspend":747,"est":748,"31":749,"Ex":750,"Int":751,"Update":752,"25":753,"intent":754,"Ġflg":755,"1000":756,"67":757,"roy":758,"udio":759,"estroy":760,"30":761,"Ġsuspend":762,"200":763,"Location":764,"Inter":765,"rget":766,"ĠWindow":767,"State":768,"Ġtarget":769,"Ġpid":770,"Pro":771,"Tim":772,"ss":773,"cess":774,"remove":775,"Ġ10111":776,"ĠWindowManager":777,"Time":778,"Out":779,"ans":780,"ĠbrightnessIn":781,"ĠbrightnessOut":782,"Ġrate":783,"ĠAnimat":784,"ĠAnimating":785,"Intent":786,"rans":787,"333":788,"Process":789,"23":790,"WindowManagerService":791,"AppProcess":792,"unningAppProcess":793,"ĠgetRunningAppProcess":794,"ĠgetRunningAppProcesses":795,"Pad":796,"ĠPhoneInter":797,"faceManager":798,"Ġ2626":799,"ĠPhoneInterfaceManager":800,"ĠNotification":801,"asks":802,"ame":803,"ĠNotificationManager":804,"\",":805,"Block":806,"ding":807,"ĠS":808,"Ġoverlap":809,"lation":810,"opPad":811,"ĠgetTopPad":812,"ranslation":813,"ĠgetTopPadding":814,"No":815,"iew":816,"...":817,"Lock":818,"View":819,"eS":820,"WindowState":821,"uld":822,"Ġsho":823,"BlockLocation":824,"uldBlockLocation":825,"ĠshouldBlockLocation":826,"Ġ{":827,"Ġ03":828,"ĠeventTime":829,"34":830,"mp":831,"qq":832,"Ġuser":833,"/.":834,"35":835,"ake":836,"xx":837,"removeWindow":838,"si":839,"Ġ}":840,"Ġcmp":841,"ActivityNo":842,"Ġ369":843,"UpdateLocked":844,"ĠuserActivityNo":845,"ĠuserActivityNoUpdateLocked":846,"Cl":847,"el":848,"anel":849,"kipping":850,"Ġwith":851,"ĠSkipping":852,"\".":853,"24":854,"PowerManagerService":855,"Wake":856,"Ġ\"":857,"Ġtr":858,"Ġblock":859,"ĠAudio":860,"Locks":861,"WakeLocks":862,"Ġblocker":863,"ĠAudioManager":864,"Di":865,"Hid":866,"Overlap":867,"destroy":868,"dHid":869,"qui":870,"ensi":871,"edActiv":872,"tive":873,"mmedActiv":874,"atedHid":875,"Ġex":876,"ĠupdateCl":877,"ĠupdateDi":878,"ĠisOverlap":879,"ĠTranslation":880,"eSensi":881,"mmedActivatedHid":882,"ĠupdateClipping":883,"ĠupdateDimmedActivatedHid":884,"eSensitive":885,"ĠupdateDimmedActivatedHideSensitive":886,"ww":887,"Ġac":888,"Ġ27":889,"mobi":890,"leqq":891,"mobileqq":892,"uded":893,"cluded":894,"Excluded":895,"ĠwithExcluded":896,"601":897,"activ":898,"ang":899,"hang":900,"Ġby":901,"ter":902,"0000":903,"ĠPanel":904,"ĠPanelView":905,"42":906,"108":907,"ffff":908,"has":909,"Ġ5":910,"Ġ326":911,"Ke":912,"ch":913,"Ġ(":914,"Ġto":915,"destroySurface":916,"Key":917,"Animat":918,"Ġname":919,"Ġ28601":920,"Animator":921,"=\"":922,"hide":923,"tras":924,"Ġtag":925,"Ġws":926,"Ġextras":927,"76":928,"null":929,"ĠcancelNotification":930,"WindowStateAnimator":931,"96":932,"ex":933,"pe":934,"Ġ59":935,"Ġ15":936,"Auto":937,"Ġfor":938,"2619":939,"Autohide":940,":-":941,"79":942,"Ġ12":943,"cli":944,"89":945,"Ġke":946,"Ġkey":947,"Chang":948,"fi":949,"Ġ11":950,"Tasks":951,"ecent":952,"ord":953,"ecord":954,"Ġinter":955,"Ġres":956,"fo":957,"ory":958,"Ġ273":959,"ase":960,"87":961,"ype":962,"40000":963,"ack":964,"ele":965,"gu":966,"age":967,"ount":968,"Ġret":969,"Ġcalled":970,"guard":971,"ir":972,"ml":973,"Ġ...":974,"ffect":975,"Ġrunning":976,"ĠgetTasks":977,"action":978,"91":979,"Record":980,"to":981,"ule":982,"Ġ146":983,"cep":984,"Ġ67":985,"60":986,"Ġ255":987,"activity":988,"To":989,"um":990,"671":991,"913":992,"cqui":993,"ring":994,"asing":995,"ĠAcqui":996,"ĠRele":997,"ĠAcquiring":998,"ĠReleasing":999,"99":1000,"Type":1001,"bid":1002,"den":1003,"lication":1004,"ner":1005,"qu":1006,"var":1007,"Ġ21":1008,"ĠDir":1009,"Ġinde":1010,"html":1011,"ectory":1012,"Ġrule":1013,"Ġ2639":1014,"www":1015,"Ġforbid":1016,"client":1017,"cept":1018,"ĠDirectory":1019,"Ġindex":1020,"Ġforbidden":1021,"100":1022,"78":1023,"88":1024,"ap":1025,"uid":1026,"00000":1027,"Ġ23":1028,"Inner":1029,"Ġ3694":1030,"Changed":1031,"pand":1032,"Ġ49":1033,"Ġ100":1034,"itor":1035,"fy":1036,"ifi":1037,"ken":1038,"Ġi":1039,"Ġon":1040,"Ġnoti":1041,"ĠSurface":1042,"2618":1043,"Ġ8671":1044,"Ġ2633":1045,"Ġact":1046,"Ġ2113":1047,":[":1048,"pl":1049,"qt":1050,"},":1051,"Ġnull":1052,"Info":1053,"ĠgetRecent":1054,"Ġ17630":1055,"xxxx":1056,"removeWindowLocked":1057,"removeWindowInner":1058,"Ġintercept":1059,"ĠgetRecentTasks":1060,"removeWindowInnerLocked":1061,"ĠinterceptKey":1062,"Display":1063,"Effect":1064,"Sound":1065,"sta":1066,"tal":1067,"Ġ1737":1068,"ast":1069,"585":1070,"Ġ324":1071,"active":1072,"SoundEffect":1073,"Am":1074,"CK":1075,"Screen":1076,"led":1077,"nd":1078,"ĠčĊ":1079,"Ġlock":1080,"Ġ104":1081,"arm":1082,"lease":1083,"Active":1084,"Ġrelease":1085,"quire":1086,"Ġacquire":1087,"Amount":1088,"Ġ10454":1089,"101":1090,"86":1091,"Tag":1092,"name":1093,"ub":1094,"ĠDestroy":1095,"Ġsurface":1096,"Ġ10113":1097,"ĠDestroying":1098,"77":1099,"IN":1100,"Up":1101,"Wifi":1102,"],":1103,"kg":1104,"system":1105,"Ġa":1106,"Ġ236":1107,"Monitor":1108,"ream":1109,"2060":1110,"Ġ313":1111,"Scan":1112,"destroySurfaceLocked":1113,"Keyguard":1114,"ackage":1115,"DisplayScan":1116,"WifiDisplayScan":1117,"systemui":1118,"62":1119,"600":1120,"Call":1121,"call":1122,"gin":1123,"index":1124,"Ġ327":1125,"Ġ720":1126,"ĠsuspendAutohide":1127,"Ġ3137":1128,"68":1129,"TI":1130,"ab":1131,"ef":1132,"flags":1133,"our":1134,"phone":1135,"rt":1136,"ts":1137,"ĠKeyguard":1138,"Ġ14":1139,"Ġ128":1140,"unch":1141,"1702":1142,"Application":1143,"Ġ17632":1144,"UpdateMonitor":1145,"Ġ27357":1146,"Token":1147,"ource":1148,"ĠKeyguardUpdateMonitor":1149,"Pe":1150,"Sto":1151,"ek":1152,"tag":1153,"pped":1154,"ending":1155,"Ġ17621":1156,"Ġ3693":1157,"Peek":1158,"Stopped":1159,"920":1160,"=[":1161,"With":1162,"ible":1163,"pkg":1164,"own":1165,"InCall":1166,"Ġ2618":1167,"ĠcancelPeek":1168,"Expand":1169,"ĠcancelNotificationWith":1170,"abled":1171,"ĠcancelNotificationWithTag":1172,"303":1173,"508":1174,"708":1175,"RI":1176,"ose":1177,"oll":1178,"Ġ55":1179,"ĠSystemUiVisibility":1180,"Enabled":1181,"usic":1182,"UiVisibilityChanged":1183,"ffffffff":1184,"Ġ27353":1185,"Ġ14638":1186,"apse":1187,"Ġ2318":1188,"fyUiVisibilityChanged":1189,"ĠnotifyUiVisibilityChanged":1190,"Ġ1280":1191,"ollapse":1192,"220":1193,"Flags":1194,"Pla":1195,"Source":1196,"he":1197,"larm":1198,"ode":1199,"Ġandroid":1200,"anUp":1201,"Ġcle":1202,"Ġdown":1203,"ueue":1204,"Ġ8303":1205,"188":1206,"ĠAlarm":1207,"NotificationVisibility":1208,"290":1209,"SurfacePla":1210,"Ġ10091":1211,"ApplicationRecord":1212,"anUpApplicationRecord":1213,"ĠcleanUpApplicationRecord":1214,"700":1215,"ACK":1216,"AIN":1217,"Collapse":1218,"LJ":1219,"MAIN":1220,"WL":1221,"Work":1222,"sEnabled":1223,"ySoundEffect":1224,"Ġ58":1225,"Ġqu":1226,"erySoundEffect":1227,"tation":1228,"launch":1229,"264":1230,"2626":1231,"560":1232,"444":1233,"1080":1234,"1001":1235,"RILJ":1236,"WorkSource":1237,"ĠquerySoundEffect":1238,"ĠquerySoundEffectsEnabled":1239,"*\",":1240,"66":1241,"]=":1242,"][":1243,"no":1244,"pad":1245,"ugin":1246,"}}":1247,"Ġchang":1248,"tepad":1249,"Ġbnd":1250,"WindowToken":1251,"555":1252,"Ġremove":1253,"1896":1254,"ample":1255,"67585":1256,"=\"*":1257,"example":1258,"Expanded":1259,"notepad":1260,"Ġbnds":1261,"189667585":1262,"121":1263,"514":1264,"97":1265,"Audio":1266,"Event":1267,"og":1268,"Ġ:":1269,"Ġtrue":1270,"Ġ54":1271,"Ġ50":1272,"Ġst":1273,"try":1274,"ash":1275,"Ġ37":1276,"395":1277,"ult":1278,"Ġ2096":1279,"530":1280,"ĠcancelAutohide":1281,"Ġ17622":1282,"40000600":1283,"//":1284,"2560":1285,"2555":1286,"317":1287,"98":1288,"908":1289,"Bef":1290,"Com":1291,"Pop":1292,"Queue":1293,"Re":1294,"Recent":1295,"St":1296,"Spl":1297,"Tq":1298,"WX":1299,"au":1300,"base":1301,"cts":1302,"code":1303,"out":1304,"pon":1305,"pWindow":1306,"package":1307,"sActivity":1308,"upWindow":1309,"Ġ,":1310,"Ġal":1311,"Ġpolicy":1312,"Ġ57":1313,"Ġ2395":1314,"incall":1315,"tacts":1316,"2702":1317,"2739":1318,"Ġ1736":1319,"Entry":1320,"1554":1321,"ller":1322,"recent":1323,"oreQueue":1324,"Ġde":1325,"Ġdat":1326,"138":1327,"contacts":1328,"Ġnum":1329,"2691":1330,"4000":1331,"layout":1332,"Ġ8290":1333,"stub":1334,"entInfo":1335,"opActivity":1336,"Ġ2838":1337,"ocus":1338,"Ġcanceled":1339,"ĠtopActivity":1340,"removeLocked":1341,"Ġ3697":1342,"000002":1343,"0000700":1344,"10840000":1345,"10800000":1346,"Ġkeyguard":1347,"Ġkeycode":1348,"file":1349,"Ġinteractive":1350,"Ġresult":1351,"total":1352,"Ġ14640":1353,"plugin":1354,"qtl":1355,"ĠinterceptKeyBef":1356,"ĠinterceptKeyTq":1357,"staller":1358,"endingIntent":1359,"InCallActivity":1360,"18800000":1361,"10804000":1362,"ĠremoveNotification":1363,"ashActivity":1364,"Compon":1365,"PopupWindow":1366,"RecentsActivity":1367,"SplashActivity":1368,"WXEntry":1369,"ause":1370,"ĠpolicyFlags":1371,"incallui":1372,"recents":1373,"oreQueueing":1374,"ĠkeyguardActive":1375,"totalTasks":1376,"ĠinterceptKeyBeforeQueueing":1377,"ComponentInfo":1378,"WXEntryActivity":1379,"800":1380,"CH":1381,"La":1382,"Or":1383,"Sh":1384,"Top":1385,"Translation":1386,"YTranslation":1387,"cast":1388,"pTop":1389,"vio":1390,"ĠC":1391,"ĠM":1392,"ĠU":1393,"Ġ46":1394,"Ġactive":1395,"road":1396,"Ġ2250":1397,"():-":1398,"End":1399,"153":1400,"usNotification":1401,"revio":1402,"Ġfro":1403,"ade":1404,"Ġbroad":1405,"Ġ1815":1406,"ĠgetLocation":1407,"111":1408,"365":1409,"ĠnewYTranslation":1410,"484":1411,"NotificationSh":1412,"OnScreen":1413,"ĠupdateNotificationSh":1414,"Ġlocation":1415,"Ġprevio":1416,"ĠoverlapAmount":1417,"Ġtotal":1418,"765":1419,"clipTop":1420,"Ġ2556":1421,"ĠAlarmManager":1422,"Ġchange":1423,"Ġstop":1424,"usNotificationEnd":1425,"Ġbroadcast":1426,"ĠgetLocationOnScreen":1427,"ĠupdateNotificationShade":1428,"ĠpreviousNotificationEnd":1429,"clipTopAmount":1430,"'t":1431,"63":1432,"75":1433,"85":1434,"92":1435,"93":1436,"Child":1437,"Music":1438,"ON":1439,"Qs":1440,"Th":1441,"eed":1442,"lose":1443,"ren":1444,"Ġ4":1445,"Ġus":1446,"Ġlayout":1447,"unIn":1448,"Ġcause":1449,"Ġclose":1450,"Ġinit":1451,"ĠPendingIntent":1452,"read":1453,"Ġfind":1454,"Ġfocus":1455,"Ġstart":1456,"207":1457,"Ġneed":1458,"553":1459,"Visible":1460,"ĠDisplayManagerService":1461,"ĠmExpanded":1462,"ĠrunIn":1463,"497":1464,"598":1465,"482":1466,"LightsLocked":1467,"Ġ2644":1468,"ĠupdateLightsLocked":1469,"Ġlog":1470,"Ġ2839":1471,"ĠisMusic":1472,"ĠThe":1473,"899":1474,"Changes":1475,"Ġ2558":1476,"10111":1477,"Ġ23650":1478,"reamType":1479,"WifiDisplayScanLocked":1480,"WifiDisplayScanRe":1481,"NotificationVisibilityChanges":1482,"ĠcleanUpApplicationRecordLocked":1483,"Stream":1484,"ĠremoveNotificationChild":1485,"ĠCan":1486,"Ġfrom":1487,"ĠstopWifiDisplayScanLocked":1488,"Thread":1489,"Ġcaused":1490,"ĠcloseQs":1491,"ĠmExpandedVisible":1492,"ĠrunInThread":1493,"ĠlogNotificationVisibilityChanges":1494,"ĠisMusicActive":1495,"WifiDisplayScanRequ":1496,"ĠremoveNotificationChildren":1497,"233":1498,"94":1499,"Mi":1500,"OO":1501,"VI":1502,"audio":1503,"for":1504,"Ġ2514":1505,"Ġ09":1506,"anim":1507,"278":1508,"perfor":1509,"Ġ--":1510,"1041":1511,"Ġeuid":1512,"529":1513,"AppWindowToken":1514,"289":1515,"Ġ17633":1516,"26197":1517,"Ġapp":1518,"AudioMi":1519,"audioserver":1520,"perform":1521,"AudioMix":1522,"547":1523,"80":1524,"807":1525,"Count":1526,"CTI":1527,"Play":1528,"Package":1529,"SE":1530,"Sa":1531,"Vol":1532,"bar":1533,"tView":1534,"uch":1535,"Ġh":1536,"ĠĠ":1537,"Ġro":1538,"Ġplay":1539,"Ġanim":1540,"Ġsystem":1541,"notify":1542,"isten":1543,"edAutohide":1544,"Ġ63":1545,"208":1546,"105":1547,"Ġ7111":1548,"pplication":1549,"398":1550,"Ġeffect":1551,"499":1552,"583":1553,"070":1554,"091":1555,"AppStopped":1556,"veSurface":1557,"act":1558,"ĠTex":1559,"ĠtreamType":1560,"uspendedAutohide":1561,"eSuspendedAutohide":1562,"destroyOr":1563,"Ġexpand":1564,"Ġ27365":1565,"Ġ2794":1566,"761":1567,"26198":1568,"Ġresum":1569,"Ġ2555":1570,"activityStopped":1571,"Touch":1572,"ume":1573,"Ġnotification":1574,"2201":1575,"StreamVol":1576,"Player":1577,"SaveSurface":1578,"ĠplaySoundEffect":1579,"notifyAppStopped":1580,"ĠeffectType":1581,"ĠTextView":1582,"destroyOrSaveSurface":1583,"ĠresumeSuspendedAutohide":1584,"StreamVolume":1585,"352":1586,"517":1587,"769":1588,"Aud":1589,"Ce":1590,"De":1591,"Last":1592,"TE":1593,"cer":1594,"ment":1595,"vice":1596,"Ġg":1597,"Ġ38":1598,"008":1599,"info":1600,"cement":1601,"00508":1602,"ested":1603,"Ġinsta":1604,"ntCollapse":1605,"andle":1606,"010":1607,"011":1608,"WindowSurfacePla":1609,"ĠActivityRecord":1610,"ĠgetLast":1611,"498":1612,"599":1613,"Ġcalling":1614,"Ġ2107":1615,"Ġ2808":1616,"Ġaction":1617,"ibleStreamVolume":1618,"SurfacePlacement":1619,"80000508":1620,"performSurfacePlacement":1621,"AudibleStreamVolume":1622,"Cell":1623,"ĠinstantCollapse":1624,"WindowSurfacePlacer":1625,"ĠgetLastAudibleStreamVolume":1626,"057":1627,"1207":1628,"409":1629,"502":1630,"518":1631,"64":1632,"746":1633,"84":1634,"EW":1635,"Panel":1636,"TY":1637,"ion":1638,"ton":1639,"ved":1640,"yer":1641,"zone":1642,"Ġ<":1643,"Ġ48":1644,"Ġ208":1645,"Ġse":1646,"cei":1647,"0057":1648,"150":1649,"154":1650,"Ġ64":1651,"Ġ66":1652,"utton":1653,"Ġbe":1654,"ateCollapse":1655,"469":1656,"layed":1657,"Ġ868":1658,"Ġ8289":1659,"106":1660,"550":1661,"58482":1662,"224":1663,"291":1664,"694":1665,"Ġ2809":1666,"Ġ323":1667,"670":1668,"Note":1669,"Ġforce":1670,"790":1671,"calling":1672,"Ġ3714":1673,"Ġalarm":1674,"Ġdelayed":1675,"Layer":1676,"ĠanimateCollapse":1677,"CellInfo":1678,"120758482":1679,"Panels":1680,"Ġ8682":1681,"ĠanimateCollapsePanels":1682,"202":1683,"237":1684,"241":1685,"318":1686,"307":1687,"546":1688,"507":1689,"://":1690,"Cho":1691,"He":1692,"QQ":1693,"SU":1694,"Sub":1695,"Ten":1696,"av":1697,"application":1698,"bus":1699,"chi":1700,"em":1701,"gis":1702,"hed":1703,"ien":1704,"me":1705,"music":1706,"rec":1707,"sh":1708,"set":1709,"ula":1710,"vnd":1711,"yp":1712,"Ġ56":1713,"Ġ53":1714,"Ġend":1715,"Ġ156":1716,"001":1717,"003":1718,"iness":1719,"installer":1720,"orage":1721,"time":1722,"tart":1723,"tel":1724,"archi":1725,"270":1726,"Ġ603":1727,"essage":1728,"204":1729,"161":1730,"4000000":1731,"476":1732,"460":1733,"Ġ308":1734,"107":1735,"Installer":1736,"045":1737,"066":1738,"080":1739,"08000":1740,"392":1741,"storage":1742,"lockscreen":1743,"564":1744,"589":1745,"Ġ2643":1746,"190":1747,"atter":1748,"577":1749,"299":1750,"Ġwh":1751,"Ġ3258":1752,"Ġtype":1753,"Ġtyp":1754,"LockScreen":1755,"qqmusic":1756,"xxx":1757,"10808000":1758,"Ġrestart":1759,"872":1760,"992":1761,"994":1762,"apk":1763,"Ġ10027":1764,"xxxxxxxx":1765,"774":1766,"Ġ23689":1767,"oseSub":1768,"packageinstaller":1769,"CHOO":1770,"ĠbroadcastIntent":1771,"ĠPendingIntentRecord":1772,"VIEW":1773,"PackageInstaller":1774,"ceived":1775,"Ġbegin":1776,":///":1777,"ChooseSub":1778,"QQfile":1779,"SUB":1780,"Tencent":1781,"business":1782,"emula":1783,"gister":1784,"ientation":1785,"recv":1786,"archive":1787,"attery":1788,"LockScreenActivity":1789,"xxxxxxxxxxx":1790,"CHOOSE":1791,"PackageInstallerActivity":1792,"ChooseSubActivity":1793,"emulated":1794,"**":1795,"046":1796,"10057":1797,"250":1798,"338":1799,"346":1800,"311":1801,"459":1802,"527":1803,"516":1804,"539":1805,"61":1806,"603":1807,"609":1808,"83":1809,"820":1810,"811":1811,"90":1812,"932":1813,"ACTI":1814,"Battery":1815,"Ed":1816,"ME":1817,"Message":1818,"Pid":1819,"Sess":1820,"ak":1821,"back":1822,"iz":1823,"lu":1824,"mScreen":1825,"mInCall":1826,"mWifiDisplayScanRequ":1827,"os":1828,"qzone":1829,"ting":1830,"tur":1831,"xc":1832,"Ġ>":1833,"Ġx":1834,"Ġy":1835,"Ġid":1836,"Ġqui":1837,"erts":1838,"006":1839,"030":1840,"Ġclock":1841,"arch":1842,"isable":1843,"Ġoff":1844,"Ġover":1845,"Ġdisable":1846,"136":1847,"ome":1848,"162":1849,"164":1850,"igation":1851,"Ġnav":1852,"261":1853,"Ġback":1854,"475":1855,"Ġ367":1856,"Ġ==":1857,"Ġrecent":1858,"ĠmWifiDisplayScanRequ":1859,"061":1860,"065":1861,"Ġrecord":1862,"182":1863,"183":1864,"084":1865,"visible":1866,"590":1867,"595":1868,"568":1869,"569":1870,"077":1871,"542":1872,"528":1873,"Ġ2642":1874,"198":1875,"374":1876,"228":1877,"294":1878,"295":1879,"297":1880,"441":1881,"691":1882,"Ġ3255":1883,"estCount":1884,"Ġ502":1885,"Ġtoken":1886,"destroySurfaces":1887,"ĠcancelNotificationLocked":1888,"Ġreset":1889,"995":1890,"783":1891,"Ġ23469":1892,"ĠonNotificationVisibility":1893,"26187":1894,"ledNotification":1895,"TICK":1896,"}}},":1897,"Ġalerts":1898,"ĠUI":1899,"Ġhome":1900,"Ġrotation":1901,"istener":1902,"TouchEvent":1903,"ĠnotificationLight":1904,"Ġsearch":1905,"NoteEd":1906,"callingPid":1907,"setting":1908,"Ġ30852":1909,"Session":1910,"ize":1911,"mScreenOn":1912,"mWifiDisplayScanRequested":1913,"turn":1914,"Ġquick":1915,"igationbar":1916,"Ġnavigationbar":1917,"ĠmWifiDisplayScanRequestCount":1918,"ĠonNotificationVisibilityChanged":1919,"NoteEditor":1920,"settings":1921,"056":1922,"102":1923,"213":1924,"249":1925,"248":1926,"240":1927,"306":1928,"357":1929,"305":1930,"432":1931,"450":1932,"429":1933,"405":1934,"608":1935,"659":1936,"635":1937,"70":1938,"707":1939,"709":1940,"818":1941,"819":1942,"850":1943,"80000":1944,"95":1945,"926":1946,"937":1947,"942":1948,"For":1949,"Ne":1950,"New":1951,"Spe":1952,"Trans":1953,"UI":1954,"Wir":1955,"Xml":1956,"bor":1957,"blity":1958,"ge":1959,"hon":1960,"handle":1961,"hbor":1962,"il":1963,"ick":1964,"listener":1965,"phon":1966,"sDe":1967,"yManager":1968,"Ġor":1969,"erUI":1970,"Ġ133":1971,"Ġ139":1972,"002":1973,"Ġ218":1974,"tick":1975,"Ġsending":1976,"tail":1977,"170":1978,"178":1979,"038":1980,"277":1981,"028":1982,"repe":1983,"erval":1984,"ingCellInfo":1985,"139":1986,"1346":1987,"1393":1988,"382":1989,"386":1990,"146":1991,"148":1992,"149":1993,"209":1994,"166":1995,"ighbor":1996,"ActivityStack":1997,"ActivityManagerService":1998,"262":1999,"Value":2000,"479":2001,"getValue":2002,"466":2003,"Ġ366":2004,"339":2005,"ppWindowToken":2006,"Visiblity":2007,"04807":2008,"ĠgetNe":2009,"ĠmVisiblity":2010,"062":2011,"064":2012,"189":2013,"119":2014,"ĠAppWindowToken":2015,"368":2016,"Ġ1309":2017,"485":2018,"4869":2019,"Ġvisible":2020,"587":2021,"076":2022,"079":2023,"525":2024,"atInt":2025,"atch":2026,"ĠWifi":2027,"296":2028,"443":2029,"ams":2030,"amap":2031,"698":2032,"ĠgetRing":2033,"Ġ3259":2034,"Ġ3257":2035,"ĠTele":2036,"242":2037,"0000008":2038,"Ġ503":2039,"2619913":2040,"40000000":2041,"781":2042,"Ġ23685":2043,"uncherUI":2044,"974":2045,"LauncherUI":2046,"80583":2047,"activityStoppedLocked":2048,"7690":2049,"viceId":2050,"Ġ3807":2051,"Head":2052,"40000008":2053,"Ġwhen":2054,"80000608":2055,"NewsDe":2056,"Transact":2057,"Wired":2058,"XmlActivity":2059,"listenerTag":2060,"phonyManager":2061,"tailXmlActivity":2062,"repeatInt":2063,"134680583":2064,"ighboringCellInfo":2065,"Ġ3664":2066,"ĠgetNeighboringCellInfo":2067,"ĠTelephonyManager":2068,"NewsDetailXmlActivity":2069,"repeatInterval":2070,")],":2071,"115":2072,"122":2073,"216":2074,"300":2075,"354":2076,"414":2077,"410":2078,"436":2079,"458":2080,"451":2081,"419":2082,"428":2083,"538":2084,"65":2085,"614":2086,"619":2087,"669":2088,"640":2089,"719":2090,"757":2091,"743":2092,"735":2093,"846":2094,"839":2095,"859":2096,"853":2097,"896":2098,"879":2099,"938":2100,"916":2101,"955":2102,"939":2103,"936":2104,"944":2105,"931":2106,"967":2107,"979":2108,"AN":2109,"AT":2110,"Anim":2111,"Button":2112,"BAT":2113,"Da":2114,"FIN":2115,"Mode":2116,"PE":2117,"RO":2118,"RT":2119,"RY":2120,"Ro":2121,"Runn":2122,"Size":2123,"TOO":2124,"ax":2125,"aPlayer":2126,"eo":2127,"eta":2128,"iaPlayer":2129,"locked":2130,"mis":2131,"nal":2132,"oin":2133,"oing":2134,"queue":2135,"sUp":2136,"th":2137,"vid":2138,"xy":2139,"Ġhi":2140,"Ġen":2141,"Ġed":2142,"Ġper":2143,"Ġhas":2144,"Ġhide":2145,"Ġhe":2146,"Ġ122":2147,"Ġ1208":2148,"004":2149,"Ġ227":2150,"inLayer":2151,"onEvent":2152,"onTransact":2153,"Ġsource":2154,"ceChanged":2155,"ecu":2156,"tach":2157,"171":2158,"173":2159,"175":2160,"031":2161,"039":2162,"Ġcro":2163,"otionEvent":2164,"Ġinfo":2165,"ĠinRo":2166,"022":2167,"025":2168,"ediaPlayer":2169,"Ġscreen":2170,"Ġsched":2171,"Ġdisplay":2172,"idth":2173,"Ġ60":2174,"Ġ604":2175,"387":2176,"388":2177,"389":2178,"141":2179,"143":2180,"144":2181,"147":2182,"201":2183,"tusbar":2184,"Ġbutton":2185,"Ġblocked":2186,"471":2187,"018":2188,"467":2189,"104":2190,"332":2191,"552":2192,"554":2193,"player":2194,"Invisible":2195,"ĠActivityManagerService":2196,"ĠActivityInfo":2197,"049":2198,"Ġreceived":2199,"Ġregister":2200,"Ġmanager":2201,"ĠmBlock":2202,"Ġmake":2203,"ĠmHead":2204,"Ġmax":2205,"Ġmeta":2206,"ĠminLayer":2207,"180":2208,"185":2209,"187":2210,"olType":2211,"story":2212,"uling":2213,"ĠACTI":2214,"360":2215,"366":2216,"483":2217,"488":2218,"489":2219,"NotificationInter":2220,"566":2221,"586":2222,"071":2223,"524":2224,"192":2225,"196":2226,"375":2227,"379":2228,"attach":2229,"571":2230,"223":2231,"225":2232,"Ġ19609":2233,"Ġwidth":2234,"435":2235,"696":2236,"090":2237,"099":2238,"GED":2239,"GER":2240,"TART":2241,"281":2242,"Ġpkg":2243,"Ġpoin":2244,"ĠTak":2245,"Excep":2246,"Existen":2247,"Intercept":2248,"Proxy":2249,"235":2250,"ĠSTART":2251,"sion":2252,"Ġ},":2253,"terCount":2254,"Ġ3267":2255,"ĠtoolType":2256,"763":2257,"766":2258,"791":2259,"794":2260,"1002":2261,"882":2262,"Ġ23484":2263,"Ġ10020":2264,"ĠonNotification":2265,"ĠonExpand":2266,"ĠonIntercept":2267,"2618516":2268,"statusbar":2269,"10113":2270,"10112":2271,"866":2272,"ĠdownTime":2273,"}}}":2274,"ExpandedInvisible":2275,"ĠdeviceId":2276,"CHAN":2277,"ĠMotionEvent":2278,"ĠMediaPlayer":2279,"2332":2280,"VITY":2281,"Ġhandle":2282,"Ġrot":2283,"Touches":2284,"PlayerActivity":2285,"Device":2286,"TERY":2287,"Ġgoing":2288,"Ġ3848":2289,"ĠactionButton":2290,"4097":2291,"TYPE":2292,"shot":2293,"ACTION":2294,"lug":2295,"geFlags":2296,"Ġorientation":2297,"Ġ13094":2298,"261991304":2299,"Animation":2300,"BATTERY":2301,"Data":2302,"FINGER":2303,"Runnable":2304,"TOOL":2305,"mission":2306,"queueNotificationInter":2307,"sUpExisten":2308,"video":2309,"Ġhistory":2310,"ĠenqueueNotificationInter":2311,"ĠedgeFlags":2312,"Ġpermission":2313,"Ġheight":2314,"Ġ12236":2315,"Ġ22775":2316,"ceChangedRunnable":2317,"Ġcrop":2318,"ĠinRotation":2319,"Ġscreenshot":2320,"Ġschedule":2321,"ĠbuttonState":2322,"ĠmBlockTouches":2323,"ĠmakeExpandedInvisible":2324,"ĠmHeadsUpExisten":2325,"ĠmaxLayer":2326,"ĠmetaState":2327,"attachApplication":2328,"ĠpointerCount":2329,"ĠTaking":2330,"Exception":2331,"ĠonExpanding":2332,"ĠonInterceptTouchEvent":2333,"261851646":2334,"CHANGED":2335,"ĠhistorySize":2336,"ĠenqueueNotificationInternal":2337,"ĠmHeadsUpExistenceChangedRunnable":2338,");":2339,"047":2340,"050":2341,"126":2342,"215":2343,"246":2344,"211":2345,"259":2346,"236":2347,"232":2348,"244":2349,"245":2350,"2108":2351,"21080":2352,"327":2353,"304":2354,"359":2355,"319":2356,"321":2357,"312":2358,"341":2359,"345":2360,"403":2361,"402":2362,"408":2363,"425":2364,"549":2365,"536":2366,"602":2367,"616":2368,"652":2369,"622":2370,"641":2371,"625":2372,"630":2373,"689":2374,"687":2375,"718":2376,"736":2377,"756":2378,"729":2379,"745":2380,"778":2381,"81":2382,"82":2383,"802":2384,"816":2385,"808":2386,"856":2387,"821":2388,"809":2389,"840":2390,"830":2391,"834":2392,"8670":2393,"903":2394,"927":2395,"950":2396,"940":2397,"945":2398,"928":2399,"988":2400,"At":2401,"All":2402,"And":2403,"Bind":2404,"CON":2405,"Def":2406,"ED":2407,"FO":2408,"Hand":2409,"IME":2410,"LA":2411,"LO":2412,"Lo":2413,"Lw":2414,"Met":2415,"Run":2416,"STE":2417,"Tick":2418,"YSTE":2419,"af":2420,"ati":2421,"dis":2422,"eceived":2423,"ger":2424,"ging":2425,"gory":2426,"har":2427,"ient":2428,"ler":2429,"ms":2430,"ntent":2431,"patch":2432,"pati":2433,"ric":2434,"rted":2435,"sLocked":2436,"uti":2437,"Ġ.":2438,"ĠE":2439,"Ġun":2440,"Ġ**":2441,"erMode":2442,"Ġ127":2443,"Ġ147":2444,"007":2445,"inis":2446,"orient":2447,"Ġservice":2448,"172":2449,"17499":2450,"032":2451,"Ġcon":2452,"272":2453,"Start":2454,"Started":2455,"hich":2456,"026":2457,"etric":2458,"erred":2459,"155":2460,"Ġof":2461,"eduling":2462,"ush":2463,"ust":2464,"ĠICON":2465,"ĠIntent":2466,"register":2467,"ingDisplay":2468,"Ġ61":2469,"130":2470,"cons":2471,"140":2472,"205":2473,"165":2474,"igger":2475,"Ġnon":2476,"266":2477,"ategory":2478,"roidRun":2479,"462":2480,"465":2481,"Ġ368":2482,"Ġ3066":2483,"336":2484,"Input":2485,"043":2486,"ĠgetAll":2487,"Ġrequ":2488,"Powered":2489,"Ġmetric":2490,"069":2491,"181":2492,"186":2493,"087":2494,"Ġcompati":2495,"396":2496,"399":2497,"496":2498,"593":2499,"594":2500,"597":2501,"ĠApplication":2502,"361":2503,"364":2504,"367":2505,"480":2506,"481":2507,"487":2508,"hod":2509,"561":2510,"565":2511,"582":2512,"541":2513,"512":2514,"521":2515,"191":2516,"573":2517,"578":2518,"Ġcallback":2519,"531":2520,"535":2521,"324":2522,"325":2523,"328":2524,"505":2525,"509":2526,"ĠReceived":2527,"Ġ2106":2528,"Ġlast":2529,"442":2530,"Ġwhich":2531,"434":2532,"693":2533,"124":2534,"TATI":2535,"vel":2536,"280":2537,"282":2538,"ĠTIME":2539,"675":2540,"676":2541,"678":2542,"TimeUpdate":2543,"TimeTick":2544,"ĠSYSTE":2545,"342":2546,"Ġtrigger":2547,"Ġexecu":2548,"cheduling":2549,"764":2550,"768":2551,"963":2552,"9600":2553,"792":2554,"793":2555,"797":2556,"Ġ12025":2557,"897":2558,"898":2559,"Ġrescheduling":2560,"871":2561,"873":2562,"40000208":2563,"993":2564,"Ġ2121":2565,"784":2566,"883":2567,"888":2568,"Ġicons":2569,"CKED":2570,"770":2571,"772":2572,"INFO":2573,"Callback":2574,"TIME":2575,"661":2576,"Ġchanged":2577,"971":2578,"973":2579,"Ġ50926":2580,"Ġ5769":2581,"Ġ5784":2582,"Orientation":2583,"ĠMust":2584,"ĠUn":2585,"ĠUSE":2586,"9231":2587,"Ġgot":2588,"ĠcallingPackage":2589,"performSurfacePlacementInner":2590,"performSurfacePlacementLo":2591,"show":2592,"timeException":2593,"BatteryL":2594,"ĠrotationFor":2595,"Speed":2596,"handleMessage":2597,"ĠWifiController":2598,"ĠgetRingerMode":2599,"ROTATI":2600,"ĠregisterCallback":2601,"ĠhandleTimeUpdate":2602,"ĠscheduleTimeTick":2603,"21085":2604,"AtTime":2605,"AndroidRun":2606,"Binder":2607,"Deferred":2608,"Handler":2609,"LOCKED":2610,"Method":2611,"dispatch":2612,"harging":2613,"util":2614,"Ġunregister":2615,"Ġ***":2616,"1749923":2617,"ĠICONS":2618,"InputMethod":2619,"ĠgetAllCellInfo":2620,"Ġrequested":2621,"Ġmetrics":2622,"Ġcompatible":2623,"ĠSYSTEM":2624,"ĠtriggerAtTime":2625,"Ġexecute":2626,"OrientationLw":2627,"ĠUSER":2628,"performSurfacePlacementLoop":2629,"ĠrotationForOrientationLw":2630,"ROTATION":2631,"ĠscheduleTimeTickEvent":2632,"AndroidRuntimeException":2633,"dispatchMessage":2634,")}":2635,"016":2636,"055":2637,"059":2638,"054":2639,"103":2640,"127":2641,"113":2642,"129":2643,"214":2644,"210":2645,"254":2646,"252":2647,"253":2648,"24000000":2649,"2198":2650,"313":2651,"320":2652,"326":2653,"310":2654,"308":2655,"349":2656,"351":2657,"340":2658,"417":2659,"427":2660,"413":2661,"426":2662,"418":2663,"439":2664,"449":2665,"448":2666,"452":2667,"503":2668,"520":2669,"526":2670,"533":2671,"506":2672,"537":2673,"627":2674,"613":2675,"638":2676,"626":2677,"633":2678,"655":2679,"606":2680,"649":2681,"654":2682,"653":2683,"612":2684,"631":2685,"667":2686,"642":2687,"660":2688,"688":2689,"71":2690,"72":2691,"74":2692,"717":2693,"713":2694,"738":2695,"747":2696,"701":2697,"733":2698,"751":2699,"721":2700,"744":2701,"712":2702,"734":2703,"724":2704,"779":2705,"815":2706,"814":2707,"847":2708,"810":2709,"806":2710,"858":2711,"832":2712,"844":2713,"843":2714,"869":2715,"828":2716,"831":2717,"889":2718,"887":2719,"900":2720,"902":2721,"914":2722,"957":2723,"921":2724,"943":2725,"969":2726,"912":2727,"941":2728,"989":2729,"978":2730,"986":2731,"::":2732,"Ac":2733,"ATE":2734,"Bec":2735,"Blu":2736,"DO":2737,"Destroy":2738,"EN":2739,"ER":2740,"Fal":2741,"Fre":2742,"Focus":2743,"Fact":2744,"Finis":2745,"Is":2746,"IWindow":2747,"Mgr":2748,"NCH":2749,"Of":2750,"Op":2751,"Pl":2752,"Phone":2753,"PRI":2754,"PendingIntent":2755,"Plug":2756,"Qzone":2757,"Sim":2758,"Tr":2759,"UP":2760,"Uid":2761,"UNCH":2762,"VATE":2763,"WN":2764,"We":2765,"]}":2766,"ain":2767,"br":2768,"batch":2769,"bPl":2770,"co":2771,"cancel":2772,"chang":2773,"count":2774,"category":2775,"df":2776,"dNotification":2777,"ez":2778,"fMgr":2779,"ged":2780,"hec":2781,"hBattery":2782,"ibr":2783,"kn":2784,"king":2785,"ly":2786,"ling":2787,"log":2788,"nec":2789,"oot":2790,"oper":2791,"pr":2792,"pans":2793,"push":2794,"res":2795,"sing":2796,"sFor":2797,"tt":2798,"ty":2799,"tec":2800,"tone":2801,"tpush":2802,"view":2803,"vibr":2804,"Ġas":2805,"Ġad":2806,"ĠLock":2807,"Ġtick":2808,"ĠStart":2809,"Ġvel":2810,"Ġvibr":2811,"erphone":2812,"Ġ1000":2813,"Ġ141":2814,"Ġ10057":2815,"009":2816,"Ġ24":2817,"Ġ216":2818,"Ġ211":2819,"Ġ258":2820,"Ġ207":2821,"Ġ257":2822,"Ġ2153":2823,"Ġ01":2824,"ĠDe":2825,"Ġsound":2826,"Ġsub":2827,"Ġsize":2828,"179":2829,"17346":2830,"036":2831,"Ġcol":2832,"Ġcat":2833,"Ġcollapse":2834,"Ġchec":2835,"tell":2836,"arking":2837,"rocess":2838,"271":2839,"275":2840,"279":2841,"020":2842,"02333":2843,"etoot":2844,"bott":2845,"mote":2846,"ĠProcess":2847,"151":2848,"158":2849,"1556":2850,"1522":2851,"15564":2852,"reas":2853,"relayout":2854,"remote":2855,"protec":2856,"Ġfling":2857,"132":2858,"135":2859,"380":2860,"385":2861,"142":2862,"1499":2863,"Ġstack":2864,"206":2865,"tionState":2866,"tionsLocked":2867,"163":2868,"168":2869,"169":2870,"260":2871,"265":2872,"Ġbounds":2873,"470":2874,"472":2875,"ĠsetSpe":2876,"ĠsetWired":2877,"019":2878,"ationType":2879,"getKey":2880,"WindowAnimator":2881,"464":2882,"468":2883,"330":2884,"334":2885,"3310":2886,"551":2887,"557":2888,"042":2889,"0404":2890,"0489":2891,"ĠgetDevice":2892,"ĠgetData":2893,"Connec":2894,"Ġrebatch":2895,"060":2896,"063":2897,"184":2898,"085":2899,"089":2900,"391":2901,"397":2902,"Ġemp":2903,"596":2904,"faul":2905,"362":2906,"Ġ13003":2907,"486":2908,"NotificationLocked":2909,"562":2910,"563":2911,"075":2912,"078":2913,"0798":2914,"540":2915,"5244":2916,"193":2917,"195":2918,"197":2919,"19106":2920,"tentView":2921,"370":2922,"371":2923,"372":2924,"572":2925,"579":2926,"570404":2927,"21000":2928,"322":2929,"ĠRef":2930,"222":2931,"2227":2932,"293":2933,"298":2934,"29192":2935,"440":2936,"445":2937,"695":2938,"123":2939,"093":2940,"095":2941,"096":2942,"Ġ10112":2943,"284":2944,"285":2945,"287":2946,"28601":2947,"Ġplug":2948,"ĠisBatteryL":2949,"ĠisBlu":2950,"Ġ3247":2951,"Ġ1765":2952,"Ġthe":2953,"Expans":2954,"IntfMgr":2955,"cessory":2956,"PadActivity":2957,"ĠSending":2958,"Click":2959,"000000":2960,"00000000":2961,"Ġ549":2962,"762":2963,"964":2964,"261986":2965,"2619507":2966,"795":2967,"799":2968,"Ġ12278":2969,"894":2970,"895":2971,"Ġresid":2972,"874":2973,"875":2974,"877":2975,"878":2976,"40000108":2977,"acking":2978,"Ġ6733":2979,"Ġ6751":2980,"Ġ6750":2981,"Ġ6741":2982,"Ġ6740":2983,"Ġ6725":2984,"ToHe":2985,"10020":2986,"10037":2987,"785":2988,"786":2989,"884":2990,"885":2991,"ĠonTouchEvent":2992,"ĠonTr":2993,"2618499":2994,"1011":2995,"861":2996,"863":2997,"861522":2998,"771":2999,"UpFact":3000,"KeyguardMonitor":3001,"uginProxy":3002,"}})":3003,"121161":3004,"AudioEvent":3005,"AudioFocus":3006,"Ġ5092":3007,"ĠstreamType":3008,"980":3009,"Stub":3010,"Ġdefaul":3011,"auseOf":3012,"ĠMarking":3013,"6309":3014,"ĠstartAnimation":3015,"233570404":3016,"261972":3017,"2619733":3018,"2619732":3019,"Ġapply":3020,"performDeferred":3021,"ĠanimationType":3022,"091223":3023,"ĠexpandBec":3024,"2619887":3025,"Ġgt":3026,"ionChanged":3027,"Ġseen":3028,"NotePadActivity":3029,"callingUid":3030,"237091223":3031,"Ġwhat":3032,"603735":3033,"ACTIVITY":3034,"akerphone":3035,"10200000":3036,"handleAudioEvent":3037,"166121161":3038,"ĠWifiService":3039,"ĠgetRingtone":3040,"WiredAc":3041,"ĠACTION":3042,"ĠACTIVITY":3043,"ĠonNotificationExpans":3044,"ĠonNotificationClick":3045,"DeviceConnec":3046,"ĠonExpandingStarted":3047,"ĠonExpandingFinis":3048,"LAUNCH":3049,"ĠcontentView":3050,"Ġ509262332":3051,"ĠUnkn":3052,"SpeedUpFact":3053,"BinderProxy":3054,"219829192":3055,"77903":3056,"DOWN":3057,"Falsing":3058,"Freez":3059,"IsPowered":3060,"IWindowSession":3061,"OptionsLocked":3062,"PhoneIntfMgr":3063,"PRIVATE":3064,"PlugType":3065,"QzoneWe":3066,"bPluginProxy":3067,"cooper":3068,"cancelNotificationLocked":3069,"change":3070,"gedType":3071,"hBatteryInfo":3072,"logic":3073,"pri":3074,"reshBatteryInfo":3075,"sForStream":3076,"ĠaddNotification":3077,"Ġvibrate":3078,"ĠsubId":3079,"173466309":3080,"Ġcolor":3081,"ĠcollapseSpeedUpFact":3082,"Ġcheck":3083,"etooth":3084,"bottom":3085,"155652":3086,"155645244":3087,"reason":3088,"protected":3089,"ĠflingToHe":3090,"149977903":3091,"ĠsetSpeakerphone":3092,"ĠsetWiredDeviceConnec":3093,"04890":3094,"ĠgetDevicesForStream":3095,"ĠgetDataEnabled":3096,"Ġrebatching":3097,"Ġempty":3098,"191063310":3099,"ĠRefreshBatteryInfo":3100,"ĠpluggedType":3101,"ĠisBatteryLow":3102,"ĠisBluetooth":3103,"cessoryManager":3104,"ĠonTracking":3105,"86152250":3106,"Ġ509202333":3107,"Ġdefaults":3108,"auseOfFalsing":3109,"ĠapplyOptionsLocked":3110,"performDeferredDestroy":3111,"ĠexpandBecauseOfFalsing":3112,"60373518":3113,"ĠgetRingtonePlayer":3114,"WiredAccessoryManager":3115,"ĠonNotificationExpansionChanged":3116,"ĠonExpandingFinished":3117,"LAUNCHER":3118,"ĠUnknown":3119,"FreezingDisplay":3120,"QzoneWebPluginProxy":3121,"cooperation":3122,"ĠcollapseSpeedUpFactor":3123,"ĠflingToHeight":3124,"ĠsetSpeakerphoneOn":3125,"ĠsetWiredDeviceConnectionState":3126,"QzoneWebPluginProxyService":3127}