#version: 0.2 - Trained by `huggingface/tokenizers`
e r
Ġ 1
0 0
Ġ 2
i n
Ġ 0
o r
č Ċ
t i
o n
Ġ D
Ġ s
i t
c e
e c
u n
00 5
t a
1 7
Ġ1 6
0 3
a n
Ġ c
Ġ [
Ġ2 005
ĠD ec
c k
t e
a r
l d
r o
a l
2 7
or k
w ork
work er
o ti
e s
S ta
Ġ2 2
Ġ22 27
Ġ in
h i
Ġ1 7
0 2
n oti
( )
in it
hi ld
noti ce
j k
Ġc hild
e t
a g
i s
o un
oun d
b o
Ġ0 4
o t
Ġ17 02
E n
e n
an ag
anag er
M anager
er r
err or
m o
Ġ worker
En v
Ġworker Env
o w
h t
S un
Ġ P
Ġ0 5
1 5
s e
Ġ o
e d
M on
Sta ck
u s
mo d
l l
Ġ I
f al
fal se
o ck
r e
ar d
or e
Ġs c
Ġ jk
bo ard
ore board
Ġsc oreboard
F ound
l ot
Ġ Found
Ġs lot
p d
Ġ d
t r
er v
p ro
i d
it y
in g
ow er
Ġ 6
u e
Ġ f
1 3
V is
ti v
es s
a s
l e
tr ue
o m
3 8
ock ed
on e
h one
c tiv
l a
Ġ /
u t
ĠP hone
c on
p er
i ce
1 4
t pd
ti es
Ġs ta
worker s
et c
ht tpd
Ġo k
pro per
con f
proper ties
erv ice
S ervice
Manager Service
Ġsta te
Ġ mod
A ctiv
a d
Ġ error
2 0
ti on
t us
B ar
Sta tus
ĠPhone Status
ĠPhoneStatus Bar
i c
m m
1 6
u ll
i g
ec t
n t
ig ht
Activ ity
n ess
Ġ n
2 6
ower ManagerService
4 00
re en
Ġ b
c reen
Ġ -
a te
ro ll
an d
s creen
V al
R ect
ound s
B ounds
Stack Vis
Stack Bounds
Ġd ocked
Ġf ull
Ġfull screen
w a
u mm
in d
ar y
mod e
umm ary
4 7
ĠP owerManagerService
Ġs et
0 1
c om
005 00
400 00500
f f
ro id
and roid
a tion
W ind
g et
Wind ow
i m
Ġ1 8
4 6
Ġ 3
Ġ0 6
la y
Ġ 8
1 0
Ġ 7
3 3
b i
5 5
k e
p lay
p p
Ġ =
is play
e w
Ġ u
as k
I n
Vis i
us er
Ġ Activity
0 4
ĠD isplay
Ġ get
C on
l ity
Ġ re
t roll
Con troll
Controll er
P ower
Ġ V
Ġ m
0 6
Ġ18 20
bi lity
Visi bility
r ight
Ġb right
ĠDisplay Power
Ġbright ness
ĠDisplayPower Controller
s te
y ste
Ġ0 7
pd ate
ĠActivity Manager
yste m
= -
Ġ r
l g
ic ation
1 8
ut o
b le
0 8
it h
U i
Ui Visibility
Ġ1 0
o l
v is
Ġc om
3 9
Ġ e
4 9
s t
1 1
5 9
L ocked
f a
u l
te d
S ystem
System UiVisibility
f ication
al l
fa ce
p le
Ġ A
p ol
en t
ic y
pol icy
3 6
Ġn ew
Ġ1 3
a ble
4 8
l ock
N oti
Noti fication
I d
Ġ vis
O n
s erv
serv er
h o
5 6
5 8
g r
Ġo ld
Ġd i
) ,
ad j
Ġdocked StackVis
Ġdocked StackBounds
Ġfullscreen StackVis
Ġfullscreen StackBounds
wa ke
Ġset SystemUiVisibility
Ġm ask
Ġnew Val
Ġold Val
Ġdi ff
L ight
a uto
f ul
k s
m an
o st
u al
u as
w ks
in pro
it mode
bo ot
bo ost
en able
ad y
wa itmode
com ple
user Id
Ġre ady
gr ess
wake ful
man ual
uas ummary
wks ummary
inpro gress
boot comple
boost inprogress
waitmode enable
wakeful ness
bootcomple ted
Light s
0 7
5 4
5 1
5 2
Ġ2 6
ce nt
1 9
S c
w m
te nt
Ġ 9
Ġset Lights
ĠsetLights On
3 7
a t
Ġ2 0
Ġ W
5 7
Ġc all
B M
H BM
Ġ HBM
u r
u d
5 3
2 1
3 2
5 0
v ent
Ġu pdate
A lg
Ġ R
Ġ Stack
or ith
roll Alg
Sc rollAlg
ĠStack ScrollAlg
orith m
ĠStackScrollAlg orithm
. .
2 2
v er
Ġ2 10
Ġ l
Ġ1 9
2 9
00 0
la p
ver lap
4 4
n im
Ġe vent
a m
l ag
lag s
Ġ ta
ur face
nim at
Ġ210 5
o p
Ġ w
0 5
i pp
ipp ing
4 3
6 9
Ġd o
1 2
0 9
en d
Ġu id
G E
T A
te n
A pp
v e
Ġ2 8
4 1
un n
Ġn ot
p ut
Ġ false
S K
it ing
TA SK
A L
E AL
Ġ ho
Ġo ut
im iting
Ġcall er
ĠR EAL
Ġl imiting
Ġdo es
GE T
unn ing
TASK S
Ġho ld
Ġout put
4 0
ten cent
o c
Ġget T
Ġget R
4 5
S urface
Ġ1 01
2 8
a c
Ġ p
c l
u i
d e
i o
Ġ is
Ġ3 2
ce l
an cel
mo ve
Ġf lags
oc ation
Ġc ancel
Ġ17 6
p end
Ġ T
Ġ t
us pend
es t
3 1
E x
I nt
U pdate
2 5
in tent
Ġf lg
1 000
6 7
ro y
ud io
est roy
3 0
Ġs uspend
2 00
L ocation
Int er
r get
Ġ Window
Sta te
Ġta rget
Ġp id
P ro
T im
s s
ce ss
re move
Ġ101 11
ĠWindow Manager
Tim e
O ut
an s
Ġbrightness In
Ġbrightness Out
Ġr ate
ĠA nimat
ĠAnimat ing
In tent
r ans
33 3
Pro cess
2 3
Window ManagerService
App Process
unning AppProcess
ĠgetR unningAppProcess
ĠgetRunningAppProcess es
P ad
ĠPhone Inter
face Manager
Ġ26 26
ĠPhoneInter faceManager
Ġ Notification
ask s
am e
ĠNotification Manager
" ,
B lock
d ing
Ġ S
Ġo verlap
la tion
op Pad
ĠgetT opPad
rans lation
ĠgetTopPad ding
N o
i ew
.. .
L ock
V iew
e S
Window State
u ld
Ġs ho
Block Location
uld BlockLocation
Ġsho uldBlockLocation
Ġ {
Ġ0 3
Ġevent Time
3 4
m p
q q
Ġ user
/ .
3 5
a ke
x x
remove Window
s i
Ġ }
Ġc mp
Activity No
Ġ3 69
Update Locked
Ġuser ActivityNo
ĠuserActivityNo UpdateLocked
C l
e l
an el
k ipping
Ġw ith
ĠS kipping
" .
2 4
P owerManagerService
W ake
Ġ "
Ġ tr
Ġb lock
ĠA udio
Lock s
Wake Locks
Ġblock er
ĠAudio Manager
D i
H id
O verlap
d estroy
d Hid
q ui
en si
ed Activ
tiv e
mm edActiv
ate dHid
Ġe x
Ġupdate Cl
Ġupdate Di
Ġis Overlap
ĠT ranslation
eS ensi
mmedActiv atedHid
ĠupdateCl ipping
ĠupdateDi mmedActivatedHid
eSensi tive
ĠupdateDimmedActivatedHid eSensitive
w w
Ġ ac
Ġ2 7
mo bi
le qq
mobi leqq
ud ed
cl uded
Ex cluded
Ġwith Excluded
6 01
a ctiv
an g
h ang
Ġb y
t er
00 00
ĠP anel
ĠPanel View
4 2
10 8
ff ff
h as
Ġ 5
Ġ3 26
K e
c h
Ġ (
Ġt o
destroy Surface
Ke y
A nimat
Ġn ame
Ġ28 601
Animat or
= "
hi de
tr as
Ġta g
Ġw s
Ġex tras
7 6
n ull
Ġcancel Notification
WindowState Animator
9 6
e x
p e
Ġ 59
Ġ1 5
A uto
Ġf or
26 19
Auto hide
: -
7 9
Ġ1 2
cl i
8 9
Ġ ke
Ġke y
C hang
f i
Ġ1 1
T asks
e cent
or d
ec ord
Ġin ter
Ġr es
f o
or y
Ġ27 3
a se
8 7
y pe
400 00
a ck
e le
g u
ag e
oun t
Ġr et
Ġcall ed
gu ard
i r
m l
Ġ ...
ff ect
Ġr unning
ĠgetT asks
ac tion
9 1
R ecord
t o
u le
Ġ1 46
ce p
Ġ6 7
6 0
Ġ2 55
activ ity
T o
u m
67 1
9 13
c qui
r ing
as ing
ĠA cqui
ĠR ele
ĠAcqui ring
ĠRele asing
9 9
T ype
b id
d en
l ication
n er
q u
v ar
Ġ2 1
ĠD ir
Ġin de
ht ml
ect ory
Ġr ule
Ġ26 39
ww w
Ġfor bid
cli ent
cep t
ĠDir ectory
Ġinde x
Ġforbid den
1 00
7 8
8 8
a p
u id
00 000
Ġ2 3
In ner
Ġ369 4
Chang ed
p and
Ġ 49
Ġ1 00
it or
f y
i fi
k en
Ġ i
Ġ on
Ġ noti
Ġ Surface
26 18
Ġ8 671
Ġ26 33
Ġac t
Ġ21 13
: [
p l
q t
} ,
Ġn ull
In fo
ĠgetR ecent
Ġ176 30
xx xx
removeWindow Locked
removeWindow Inner
Ġinter cept
ĠgetRecent Tasks
removeWindowInner Locked
Ġintercept Key
D isplay
E ffect
S ound
s ta
ta l
Ġ17 37
as t
58 5
Ġ32 4
activ e
Sound Effect
A m
C K
S creen
l ed
n d
Ġ čĊ
Ġ lock
Ġ1 04
ar m
le ase
Activ e
Ġre lease
qui re
Ġac quire
Am ount
Ġ104 54
1 01
8 6
T ag
n ame
u b
ĠD estroy
Ġs urface
Ġ101 13
ĠDestroy ing
7 7
I N
U p
W ifi
] ,
k g
s ystem
Ġ a
Ġ2 36
Mon itor
re am
20 60
Ġ3 13
Sc an
destroySurface Locked
Key guard
ack age
Display Scan
Wifi DisplayScan
system ui
6 2
6 00
C all
c all
g in
ind ex
Ġ3 27
Ġ7 20
Ġsuspend Autohide
Ġ313 7
6 8
T I
a b
e f
f lags
o ur
p hone
r t
t s
Ġ Keyguard
Ġ1 4
Ġ1 28
un ch
17 02
App lication
Ġ176 32
Update Monitor
Ġ273 57
To ken
our ce
ĠKeyguard UpdateMonitor
P e
S to
e k
ta g
pp ed
end ing
Ġ176 21
Ġ369 3
Pe ek
Sto pped
9 20
= [
W ith
i ble
p kg
ow n
In Call
Ġ26 18
Ġcancel Peek
Ex pand
ĠcancelNotification With
ab led
ĠcancelNotificationWith Tag
3 03
5 08
7 08
R I
o se
o ll
Ġ 55
Ġ SystemUiVisibility
En abled
us ic
UiVisibility Changed
ffff ffff
Ġ273 53
Ġ146 38
ap se
Ġ23 18
fy UiVisibilityChanged
Ġnoti fyUiVisibilityChanged
Ġ128 0
oll apse
2 20
F lags
P la
S ource
h e
l arm
o de
Ġ android
an Up
Ġc le
Ġd own
ue ue
Ġ8 303
18 8
ĠA larm
Notification Visibility
29 0
Surface Pla
Ġ100 91
Application Record
anUp ApplicationRecord
Ġcle anUpApplicationRecord
7 00
A CK
A IN
C ollapse
L J
M AIN
W L
W ork
s Enabled
y SoundEffect
Ġ 58
Ġ qu
er ySoundEffect
ta tion
la unch
26 4
26 26
56 0
44 4
108 0
100 1
RI LJ
Work Source
Ġqu erySoundEffect
ĠquerySoundEffect sEnabled
* ",
6 6
] =
] [
n o
p ad
u gin
} }
Ġc hang
te pad
Ġb nd
Window Token
55 5
Ġre move
18 96
am ple
67 585
=" *
ex ample
Expand ed
no tepad
Ġbnd s
1896 67585
1 21
5 14
9 7
A udio
E vent
o g
Ġ :
Ġ true
Ġ 54
Ġ 50
Ġs t
tr y
as h
Ġ3 7
39 5
ul t
Ġ20 96
53 0
Ġcancel Autohide
Ġ176 22
40000 600
/ /
2 560
2 555
3 17
9 8
9 08
B ef
C om
P op
Q ueue
R e
R ecent
S t
S pl
T q
W X
a u
b ase
c ts
c ode
o ut
p on
p Window
p ackage
s Activity
u pWindow
Ġ ,
Ġ al
Ġ policy
Ġ 57
Ġ2 395
in call
ta cts
27 02
27 39
Ġ17 36
En try
15 54
ll er
re cent
ore Queue
Ġd e
Ġd at
13 8
con tacts
Ġn um
26 91
400 0
lay out
Ġ8 290
st ub
ent Info
op Activity
Ġ28 38
oc us
Ġcancel ed
Ġt opActivity
remove Locked
Ġ369 7
0000 02
0000 700
108 40000
108 00000
Ġkey guard
Ġkey code
fi le
Ġinter active
Ġres ult
to tal
Ġ146 40
pl ugin
qt l
ĠinterceptKey Bef
ĠinterceptKey Tq
sta ller
ending Intent
InCall Activity
188 00000
1080 4000
Ġremove Notification
ash Activity
Com pon
Pop upWindow
Recent sActivity
Spl ashActivity
WX Entry
au se
Ġpolicy Flags
incall ui
recent s
oreQueue ing
Ġkeyguard Active
total Tasks
ĠinterceptKeyBef oreQueueing
Compon entInfo
WXEntry Activity
8 00
C H
L a
O r
S h
T op
T ranslation
Y Translation
c ast
p Top
v io
Ġ C
Ġ M
Ġ U
Ġ 46
Ġ active
ro ad
Ġ22 50
() :-
En d
15 3
us Notification
re vio
Ġf ro
ad e
Ġb road
Ġ18 15
Ġget Location
11 1
36 5
Ġnew YTranslation
48 4
Notification Sh
On Screen
Ġupdate NotificationSh
Ġl ocation
Ġp revio
Ġoverlap Amount
Ġto tal
76 5
cli pTop
Ġ255 6
ĠAlarm Manager
Ġchang e
Ġst op
usNotification End
Ġbroad cast
ĠgetLocation OnScreen
ĠupdateNotificationSh ade
Ġprevio usNotificationEnd
clipTop Amount
' t
6 3
7 5
8 5
9 2
9 3
C hild
M usic
O N
Q s
T h
e ed
l ose
r en
Ġ 4
Ġ us
Ġ layout
un In
Ġc ause
Ġc lose
Ġin it
ĠP endingIntent
re ad
Ġf ind
Ġf ocus
Ġsta rt
20 7
Ġn eed
55 3
Visi ble
ĠDisplay ManagerService
Ġm Expanded
Ġr unIn
49 7
59 8
48 2
Lights Locked
Ġ26 44
Ġupdate LightsLocked
Ġl og
Ġ28 39
Ġis Music
ĠT he
89 9
Chang es
Ġ255 8
101 11
Ġ236 50
ream Type
WifiDisplayScan Locked
WifiDisplayScan Re
NotificationVisibility Changes
ĠcleanUpApplicationRecord Locked
St ream
ĠremoveNotification Child
ĠC an
Ġfro m
Ġstop WifiDisplayScanLocked
Th read
Ġcause d
Ġclose Qs
ĠmExpanded Visible
ĠrunIn Thread
Ġlog NotificationVisibilityChanges
ĠisMusic Active
WifiDisplayScanRe qu
ĠremoveNotificationChild ren
2 33
9 4
M i
O O
V I
a udio
f or
Ġ2 514
Ġ0 9
an im
27 8
per for
Ġ- -
10 41
Ġe uid
52 9
App WindowToken
28 9
Ġ176 33
2619 7
Ġa pp
Audio Mi
audio server
perfor m
AudioMi x
5 47
8 0
8 07
C ount
C TI
P lay
P ackage
S E
S a
V ol
b ar
t View
u ch
Ġ h
Ġ Ġ
Ġ ro
Ġ play
Ġ anim
Ġs ystem
noti fy
is ten
ed Autohide
Ġ6 3
20 8
10 5
Ġ7 111
pp lication
39 8
Ġe ffect
49 9
58 3
07 0
09 1
App Stopped
ve Surface
ac t
ĠT ex
Ġt reamType
uspend edAutohide
eS uspendedAutohide
destroy Or
Ġex pand
Ġ27 365
Ġ27 94
76 1
2619 8
Ġres um
Ġ255 5
activity Stopped
To uch
um e
Ġnoti fication
220 1
Stream Vol
Play er
Sa veSurface
Ġplay SoundEffect
notify AppStopped
Ġeffect Type
ĠTex tView
destroyOr SaveSurface
Ġresum eSuspendedAutohide
StreamVol ume
3 52
5 17
7 69
A ud
C e
D e
L ast
T E
c er
m ent
v ice
Ġ g
Ġ 38
00 8
in fo
ce ment
005 08
es ted
Ġin sta
nt Collapse
and le
01 0
01 1
Window SurfacePla
ĠActivity Record
Ġget Last
49 8
59 9
Ġcall ing
Ġ210 7
Ġ28 08
Ġac tion
ible StreamVolume
SurfacePla cement
800 00508
perform SurfacePlacement
Aud ibleStreamVolume
Ce ll
Ġinsta ntCollapse
WindowSurfacePla cer
ĠgetLast AudibleStreamVolume
0 57
1 207
4 09
5 02
5 18
6 4
7 46
8 4
E W
P anel
T Y
i on
t on
v ed
y er
z one
Ġ <
Ġ 48
Ġ2 08
Ġs e
ce i
005 7
15 0
15 4
Ġ6 4
Ġ6 6
ut ton
Ġb e
ate Collapse
46 9
lay ed
Ġ8 68
Ġ8 289
10 6
55 0
58 482
22 4
29 1
69 4
Ġ28 09
Ġ32 3
67 0
No te
Ġfor ce
79 0
call ing
Ġ37 14
Ġal arm
Ġde layed
La yer
Ġanim ateCollapse
Cell Info
1207 58482
Panel s
Ġ868 2
ĠanimateCollapse Panels
2 02
2 37
2 41
3 18
3 07
5 46
5 07
: //
C ho
H e
Q Q
S U
S ub
T en
a v
a pplication
b us
c hi
e m
g is
h ed
i en
m e
m usic
r ec
s h
s et
u la
v nd
y p
Ġ 56
Ġ 53
Ġ end
Ġ1 56
00 1
00 3
in ess
in staller
or age
ti me
ta rt
te l
ar chi
27 0
Ġ6 03
ess age
20 4
16 1
400 0000
47 6
46 0
Ġ3 08
10 7
In staller
04 5
06 6
08 0
08 000
39 2
st orage
lock screen
56 4
58 9
Ġ26 43
19 0
at ter
57 7
29 9
Ġw h
Ġ32 58
Ġt ype
Ġt yp
Lock Screen
qq music
xx x
108 08000
Ġres tart
87 2
99 2
99 4
ap k
Ġ100 27
xxxx xxxx
77 4
Ġ236 89
ose Sub
package installer
CH OO
Ġbroadcast Intent
ĠPendingIntent Record
VI EW
Package Installer
cei ved
Ġbe gin
:// /
Cho oseSub
QQ file
SU B
Ten cent
bus iness
em ula
gis ter
ien tation
rec v
archi ve
atter y
LockScreen Activity
xxxxxxxx xxx
CHOO SE
PackageInstaller Activity
ChooseSub Activity
emula ted
* *
0 46
1 0057
2 50
3 38
3 46
3 11
4 59
5 27
5 16
5 39
6 1
6 03
6 09
8 3
8 20
8 11
9 0
9 32
A CTI
B attery
E d
M E
M essage
P id
S ess
a k
b ack
i z
l u
m Screen
m InCall
m WifiDisplayScanRequ
o s
q zone
t ing
t ur
x c
Ġ >
Ġ x
Ġ y
Ġ id
Ġ qui
er ts
00 6
03 0
Ġc lock
ar ch
is able
Ġo ff
Ġo ver
Ġd isable
13 6
om e
16 2
16 4
ig ation
Ġn av
26 1
Ġb ack
47 5
Ġ3 67
Ġ= =
Ġre cent
Ġm WifiDisplayScanRequ
06 1
06 5
Ġr ecord
18 2
18 3
08 4
vis ible
59 0
59 5
56 8
56 9
07 7
54 2
52 8
Ġ26 42
19 8
37 4
22 8
29 4
29 5
29 7
44 1
69 1
Ġ32 55
est Count
Ġ5 02
Ġto ken
destroySurface s
ĠcancelNotification Locked
Ġres et
99 5
78 3
Ġ23 469
Ġon NotificationVisibility
2618 7
led Notification
TI CK
}} },
Ġal erts
ĠU I
Ġh ome
Ġro tation
isten er
Touch Event
Ġnotification Light
Ġse arch
Note Ed
calling Pid
set ting
Ġ308 52
Sess ion
iz e
mScreen On
mWifiDisplayScanRequ ested
tur n
Ġqui ck
igation bar
Ġnav igationbar
ĠmWifiDisplayScanRequ estCount
ĠonNotificationVisibility Changed
NoteEd itor
setting s
0 56
1 02
2 13
2 49
2 48
2 40
3 06
3 57
3 05
4 32
4 50
4 29
4 05
6 08
6 59
6 35
7 0
7 07
7 09
8 18
8 19
8 50
8 0000
9 5
9 26
9 37
9 42
F or
N e
N ew
S pe
T rans
U I
W ir
X ml
b or
b lity
g e
h on
h andle
h bor
i l
i ck
l istener
p hon
s De
y Manager
Ġ or
er UI
Ġ1 33
Ġ1 39
00 2
Ġ2 18
ti ck
Ġs ending
ta il
17 0
17 8
03 8
27 7
02 8
re pe
erv al
ing CellInfo
13 9
13 46
13 93
38 2
38 6
14 6
14 8
14 9
20 9
16 6
ig hbor
Activity Stack
Activity ManagerService
26 2
Val ue
47 9
get Value
46 6
Ġ3 66
33 9
pp WindowToken
Visi blity
04 807
Ġget Ne
Ġm Visiblity
06 2
06 4
18 9
11 9
ĠA ppWindowToken
36 8
Ġ13 09
48 5
48 69
Ġvis ible
58 7
07 6
07 9
52 5
at Int
at ch
ĠW ifi
29 6
44 3
am s
am ap
69 8
ĠgetR ing
Ġ32 59
Ġ32 57
ĠT ele
24 2
0000 008
Ġ5 03
2619 913
40000 000
78 1
Ġ236 85
unch erUI
97 4
La uncherUI
80 583
activityStopped Locked
769 0
vice Id
Ġ38 07
He ad
4000000 8
Ġwh en
80000 608
New sDe
Trans act
Wir ed
Xml Activity
listener Tag
phon yManager
tail XmlActivity
repe atInt
1346 80583
ighbor ingCellInfo
Ġ366 4
ĠgetNe ighboringCellInfo
ĠTele phonyManager
NewsDe tailXmlActivity
repeatInt erval
) ],
1 15
1 22
2 16
3 00
3 54
4 14
4 10
4 36
4 58
4 51
4 19
4 28
5 38
6 5
6 14
6 19
6 69
6 40
7 19
7 57
7 43
7 35
8 46
8 39
8 59
8 53
8 96
8 79
9 38
9 16
9 55
9 39
9 36
9 44
9 31
9 67
9 79
A N
A T
A nim
B utton
B AT
D a
F IN
M ode
P E
R O
R T
R Y
R o
R unn
S ize
T OO
a x
a Player
e o
e ta
i aPlayer
l ocked
m is
n al
o in
o ing
q ueue
s Up
t h
v id
x y
Ġ hi
Ġ en
Ġ ed
Ġ per
Ġ has
Ġ hide
Ġ he
Ġ1 22
Ġ1 208
00 4
Ġ2 27
in Layer
on Event
on Transact
Ġs ource
ce Changed
ec u
ta ch
17 1
17 3
17 5
03 1
03 9
Ġc ro
oti onEvent
Ġin fo
Ġin Ro
02 2
02 5
ed iaPlayer
Ġsc reen
Ġsc hed
Ġd isplay
id th
Ġ6 0
Ġ6 04
38 7
38 8
38 9
14 1
14 3
14 4
14 7
20 1
tus bar
Ġb utton
Ġb locked
47 1
01 8
46 7
10 4
33 2
55 2
55 4
play er
In visible
ĠActivity ManagerService
ĠActivity Info
04 9
Ġre ceived
Ġre gister
Ġm anager
Ġm Block
Ġm ake
Ġm Head
Ġm ax
Ġm eta
Ġm inLayer
18 0
18 5
18 7
ol Type
st ory
ul ing
ĠA CTI
36 0
36 6
48 3
48 8
48 9
Notification Inter
56 6
58 6
07 1
52 4
19 2
19 6
37 5
37 9
at tach
57 1
22 3
22 5
Ġ19 609
Ġw idth
43 5
69 6
09 0
09 9
GE D
GE R
TA RT
28 1
Ġp kg
Ġp oin
ĠT ak
Ex cep
Ex isten
Inter cept
Pro xy
23 5
ĠS TART
si on
Ġ} ,
ter Count
Ġ326 7
Ġto olType
76 3
76 6
79 1
79 4
100 2
88 2
Ġ23 484
Ġ100 20
Ġon Notification
Ġon Expand
Ġon Intercept
2618 516
sta tusbar
101 13
101 12
86 6
Ġdown Time
}} }
Expanded Invisible
Ġde viceId
CH AN
ĠM otionEvent
ĠM ediaPlayer
233 2
VI TY
Ġh andle
Ġro t
Touch es
Player Activity
De vice
TE RY
Ġg oing
Ġ38 48
Ġaction Button
409 7
TY PE
sh ot
ACTI ON
lu g
ge Flags
Ġor ientation
Ġ1309 4
2619913 04
Anim ation
BAT TERY
Da ta
FIN GER
Runn able
TOO L
mis sion
queue NotificationInter
sUp Existen
vid eo
Ġhi story
Ġen queueNotificationInter
Ġed geFlags
Ġper mission
Ġhe ight
Ġ122 36
Ġ227 75
ceChanged Runnable
Ġcro p
ĠinRo tation
Ġscreen shot
Ġsched ule
Ġbutton State
ĠmBlock Touches
Ġmake ExpandedInvisible
ĠmHead sUpExisten
Ġmax Layer
Ġmeta State
attach Application
Ġpoin terCount
ĠTak ing
Excep tion
ĠonExpand ing
ĠonIntercept TouchEvent
2618516 46
CHAN GED
Ġhistory Size
ĠenqueueNotificationInter nal
ĠmHeadsUpExisten ceChangedRunnable
) ;
0 47
0 50
1 26
2 15
2 46
2 11
2 59
2 36
2 32
2 44
2 45
2 108
2 1080
3 27
3 04
3 59
3 19
3 21
3 12
3 41
3 45
4 03
4 02
4 08
4 25
5 49
5 36
6 02
6 16
6 52
6 22
6 41
6 25
6 30
6 89
6 87
7 18
7 36
7 56
7 29
7 45
7 78
8 1
8 2
8 02
8 16
8 08
8 56
8 21
8 09
8 40
8 30
8 34
8 670
9 03
9 27
9 50
9 40
9 45
9 28
9 88
A t
A ll
A nd
B ind
C ON
D ef
E D
F O
H and
I ME
L A
L O
L o
L w
M et
R un
S TE
T ick
Y STE
a f
a ti
d is
e ceived
g er
g ing
g ory
h ar
i ent
l er
m s
n tent
p atch
p ati
r ic
r ted
s Locked
u ti
Ġ .
Ġ E
Ġ un
Ġ **
er Mode
Ġ1 27
Ġ1 47
00 7
in is
or ient
Ġs ervice
17 2
17 499
03 2
Ġc on
27 2
Sta rt
Sta rted
hi ch
02 6
et ric
err ed
15 5
Ġo f
ed uling
us h
us t
ĠI CON
ĠI ntent
re gister
ing Display
Ġ6 1
13 0
con s
14 0
20 5
16 5
ig ger
Ġn on
26 6
ate gory
roid Run
46 2
46 5
Ġ3 68
Ġ3 066
33 6
In put
04 3
Ġget All
Ġre qu
Power ed
Ġm etric
06 9
18 1
18 6
08 7
Ġcom pati
39 6
39 9
49 6
59 3
59 4
59 7
ĠA pplication
36 1
36 4
36 7
48 0
48 1
48 7
ho d
56 1
56 5
58 2
54 1
51 2
52 1
19 1
57 3
57 8
Ġcall back
53 1
53 5
32 4
32 5
32 8
50 5
50 9
ĠR eceived
Ġ210 6
Ġl ast
44 2
Ġw hich
43 4
69 3
12 4
TA TI
ve l
28 0
28 2
ĠT IME
67 5
67 6
67 8
Time Update
Time Tick
ĠS YSTE
34 2
Ġtr igger
Ġex ecu
ch eduling
76 4
76 8
96 3
96 00
79 2
79 3
79 7
Ġ12 025
89 7
89 8
Ġres cheduling
87 1
87 3
40000 208
99 3
Ġ21 21
78 4
88 3
88 8
Ġi cons
CK ED
77 0
77 2
IN FO
Call back
TI ME
66 1
Ġchang ed
97 1
97 3
Ġ50 926
Ġ57 69
Ġ57 84
Or ientation
ĠM ust
ĠU n
ĠU SE
92 31
Ġg ot
Ġcalling Package
performSurfacePlacement Inner
performSurfacePlacement Lo
sh ow
time Exception
Battery L
Ġrotation For
Spe ed
handle Message
ĠWifi Controller
ĠgetRing erMode
RO TATI
Ġregister Callback
Ġhandle TimeUpdate
Ġschedule TimeTick
2108 5
At Time
And roidRun
Bind er
Def erred
Hand ler
LO CKED
Met hod
dis patch
har ging
uti l
Ġun register
Ġ** *
17499 23
ĠICON S
Input Method
ĠgetAll CellInfo
Ġrequ ested
Ġmetric s
Ġcompati ble
ĠSYSTE M
Ġtrigger AtTime
Ġexecu te
Orientation Lw
ĠUSE R
performSurfacePlacementLo op
ĠrotationFor OrientationLw
ROTATI ON
ĠscheduleTimeTick Event
AndroidRun timeException
dispatch Message
) }
0 16
0 55
0 59
0 54
1 03
1 27
1 13
1 29
2 14
2 10
2 54
2 52
2 53
2 4000000
2 198
3 13
3 20
3 26
3 10
3 08
3 49
3 51
3 40
4 17
4 27
4 13
4 26
4 18
4 39
4 49
4 48
4 52
5 03
5 20
5 26
5 33
5 06
5 37
6 27
6 13
6 38
6 26
6 33
6 55
6 06
6 49
6 54
6 53
6 12
6 31
6 67
6 42
6 60
6 88
7 1
7 2
7 4
7 17
7 13
7 38
7 47
7 01
7 33
7 51
7 21
7 44
7 12
7 34
7 24
7 79
8 15
8 14
8 47
8 10
8 06
8 58
8 32
8 44
8 43
8 69
8 28
8 31
8 89
8 87
9 00
9 02
9 14
9 57
9 21
9 43
9 69
9 12
9 41
9 89
9 78
9 86
: :
A c
A TE
B ec
B lu
D O
D estroy
E N
E R
F al
F re
F ocus
F act
F inis
I s
I Window
M gr
N CH
O f
O p
P l
P hone
P RI
P endingIntent
P lug
Q zone
S im
T r
U P
U id
U NCH
V ATE
W N
W e
] }
a in
b r
b atch
b Pl
c o
c ancel
c hang
c ount
c ategory
d f
d Notification
e z
f Mgr
g ed
h ec
h Battery
i br
k n
k ing
l y
l ing
l og
n ec
o ot
o per
p r
p ans
p ush
r es
s ing
s For
t t
t y
t ec
t one
t push
v iew
v ibr
Ġ as
Ġ ad
Ġ Lock
Ġ tick
Ġ Start
Ġ vel
Ġ vibr
er phone
Ġ1 000
Ġ1 41
Ġ1 0057
00 9
Ġ2 4
Ġ2 16
Ġ2 11
Ġ2 58
Ġ2 07
Ġ2 57
Ġ2 153
Ġ0 1
ĠD e
Ġs ound
Ġs ub
Ġs ize
17 9
17 346
03 6
Ġc ol
Ġc at
Ġc ollapse
Ġc hec
te ll
ar king
ro cess
27 1
27 5
27 9
02 0
02 333
et oot
bo tt
mo te
ĠP rocess
15 1
15 8
15 56
15 22
15 564
re as
re layout
re mote
pro tec
Ġf ling
13 2
13 5
38 0
38 5
14 2
14 99
Ġsta ck
20 6
tion State
tion sLocked
16 3
16 8
16 9
26 0
26 5
Ġb ounds
47 0
47 2
Ġset Spe
Ġset Wired
01 9
ation Type
get Key
Window Animator
46 4
46 8
33 0
33 4
33 10
55 1
55 7
04 2
04 04
04 89
Ġget Device
Ġget Data
Con nec
Ġre batch
06 0
06 3
18 4
08 5
08 9
39 1
39 7
Ġe mp
59 6
fa ul
36 2
Ġ13 003
48 6
Notification Locked
56 2
56 3
07 5
07 8
07 98
54 0
52 44
19 3
19 5
19 7
19 106
tent View
37 0
37 1
37 2
57 2
57 9
57 0404
21 000
32 2
ĠR ef
22 2
22 27
29 3
29 8
29 192
44 0
44 5
69 5
12 3
09 3
09 5
09 6
Ġ101 12
28 4
28 5
28 7
28 601
Ġp lug
Ġis BatteryL
Ġis Blu
Ġ32 47
Ġ176 5
Ġt he
Ex pans
Int fMgr
cess ory
Pad Activity
ĠS ending
Cl ick
0000 00
0000 0000
Ġ5 49
76 2
96 4
2619 86
2619 507
79 5
79 9
Ġ12 278
89 4
89 5
Ġres id
87 4
87 5
87 7
87 8
40000 108
ack ing
Ġ67 33
Ġ67 51
Ġ67 50
Ġ67 41
Ġ67 40
Ġ67 25
To He
100 20
100 37
78 5
78 6
88 4
88 5
Ġon TouchEvent
Ġon Tr
2618 499
101 1
86 1
86 3
86 1522
77 1
Up Fact
Keyguard Monitor
ugin Proxy
}} )
121 161
Audio Event
Audio Focus
Ġ50 92
Ġst reamType
98 0
St ub
Ġde faul
ause Of
ĠM arking
63 09
Ġstart Animation
233 570404
26197 2
26197 33
26197 32
Ġapp ly
perform Deferred
Ġanim ationType
091 223
Ġexpand Bec
26198 87
Ġg t
ion Changed
Ġse en
Note PadActivity
calling Uid
237 091223
Ġwh at
603 735
ACTI VITY
ak erphone
102 00000
handle AudioEvent
166 121161
ĠWifi Service
ĠgetRing tone
Wired Ac
ĠACTI ON
ĠACTI VITY
ĠonNotification Expans
ĠonNotification Click
Device Connec
ĠonExpanding Started
ĠonExpanding Finis
LA UNCH
Ġcon tentView
Ġ50926 2332
ĠUn kn
Speed UpFact
Binder Proxy
2198 29192
779 03
DO WN
Fal sing
Fre ez
Is Powered
IWindow Session
Op tionsLocked
Phone IntfMgr
PRI VATE
Plug Type
Qzone We
bPl uginProxy
co oper
cancel NotificationLocked
chang e
ged Type
hBattery Info
log ic
pr i
res hBatteryInfo
sFor Stream
Ġad dNotification
Ġvibr ate
Ġsub Id
17346 6309
Ġcol or
Ġcollapse SpeedUpFact
Ġchec k
etoot h
bott om
1556 52
15564 5244
reas on
protec ted
Ġfling ToHe
1499 77903
ĠsetSpe akerphone
ĠsetWired DeviceConnec
0489 0
ĠgetDevice sForStream
ĠgetData Enabled
Ġrebatch ing
Ġemp ty
19106 3310
ĠRef reshBatteryInfo
Ġplug gedType
ĠisBatteryL ow
ĠisBlu etooth
cessory Manager
ĠonTr acking
861522 50
Ġ5092 02333
Ġdefaul ts
auseOf Falsing
Ġapply OptionsLocked
performDeferred Destroy
ĠexpandBec auseOfFalsing
603735 18
ĠgetRingtone Player
WiredAc cessoryManager
ĠonNotificationExpans ionChanged
ĠonExpandingFinis hed
LAUNCH ER
ĠUnkn own
Freez ingDisplay
QzoneWe bPluginProxy
cooper ation
ĠcollapseSpeedUpFact or
ĠflingToHe ight
ĠsetSpeakerphone On
ĠsetWiredDeviceConnec tionState
QzoneWebPluginProxy Service
