#version: 0.2 - Trained by `huggingface/tokenizers`
o r
0 0
1 8
e r
a p
1 0
e d
c h
e n
a t
2 0
r a
h a
m s
ms ra
1 5
Ġ [
a s
o o
d oo
ha doo
hadoo p
or g
a ch
Ġ 18
ap ach
apach e
Ġ org
c at
20 15
cat or
00 0
m p
4 1
e w
s a
e t
4 4
o n
l l
Ġ A
I N
e s
Ġ s
e as
R M
9 000
eas e
en ew
ll o
RM C
llo cator
i n
en t
t e
Ġ IN
l i
mp t
Ġ t
te mpt
e c
Ġ W
ed u
Ġ msra
1 44
1 7
u n
F O
ĠIN FO
3 7
t a
m ap
2 2
L ease
R enew
Lease Renew
LeaseRenew er
map r
li ent
c e
C lient
i s
o m
edu ce
et r
r es
Ġ f
as k
Ġ r
A R
AR N
ĠW ARN
om m
T ask
res s
etr y
i cator
ĠA llocator
RMC omm
un icator
RMComm unicator
Ġf or
A t
At tempt
mp l
0 3
Task Attempt
on ta
in er
onta iner
Ġ R
ap p
mapr educe
b i
msra bi
. .
i p
ip c
1 9
4 2
O N
ec t
Ġt o
l d
37 22
5 144
144 5144
42 3722
1445144 423722
00 20
v er
Ġ N
a n
17 3
er ver
19 0
g e
Ġ O
d d
17 0
Ġ d
ĠA dd
Ġd et
Ġ ch
ect ed
ĠN ew
an ge
ĠO ld
ĠAdd ress
Ġdet ected
Ġch ange
r m
RMC ontainer
Ġr etry
d l
5 5
Ġ 0
dl er
A llocator
RMContainer Allocator
ha n
l e
m e
Ġ han
Ġhan dler
I mpl
Ġ is
8 03
803 0
r o
Ġ S
00 000
in g
E D
at tempt
Ġ attempt
i l
6 4
Ġ c
7 0
or t
o f
0 4
er Impl
Ġ 6
Ġ F
ED U
P ro
is t
a il
0 6
Ġ TaskAttempt
Ġ on
l ease
ail ed
d f
h df
hdf s
Ġ6 22
on d
C E
D F
DF S
55 6
DFS Client
8 64
P R
i ll
Ġs ec
Ġ622 70
Ġ E
Ġs h
ond s
A PR
M APR
N ON
l y
Ġ ..
Ġ lease
15 37
ĠW ill
Ġr enew
ort ly
ĠF ailed
EDU CE
864 556
Ġsec onds
Ġsh ortly
MAPR EDUCE
NON MAPREDUCE
Ġ.. .
1537 864556
Ġ :
I P
ĠS erver
IP C
mapr ed
L ist
en erImpl
TaskAttempt List
TaskAttemptList enerImpl
C ON
e a
Ġ Pro
ea d
O R
i me
0 9
R R
e p
ĠE RR
ĠERR OR
a x
Ġ of
le ep
0 1
ĠR etry
i t
g ress
ĠPro gress
Ġ 1
l o
0 2
r t
0 8
ta rt
2 7
0 7
lo w
u l
ch er
v ent
Ġ M
Ġ p
ch edu
ap s
C o
M aps
ed Maps
IN G
T A
it h
a l
o b
mpl et
T o
e vent
or y
CON TA
ul at
L I
n o
I L
Ġ CONTA
r ead
Ġt h
etr i
Ġt ime
a r
Ġ event
u m
m ax
m ory
Ġ v
me mory
Ġc on
3 9
C or
n ect
Ġs erver
Ġv Cor
ĠvCor es
) ;
1 000
C T
D is
F i
S E
T ime
U p
W ith
i m
p at
r i
Ġ Ċ
Ġ RM
mplet edMaps
ĠCONTA CT
Dis pat
ĠCONTACT ING
Dispat cher
D S
M ax
R etri
S leep
c y
l read
o li
t With
x ed
ĠA lread
Ġs leep
Ġt ri
un tWith
CON DS
ĠRetry ing
ĠRetry Up
ĠM IL
Ġp oli
Co untWith
To Max
LI SE
um CountWith
max Retri
Ġcon nect
Fi xed
im umCountWith
ĠAlread y
Ġsleep Time
Ġtri ed
ĠRetryUp ToMax
ĠMIL LISE
Ġpoli cy
maxRetri es
Fixed Sleep
imumCountWith FixedSleep
ĠRetryUpToMax imumCountWithFixedSleep
ĠMILLISE CONDS
j ob
Ġ h
C ontainer
n c
: -
= <
A s
y nc
Ġ no
As ync
Async Dispatcher
Ġ m
3 6
00 00
a un
Ġs tart
ĠR ec
Ġc o
2 8
h o
Ġno t
res ho
ulat ing
resho ld
c k
c ulating
r oo
Ġs low
Ġs chedu
ĠR educe
ead roo
al culating
Ġth reshold
Ġh eadroo
ĠRec alculating
Ġschedu le
Ġheadroo m
F or
R educe
S low
s tart
mpletedMaps For
Ġm et
Ġco mpletedMapsFor
Reduce Slow
ĠcompletedMapsFor ReduceSlow
ĠcompletedMapsForReduceSlow start
0 5
2 3
5 1
5 6
5 3
i on
4 6
i mpl
2 6
4 7
L aun
2 9
o l
Container Laun
5 7
2 4
5 4
6 8
u t
00000 2
1 4
r om
Ġf rom
00000 1
5 0
ar n
y arn
es ol
Ġc ontainer
3 3
1 6
i c
Ġ #
Ġ T
3 8
5 8
n s
Ġt ask
R ed
Red s
2 1
R A
c or
c om
f ar
m ic
s of
ra ns
eas t
ro sof
it ion
ĠT rans
cor p
far east
mic rosof
ition ed
ĠTrans itioned
microsof t
e f
00000 3
Ġ 3
2 5
0000 00
a ck
s t
TaskAttempt Impl
ul t
U N
a ult
ef ault
o u
t er
1 1
a in
c es
m ain
4 9
S I
ĠS chedu
ĠSchedu l
9 8
5 2
o c
ed Reds
ContainerLaun cher
S A
S RA
1 3
i g
4 8
o st
s ig
Ġ /
sig n
3 4
6 6
G N
S SI
s sign
ĠA ssign
GN ED
SSI GNED
ĠM SRA
6 3
H ost
l aun
v ed
Ġ 2
ut il
ces s
6 9
7 7
R esol
R ack
d efault
ra ck
ĠR esol
Resol ver
Rack Resolver
ĠResol ved
1 2
3 1
4 3
7 9
Ġ C
laun cher
R e
p ec
ch erImpl
ContainerLaun cherImpl
3 2
4 0
5 9
8 8
Ġ j
10 8
00000 5
4 5
L oc
00000 4
01 2
ĠC on
Loc al
Ġ Co
00000 6
pec ulat
ĠCon t
3 5
A N
E vent
Ġ 9
00000 7
3 0
C H
00000 9
x y
Ġ 20
00000 8
ou te
Ġ 8
Ġ 10
20 3
an a
Ġ1 3
5 37
M ana
Ġ Task
Ġ job
ou r
18 9
23 8
5 36
E W
T E
g er
t p
t tp
ĠN EW
54 5
88 5
1 39
5 28
N ING
S erver
T y
p e
Ġ a
Ġ w
omm it
ĠR UN
64 9
Ġp ort
Ty pe
ĠRUN NING
6 01
A SSIGNED
q u
Ġ J
Ġ b
Ġ g
Ġ UN
Task Impl
Ġ1 4
Container s
Container Mana
51 1
46 2
ĠUN ASSIGNED
2 39
9 16
L E
l as
Ġ I
Ġ 27
Ġ Host
ĠPro cess
las s
5 04
7 6
J ob
p t
u r
x ce
Ġ ask
18 8
10 7
es t
Ġth e
68 1
Ġw ith
qu est
pt ion
xce ption
L ED
p p
Ġ 5
ĠS CH
EDU LED
36 3
26 7
47 2
ĠSCH EDULED
0 44
5 70
M P
V M
o ck
v m
ĠA SSIGNED
Ġc lass
09 2
Ġ1 2
ut h
Re quest
Ġj vm
ĠJ VM
ĠI D
ock et
D efault
E R
F N
N o
S peculat
Ġ P
Ġ 19
Ġ 29
IN T
IN ER
IN INT
42 5
42 9
39 3
46 1
14 0
ĠSchedul ing
AN LI
FN ANLI
C ommit
M as
R oute
d ing
Ġ 4
en ding
Ġr e
ist ory
ĠE vent
To Host
56 9
No Route
Speculat or
Commit ter
Mas ter
NoRoute ToHost
2 55
8 69
9 63
A llo
c lient
Ġ 22
10 9
15 6
ĠR ack
19 21
RMContainer Request
ĠM ININT
Ġp ro
mplet edReds
RA pp
ĠSchedul edMaps
ĠSchedul edReds
ĠAssign edMaps
ĠAssign edReds
Re l
ĠCo mpletedMaps
ĠCo mpletedReds
ĠCont Allo
ĠCont Rel
ĠHost Local
ĠP ending
ĠRack Local
RMContainerRequest or
RApp Master
ĠContAllo c
ĠPending Reds
H an
I d
R es
U P
t oc
Ġ k
Ġ n
Ġ app
27 77
33 4
our ce
ĠProcess ing
Default Speculator
ĠEvent Type
toc ol
2 19
L o
m ent
u e
Ġ (
ap i
10 68
10 66
cat ion
li cation
ĠR ead
ĠN o
ge ment
Pro xy
Pro tocol
Lo g
5 27
M RAppMaster
R E
a v
m it
s peculat
u s
Ġ 28
Ġ 23
in is
02 9
27 8
no w
46 3
Ġj av
ContainerMana gement
Committer Event
Ġapp lication
ĠRead er
Protocol Proxy
speculat e
inis h
Ġjav a
ContainerManagement ProtocolProxy
1 37
1 27
: /
C LE
E xception
M O
g ing
p en
Ġ 17
li mit
ĠO pen
04 5
ĠCONTA INER
Ġtask Attempt
79 4
AN UP
Ġpro xy
Ġn ew
RE MO
now n
CLE ANUP
ĠOpen ing
REMO TE
( )
5 44
6 17
7 29
M s
N Ms
S ocket
f ter
h read
n et
s ta
u c
Ġ B
Ġ 15
Ġ res
18 3
10 24
ed Containers
ch ing
et Res
ĠA fter
Ġf inish
19 2
19 9
42 4
ĠF A
Ġ1 6
56 2
68 0
our ces
Ġg etRes
Ġre lease
NoRouteToHost Exception
Han dler
Ġk nown
ource limit
Ġnew Containers
sta ging
Ġres ourcelimit
Ġfinish edContainers
ĠgetRes ources
Ġknown NMs
1 183
6 33
7 28
7 109
H ttp
c ontainer
f f
f ul
i v
o t
u ff
Ġ us
or e
Ġs uc
37 55
ĠN M
it y
51 2
68 57
38 137
98 0
cess ful
Ġb y
Log ger
:/ /
uff le
3755 1183
38137 424
6 02
7 21
8 9
8 41
8 23
8 24
9 9
9 39
A UN
G ot
L AUN
S T
T TE
T hread
a uth
b l
e b
e g
h uffle
i le
n ed
Ġ e
Ġ in
Ġ 26
Ġ Laun
Ġ ContainerMana
Ġ Got
10 63
cat ed
et ur
ĠA uth
ĠA TTE
llo cated
ec ur
22 2
Ġf ailed
Ġr etur
AR T
ĠR eg
ĠS huffle
ĠS ecur
ist er
36 6
56 64
29 8
Ġcontainer s
Ġcontainer Id
SI MP
66 7
ĠAssign ed
Ġ13 562
Ġa llocated
Ġg iv
76 0
Ġask ed
MP T
ĠFA IL
Ġus ing
Ġsuc cessful
ity Logger
LAUN CH
ST ART
ĠLaun ching
ĠContainerMana ger
1063 5664
ĠATTE MPT
Ġretur ned
ĠReg ister
ĠSecur ityLogger
SIMP LE
Ġgiv en
1 36
3 14
4 55
7 55
8 77
8 794
9 55
h istory
k en
o ut
Ġ 21
00 6
15 8794
44 7
22 1
19 158794
lo ck
27 69
job history
47 9
24 8
98 7
255 3
1921 2553
ĠRegister ing
2769 6857
2 37
4 08
5 10
5 46
6 006
7 1
8 6
8 55
9 66
H istory
c s
d e
h ttp
p ut
t r
Ġ map
Ġ 33
20 5
15 23
li st
Ġf ile
173 63
il ter
04 37
06 1
Ġ1 1
etri cs
36 24
28 6
25 25
79 2
Job Impl
363 199
363 17363
1921 1523
2777 6006
2777 2525
1066 0437
Http Server
3624 012
363199 77
0 41
1 23
2 17
5 00
5 64
6 22
8 7
9 012
M SRA
c ommit
y s
Ġ D
or m
at a
15 5
Ġs e
144 49
37 43
ĠR es
lo g
27 31
Ġh ttp
36 9012
47 527
47 369012
54 8
13 47369012
34 5
Event Type
Ġb lock
ĠProcess or
Job History
107 3743
1066 108
ĠB P
721 47527
bl k
Ġe xception
14449 72147527
1073743 512
/ .
1 24
3 02
5 06
7 13
Q ue
S K
a y
b ay
f orm
h er
i a
i k
i ce
m ort
r r
t mp
u rt
w eb
w ik
Ġ -
Ġ 7
Ġ list
00 2
at ion
20 8
Ġs ocket
te m
Ġf urt
Ġr oute
03 4
ĠR oute
Ġdet ail
55 3
70 5
ĠF or
06 5
Ġ622 6
ĠE rr
ea m
09 1
01 3
TA SK
CONTA INER
Ġtime out
Ġh ost
Ġm ore
36 8
36 38
28 345
51 3
26 6
47 3
29 7
68 5
33 0
16 9
58 5
98 1
52 368
CommitterEvent Handler
Ġin form
tr eam
ys tem
Ġse e
Que ue
mort bay
wik i
Ġfurt her
Ġdetail s
ĠErr or
Ġinform ation
1 14
3 03
5 472
6 11
7 98
8 02
8 136
9 49
C CE
D ata
S tream
U CCE
g no
i z
u p
v ice
Ġ 24
er vice
20 2
Ġr ep
ĠAdd ed
ĠS UCCE
06 3
06 7
09 6
0000 10
0000 11
26 8
29 5472
14 5
ic s
ef ore
st ics
Event Handler
1068 8136
ĠB efore
Ġmap s
500 10
ĠD ia
ĠRes p
gno stics
Ġrep ort
10688136 5
ĠDia gnostics
1 19
2 00
2 16
3 64
5 09
6 18
6 54
6 50
6 199
7 8
7 19
7 66
8 06
8 27
8 56
9 00
9 19
9 51
9 57
9 71
D N
I Q
U s
a ll
b er
h ist
i es
j hist
m etrics
p ro
t y
Ġ K
Ġ at
Ġ IPC
Ġ Container
Ġ 25
en er
44 6
44 9
Ġs ystem
Ġr edu
03 5
19 266
Ġto ken
dl ing
55 2
Pro cess
06 0
ond er
09 3
08 1
07 6
To ken
event Han
39 1
36 1
Ġstart ing
Ġco mplet
53 237
47 705
29 1
ut put
14 3
98 4
98 6
69 6
79 5
Event Dispatcher
Mana ger
192 47705
JobHistory EventHandler
web app
Ġlist ener
Ġ6226 0
3638 802
Stream er
ĠResp onder
6199 081
all Queue
19266 446
dling Thread
Process or
eventHan dlingThread
53237 19
3638802 8
1 41
1 21
2 50
3 41
3 22
3 29
3 58
3 13
4 41
5 17
5 02
6 5
6 7
6 68
6 25
7 5
7 54
7 33
8 09
8 26
8 58
8 76
9 18
9 42
9 07
9 05
9 23
9 53
9 68
9 50
9 48
9 79
9 40
9 35
9 65
A pp
F ilter
L ING
M etrics
R Client
S S
T UP
U t
_ _
a bl
c t
c on
c lass
e l
e Processor
i d
j ar
p er
r e
s eProcessor
t at
u res
x t
Ġ <
Ġ =
Ġ {
Ġ }
Ġ as
Ġ laun
Ġ Default
Ġ Us
10 5
10 69
10 649
20 1
20 6
et ty
44 86
on seProcessor
Ġs pec
Ġs tat
Ġt oo
un d
Ġf ilter
19 46
19 255
ĠN um
ĠAdd ing
55 7
Ġ0 4
ĠS tart
il s
64 506
70 2
04 9
04 58
ail ures
06 56
09 0
09 8
02 4
02 6
27 76
07 5
07 7
ĠM RAppMaster
IL LING
39 0656
Ġno de
36 2
36 390656
0000 12
28 7
05 8
05 63
23 3
23 506
56 1
53 43
57 2
57 6
57 23
16 02
38 2
38 75
58 286
25 075
11 313
49 5
49 7
98 2
66 0
79 1
59 5
88 8
363 23506
429 07
1068 1946
1068 0563
1068 5723
278 136
278 1602
278 25075
278 11313
1024 0
192 58286
192 42907
89 3
99 7
71 68
548 3
JobHistory Ut
Data Streamer
iz e
ĠSUCCE SS
364 0458
ĠK ILLING
Ġredu ces
Ġcomplet ed
utput Committer
abl ed
ĠUs ing
1069 64506
10649 3875
4486 067
19255 035
2776 5483
5343 203
278136 01
JobHistoryUt ils
3640458 3
/ *
0 18
1 28
1 68
2 20
2 47
3 00
3 15
3 06
3 09
3 27
3 28
3 46
4 00
4 10
4 37
4 09
4 02
4 51
4 50
4 096
5 03
5 29
6 42
6 55
6 08
6 36
6 56
6 58
7 22
7 64
7 39
7 23
7 46
7 47
7 14
7 16
7 25
7 52
7 31
7 45
8 00
8 70
8 53
8 57
8 54
8 16
8 38
8 25
8 48
8 43
8 79
8 192
9 4
9 37
9 03
9 02
9 47
9 33
9 98
9 063
: <
A B
A m
B lock
C on
C allQueue
E TUP
F IL
F inish
I T
I p
L in
M ININT
M RClient
O B
O X
P B
P er
R out
S ystem
S ervice
W eb
a d
a m
a ct
c ur
e i
f ig
f ilter
g ro
h e
k ed
l f
l ack
m o
n put
o d
p onseProcessor
r et
r ent
r it
s erver
t ing
t ies
u ber
x it
Ġ en
Ġ an
Ġ hdfs
Ġ max
Ġ ack
Ġ TASK
Ġ Token
Ġ id
00 9
10 4
at h
at ed
20 4
20 9063
15 2
15 7
15 9
ach ed
41 9
44 980
ĠA M
Ġs et
Ġs ervice
Ġs ize
in d
in e
te xt
ĠIN IT
17 6
37 3
37 9
22 9
Ġf ailures
19 209063
42 3
an o
an up
ĠO utputCommitter
dd ing
le anup
ĠS ocket
ĠS ETUP
ing Queue
ED ED
64 3
Ġc allQueue
Ġc leanup
70 6
04 3
04 8
ĠF S
PR OX
ĠE xception
OR T
01 4
08 2
27 9
07 2
Ġp ath
TA L
Ġcon text
39 5
39 6
39 8
Container Allocator
36 0
Ġstart ed
ĠRec ei
28 1
23 5
51 4
56 0
56 6
53 1
53 3
46 5
46 6
26 1
26 9
57 3
54 88
68 8
16 7
ĠT hread
ĠT he
38 8
38 09
ack gro
13 37
48 2
48 4
48 8
48 9
cess ing
69 7
77 5
77 6
79 6
79 9
59 0
TE R
Ġa dding
ĠJ OB
Ġb ackgro
Job Finish
Ġre mo
Ġpro cessing
Res ource
Res ponseProcessor
Ġk e
ĠNo de
278 3809
Ġ17 2
ĠFA TAL
6857 8
89 5
99 6
99 9
Ġe xit
ĠFAIL ED
86 1
tr ue
622 67
87 4
87 5
ĠRes ource
web pro
Ġ6226 7
3638 923
ĠSUCCE EDED
509 68
449 68578
449 50968
Ġtoken s
App s
Metrics System
con cur
per ties
Ġas sign
Ġlaun ching
Ġstat us
ĠNum ber
ĠStart ing
AB ORT
Am Ip
Block ingQueue
CallQueue Manager
FIL TER
Lin ked
Rout er
Web Apps
am filter
lack list
uber iz
Ġen abled
44980 705
ĠINIT ED
PROX Y
ĠRecei ved
5488 3
Ġbackgro und
Ġremo te
Resource Request
Ġexit ed
webpro xy
MetricsSystem Impl
concur rent
AmIp Filter
Linked BlockingQueue
