{"<s>":0,"<cls>":1,"<bos>":2,"<pad>":3,"</s>":4,"<unk>":5,"<mask>":6,"!":7,"\"":8,"#":9,"$":10,"%":11,"&":12,"'":13,"(":14,")":15,"*":16,"+":17,",":18,"-":19,".":20,"/":21,"0":22,"1":23,"2":24,"3":25,"4":26,"5":27,"6":28,"7":29,"8":30,"9":31,":":32,";":33,"<":34,"=":35,">":36,"?":37,"@":38,"A":39,"B":40,"C":41,"D":42,"E":43,"F":44,"G":45,"H":46,"I":47,"J":48,"K":49,"L":50,"M":51,"N":52,"O":53,"P":54,"Q":55,"R":56,"S":57,"T":58,"U":59,"V":60,"W":61,"X":62,"Y":63,"Z":64,"[":65,"\\":66,"]":67,"^":68,"_":69,"`":70,"a":71,"b":72,"c":73,"d":74,"e":75,"f":76,"g":77,"h":78,"i":79,"j":80,"k":81,"l":82,"m":83,"n":84,"o":85,"p":86,"q":87,"r":88,"s":89,"t":90,"u":91,"v":92,"w":93,"x":94,"y":95,"z":96,"{":97,"|":98,"}":99,"~":100,"¡":101,"¢":102,"£":103,"¤":104,"¥":105,"¦":106,"§":107,"¨":108,"©":109,"ª":110,"«":111,"¬":112,"®":113,"¯":114,"°":115,"±":116,"²":117,"³":118,"´":119,"µ":120,"¶":121,"·":122,"¸":123,"¹":124,"º":125,"»":126,"¼":127,"½":128,"¾":129,"¿":130,"À":131,"Á":132,"Â":133,"Ã":134,"Ä":135,"Å":136,"Æ":137,"Ç":138,"È":139,"É":140,"Ê":141,"Ë":142,"Ì":143,"Í":144,"Î":145,"Ï":146,"Ð":147,"Ñ":148,"Ò":149,"Ó":150,"Ô":151,"Õ":152,"Ö":153,"×":154,"Ø":155,"Ù":156,"Ú":157,"Û":158,"Ü":159,"Ý":160,"Þ":161,"ß":162,"à":163,"á":164,"â":165,"ã":166,"ä":167,"å":168,"æ":169,"ç":170,"è":171,"é":172,"ê":173,"ë":174,"ì":175,"í":176,"î":177,"ï":178,"ð":179,"ñ":180,"ò":181,"ó":182,"ô":183,"õ":184,"ö":185,"÷":186,"ø":187,"ù":188,"ú":189,"û":190,"ü":191,"ý":192,"þ":193,"ÿ":194,"Ā":195,"ā":196,"Ă":197,"ă":198,"Ą":199,"ą":200,"Ć":201,"ć":202,"Ĉ":203,"ĉ":204,"Ċ":205,"ċ":206,"Č":207,"č":208,"Ď":209,"ď":210,"Đ":211,"đ":212,"Ē":213,"ē":214,"Ĕ":215,"ĕ":216,"Ė":217,"ė":218,"Ę":219,"ę":220,"Ě":221,"ě":222,"Ĝ":223,"ĝ":224,"Ğ":225,"ğ":226,"Ġ":227,"ġ":228,"Ģ":229,"ģ":230,"Ĥ":231,"ĥ":232,"Ħ":233,"ħ":234,"Ĩ":235,"ĩ":236,"Ī":237,"ī":238,"Ĭ":239,"ĭ":240,"Į":241,"į":242,"İ":243,"ı":244,"Ĳ":245,"ĳ":246,"Ĵ":247,"ĵ":248,"Ķ":249,"ķ":250,"ĸ":251,"Ĺ":252,"ĺ":253,"Ļ":254,"ļ":255,"Ľ":256,"ľ":257,"Ŀ":258,"ŀ":259,"Ł":260,"ł":261,"Ń":262,"er":263,"Ġ1":264,"00":265,"Ġ2":266,"in":267,"Ġ0":268,"or":269,"ti":270,"on":271,"ĠD":272,"Ġs":273,"it":274,"ce":275,"ec":276,"un":277,"005":278,"ta":279,"17":280,"Ġ16":281,"03":282,"an":283,"Ġc":284,"Ġ[":285,"Ġ2005":286,"ĠDec":287,"ck":288,"te":289,"ar":290,"ld":291,"ro":292,"al":293,"27":294,"ork":295,"work":296,"worker":297,"oti":298,"es":299,"Sta":300,"Ġ22":301,"Ġ2227":302,"Ġin":303,"hi":304,"Ġ17":305,"02":306,"noti":307,"()":308,"init":309,"hild":310,"notice":311,"jk":312,"Ġchild":313,"et":314,"ag":315,"is":316,"oun":317,"ound":318,"bo":319,"Ġ04":320,"ot":321,"Ġ1702":322,"En":323,"en":324,"anag":325,"anager":326,"Manager":327,"err":328,"error":329,"mo":330,"Ġworker":331,"Env":332,"ĠworkerEnv":333,"ow":334,"ht":335,"Sun":336,"ĠP":337,"Ġ05":338,"15":339,"se":340,"Ġo":341,"ed":342,"Mon":343,"Stack":344,"us":345,"mod":346,"ll":347,"ĠI":348,"fal":349,"false":350,"ock":351,"re":352,"ard":353,"ore":354,"Ġsc":355,"Ġjk":356,"board":357,"oreboard":358,"Ġscoreboard":359,"Found":360,"lot":361,"ĠFound":362,"Ġslot":363,"pd":364,"Ġd":365,"tr":366,"erv":367,"pro":368,"id":369,"ity":370,"ing":371,"ower":372,"Ġ6":373,"ue":374,"Ġf":375,"13":376,"Vis":377,"tiv":378,"ess":379,"as":380,"le":381,"true":382,"om":383,"38":384,"ocked":385,"one":386,"hone":387,"ctiv":388,"la":389,"Ġ/":390,"ut":391,"ĠPhone":392,"con":393,"per":394,"ice":395,"14":396,"tpd":397,"ties":398,"Ġsta":399,"workers":400,"etc":401,"httpd":402,"Ġok":403,"proper":404,"conf":405,"properties":406,"ervice":407,"Service":408,"ManagerService":409,"Ġstate":410,"Ġmod":411,"Activ":412,"ad":413,"Ġerror":414,"20":415,"tion":416,"tus":417,"Bar":418,"Status":419,"ĠPhoneStatus":420,"ĠPhoneStatusBar":421,"ic":422,"mm":423,"16":424,"ull":425,"ig":426,"ect":427,"nt":428,"ight":429,"Activity":430,"ness":431,"Ġn":432,"26":433,"owerManagerService":434,"400":435,"reen":436,"Ġb":437,"creen":438,"Ġ-":439,"ate":440,"roll":441,"and":442,"screen":443,"Val":444,"Rect":445,"ounds":446,"Bounds":447,"StackVis":448,"StackBounds":449,"Ġdocked":450,"Ġfull":451,"Ġfullscreen":452,"wa":453,"umm":454,"ind":455,"ary":456,"mode":457,"ummary":458,"47":459,"ĠPowerManagerService":460,"Ġset":461,"01":462,"com":463,"00500":464,"40000500":465,"ff":466,"roid":467,"android":468,"ation":469,"Wind":470,"get":471,"Window":472,"im":473,"Ġ18":474,"46":475,"Ġ3":476,"Ġ06":477,"lay":478,"Ġ8":479,"10":480,"Ġ7":481,"33":482,"bi":483,"55":484,"ke":485,"play":486,"pp":487,"Ġ=":488,"isplay":489,"ew":490,"Ġu":491,"ask":492,"In":493,"Visi":494,"user":495,"ĠActivity":496,"04":497,"ĠDisplay":498,"Ġget":499,"Con":500,"lity":501,"Ġre":502,"troll":503,"Controll":504,"Controller":505,"Power":506,"ĠV":507,"Ġm":508,"06":509,"Ġ1820":510,"bility":511,"Visibility":512,"right":513,"Ġbright":514,"ĠDisplayPower":515,"Ġbrightness":516,"ĠDisplayPowerController":517,"ste":518,"yste":519,"Ġ07":520,"pdate":521,"ĠActivityManager":522,"ystem":523,"=-":524,"Ġr":525,"lg":526,"ication":527,"18":528,"uto":529,"ble":530,"08":531,"ith":532,"Ui":533,"UiVisibility":534,"Ġ10":535,"ol":536,"vis":537,"Ġcom":538,"39":539,"Ġe":540,"49":541,"st":542,"11":543,"59":544,"Locked":545,"fa":546,"ul":547,"ted":548,"System":549,"SystemUiVisibility":550,"fication":551,"all":552,"face":553,"ple":554,"ĠA":555,"pol":556,"ent":557,"icy":558,"policy":559,"36":560,"Ġnew":561,"Ġ13":562,"able":563,"48":564,"lock":565,"Noti":566,"Notification":567,"Id":568,"Ġvis":569,"On":570,"serv":571,"server":572,"ho":573,"56":574,"58":575,"gr":576,"Ġold":577,"Ġdi":578,"),":579,"adj":580,"ĠdockedStackVis":581,"ĠdockedStackBounds":582,"ĠfullscreenStackVis":583,"ĠfullscreenStackBounds":584,"wake":585,"ĠsetSystemUiVisibility":586,"Ġmask":587,"ĠnewVal":588,"ĠoldVal":589,"Ġdiff":590,"Light":591,"auto":592,"ful":593,"ks":594,"man":595,"ost":596,"ual":597,"uas":598,"wks":599,"inpro":600,"itmode":601,"boot":602,"boost":603,"enable":604,"ady":605,"waitmode":606,"comple":607,"userId":608,"Ġready":609,"gress":610,"wakeful":611,"manual":612,"uasummary":613,"wksummary":614,"inprogress":615,"bootcomple":616,"boostinprogress":617,"waitmodeenable":618,"wakefulness":619,"bootcompleted":620,"Lights":621,"07":622,"54":623,"51":624,"52":625,"Ġ26":626,"cent":627,"19":628,"Sc":629,"wm":630,"tent":631,"Ġ9":632,"ĠsetLights":633,"ĠsetLightsOn":634,"37":635,"at":636,"Ġ20":637,"ĠW":638,"57":639,"Ġcall":640,"BM":641,"HBM":642,"ĠHBM":643,"ur":644,"ud":645,"53":646,"21":647,"32":648,"50":649,"vent":650,"Ġupdate":651,"Alg":652,"ĠR":653,"ĠStack":654,"orith":655,"rollAlg":656,"ScrollAlg":657,"ĠStackScrollAlg":658,"orithm":659,"ĠStackScrollAlgorithm":660,"..":661,"22":662,"ver":663,"Ġ210":664,"Ġl":665,"Ġ19":666,"29":667,"000":668,"lap":669,"verlap":670,"44":671,"nim":672,"Ġevent":673,"am":674,"lag":675,"lags":676,"Ġta":677,"urface":678,"nimat":679,"Ġ2105":680,"op":681,"Ġw":682,"05":683,"ipp":684,"ipping":685,"43":686,"69":687,"Ġdo":688,"12":689,"09":690,"end":691,"Ġuid":692,"GE":693,"TA":694,"ten":695,"App":696,"ve":697,"Ġ28":698,"41":699,"unn":700,"Ġnot":701,"put":702,"Ġfalse":703,"SK":704,"iting":705,"TASK":706,"AL":707,"EAL":708,"Ġho":709,"Ġout":710,"imiting":711,"Ġcaller":712,"ĠREAL":713,"Ġlimiting":714,"Ġdoes":715,"GET":716,"unning":717,"TASKS":718,"Ġhold":719,"Ġoutput":720,"40":721,"tencent":722,"oc":723,"ĠgetT":724,"ĠgetR":725,"45":726,"Surface":727,"Ġ101":728,"28":729,"ac":730,"Ġp":731,"cl":732,"ui":733,"de":734,"io":735,"Ġis":736,"Ġ32":737,"cel":738,"ancel":739,"move":740,"Ġflags":741,"ocation":742,"Ġcancel":743,"Ġ176":744,"pend":745,"ĠT":746,"Ġt":747,"uspend":748,"est":749,"31":750,"Ex":751,"Int":752,"Update":753,"25":754,"intent":755,"Ġflg":756,"1000":757,"67":758,"roy":759,"udio":760,"estroy":761,"30":762,"Ġsuspend":763,"200":764,"Location":765,"Inter":766,"rget":767,"ĠWindow":768,"State":769,"Ġtarget":770,"Ġpid":771,"Pro":772,"Tim":773,"ss":774,"cess":775,"remove":776,"Ġ10111":777,"ĠWindowManager":778,"Time":779,"Out":780,"ans":781,"ĠbrightnessIn":782,"ĠbrightnessOut":783,"Ġrate":784,"ĠAnimat":785,"ĠAnimating":786,"Intent":787,"rans":788,"333":789,"Process":790,"23":791,"WindowManagerService":792,"AppProcess":793,"unningAppProcess":794,"ĠgetRunningAppProcess":795,"ĠgetRunningAppProcesses":796,"Pad":797,"ĠPhoneInter":798,"faceManager":799,"Ġ2626":800,"ĠPhoneInterfaceManager":801,"ĠNotification":802,"asks":803,"ame":804,"ĠNotificationManager":805,"\",":806,"Block":807,"ding":808,"ĠS":809,"Ġoverlap":810,"lation":811,"opPad":812,"ĠgetTopPad":813,"ranslation":814,"ĠgetTopPadding":815,"No":816,"iew":817,"...":818,"Lock":819,"View":820,"eS":821,"WindowState":822,"uld":823,"Ġsho":824,"BlockLocation":825,"uldBlockLocation":826,"ĠshouldBlockLocation":827,"Ġ{":828,"Ġ03":829,"ĠeventTime":830,"34":831,"mp":832,"qq":833,"Ġuser":834,"/.":835,"35":836,"ake":837,"xx":838,"removeWindow":839,"si":840,"Ġ}":841,"Ġcmp":842,"ActivityNo":843,"Ġ369":844,"UpdateLocked":845,"ĠuserActivityNo":846,"ĠuserActivityNoUpdateLocked":847,"Cl":848,"el":849,"anel":850,"kipping":851,"Ġwith":852,"ĠSkipping":853,"\".":854,"24":855,"PowerManagerService":856,"Wake":857,"Ġ\"":858,"Ġtr":859,"Ġblock":860,"ĠAudio":861,"Locks":862,"WakeLocks":863,"Ġblocker":864,"ĠAudioManager":865,"Di":866,"Hid":867,"Overlap":868,"destroy":869,"dHid":870,"qui":871,"ensi":872,"edActiv":873,"tive":874,"mmedActiv":875,"atedHid":876,"Ġex":877,"ĠupdateCl":878,"ĠupdateDi":879,"ĠisOverlap":880,"ĠTranslation":881,"eSensi":882,"mmedActivatedHid":883,"ĠupdateClipping":884,"ĠupdateDimmedActivatedHid":885,"eSensitive":886,"ĠupdateDimmedActivatedHideSensitive":887,"ww":888,"Ġac":889,"Ġ27":890,"mobi":891,"leqq":892,"mobileqq":893,"uded":894,"cluded":895,"Excluded":896,"ĠwithExcluded":897,"601":898,"activ":899,"ang":900,"hang":901,"Ġby":902,"ter":903,"0000":904,"ĠPanel":905,"ĠPanelView":906,"42":907,"108":908,"ffff":909,"has":910,"Ġ5":911,"Ġ326":912,"Ke":913,"ch":914,"Ġ(":915,"Ġto":916,"destroySurface":917,"Key":918,"Animat":919,"Ġname":920,"Ġ28601":921,"Animator":922,"=\"":923,"hide":924,"tras":925,"Ġtag":926,"Ġws":927,"Ġextras":928,"76":929,"null":930,"ĠcancelNotification":931,"WindowStateAnimator":932,"96":933,"ex":934,"pe":935,"Ġ59":936,"Ġ15":937,"Auto":938,"Ġfor":939,"2619":940,"Autohide":941,":-":942,"79":943,"Ġ12":944,"cli":945,"89":946,"Ġke":947,"Ġkey":948,"Chang":949,"fi":950,"Ġ11":951,"Tasks":952,"ecent":953,"ord":954,"ecord":955,"Ġinter":956,"Ġres":957,"fo":958,"ory":959,"Ġ273":960,"ase":961,"87":962,"ype":963,"40000":964,"ack":965,"ele":966,"gu":967,"age":968,"ount":969,"Ġret":970,"Ġcalled":971,"guard":972,"ir":973,"ml":974,"Ġ...":975,"ffect":976,"Ġrunning":977,"ĠgetTasks":978,"action":979,"91":980,"Record":981,"to":982,"ule":983,"Ġ146":984,"cep":985,"Ġ67":986,"60":987,"Ġ255":988,"activity":989,"To":990,"um":991,"671":992,"913":993,"cqui":994,"ring":995,"asing":996,"ĠAcqui":997,"ĠRele":998,"ĠAcquiring":999,"ĠReleasing":1000,"99":1001,"Type":1002,"bid":1003,"den":1004,"lication":1005,"ner":1006,"qu":1007,"var":1008,"Ġ21":1009,"ĠDir":1010,"Ġinde":1011,"html":1012,"ectory":1013,"Ġrule":1014,"Ġ2639":1015,"www":1016,"Ġforbid":1017,"client":1018,"cept":1019,"ĠDirectory":1020,"Ġindex":1021,"Ġforbidden":1022,"100":1023,"78":1024,"88":1025,"ap":1026,"uid":1027,"00000":1028,"Ġ23":1029,"Inner":1030,"Ġ3694":1031,"Changed":1032,"pand":1033,"Ġ49":1034,"Ġ100":1035,"itor":1036,"fy":1037,"ifi":1038,"ken":1039,"Ġi":1040,"Ġon":1041,"Ġnoti":1042,"ĠSurface":1043,"2618":1044,"Ġ8671":1045,"Ġ2633":1046,"Ġact":1047,"Ġ2113":1048,":[":1049,"pl":1050,"qt":1051,"},":1052,"Ġnull":1053,"Info":1054,"ĠgetRecent":1055,"Ġ17630":1056,"xxxx":1057,"removeWindowLocked":1058,"removeWindowInner":1059,"Ġintercept":1060,"ĠgetRecentTasks":1061,"removeWindowInnerLocked":1062,"ĠinterceptKey":1063,"Display":1064,"Effect":1065,"Sound":1066,"sta":1067,"tal":1068,"Ġ1737":1069,"ast":1070,"585":1071,"Ġ324":1072,"active":1073,"SoundEffect":1074,"Am":1075,"CK":1076,"Screen":1077,"led":1078,"nd":1079,"ĠĊ":1080,"Ġlock":1081,"Ġ104":1082,"arm":1083,"lease":1084,"Active":1085,"Ġrelease":1086,"quire":1087,"Ġacquire":1088,"Amount":1089,"Ġ10454":1090,"101":1091,"86":1092,"Tag":1093,"name":1094,"ub":1095,"ĠDestroy":1096,"Ġsurface":1097,"Ġ10113":1098,"ĠDestroying":1099,"77":1100,"IN":1101,"Up":1102,"Wifi":1103,"],":1104,"kg":1105,"system":1106,"Ġa":1107,"Ġ236":1108,"Monitor":1109,"ream":1110,"2060":1111,"Ġ313":1112,"Scan":1113,"destroySurfaceLocked":1114,"Keyguard":1115,"ackage":1116,"DisplayScan":1117,"WifiDisplayScan":1118,"systemui":1119,"62":1120,"600":1121,"Call":1122,"call":1123,"gin":1124,"index":1125,"Ġ327":1126,"Ġ720":1127,"ĠsuspendAutohide":1128,"Ġ3137":1129,"68":1130,"TI":1131,"ab":1132,"ef":1133,"flags":1134,"our":1135,"phone":1136,"rt":1137,"ts":1138,"ĠKeyguard":1139,"Ġ14":1140,"Ġ128":1141,"unch":1142,"1702":1143,"Application":1144,"Ġ17632":1145,"UpdateMonitor":1146,"Ġ27357":1147,"Token":1148,"ource":1149,"ĠKeyguardUpdateMonitor":1150,"Pe":1151,"Sto":1152,"ek":1153,"tag":1154,"pped":1155,"ending":1156,"Ġ17621":1157,"Ġ3693":1158,"Peek":1159,"Stopped":1160,"920":1161,"=[":1162,"With":1163,"ible":1164,"pkg":1165,"own":1166,"InCall":1167,"Ġ2618":1168,"ĠcancelPeek":1169,"Expand":1170,"ĠcancelNotificationWith":1171,"abled":1172,"ĠcancelNotificationWithTag":1173,"303":1174,"508":1175,"708":1176,"RI":1177,"ose":1178,"oll":1179,"Ġ55":1180,"ĠSystemUiVisibility":1181,"Enabled":1182,"usic":1183,"UiVisibilityChanged":1184,"ffffffff":1185,"Ġ27353":1186,"Ġ14638":1187,"apse":1188,"Ġ2318":1189,"fyUiVisibilityChanged":1190,"ĠnotifyUiVisibilityChanged":1191,"Ġ1280":1192,"ollapse":1193,"220":1194,"Flags":1195,"Pla":1196,"Source":1197,"he":1198,"larm":1199,"ode":1200,"Ġandroid":1201,"anUp":1202,"Ġcle":1203,"Ġdown":1204,"ueue":1205,"Ġ8303":1206,"188":1207,"ĠAlarm":1208,"NotificationVisibility":1209,"290":1210,"SurfacePla":1211,"Ġ10091":1212,"ApplicationRecord":1213,"anUpApplicationRecord":1214,"ĠcleanUpApplicationRecord":1215,"700":1216,"ACK":1217,"AIN":1218,"Collapse":1219,"LJ":1220,"MAIN":1221,"WL":1222,"Work":1223,"sEnabled":1224,"ySoundEffect":1225,"Ġ58":1226,"Ġqu":1227,"erySoundEffect":1228,"tation":1229,"launch":1230,"264":1231,"2626":1232,"560":1233,"444":1234,"1080":1235,"1001":1236,"RILJ":1237,"WorkSource":1238,"ĠquerySoundEffect":1239,"ĠquerySoundEffectsEnabled":1240,"*\",":1241,"66":1242,"]=":1243,"][":1244,"no":1245,"pad":1246,"ugin":1247,"}}":1248,"Ġchang":1249,"tepad":1250,"Ġbnd":1251,"WindowToken":1252,"555":1253,"Ġremove":1254,"1896":1255,"ample":1256,"67585":1257,"=\"*":1258,"example":1259,"Expanded":1260,"notepad":1261,"Ġbnds":1262,"189667585":1263,"121":1264,"514":1265,"97":1266,"Audio":1267,"Event":1268,"og":1269,"Ġ:":1270,"Ġtrue":1271,"Ġ54":1272,"Ġ50":1273,"Ġst":1274,"try":1275,"ash":1276,"Ġ37":1277,"395":1278,"ult":1279,"Ġ2096":1280,"530":1281,"ĠcancelAutohide":1282,"Ġ17622":1283,"40000600":1284,"//":1285,"2560":1286,"2555":1287,"317":1288,"98":1289,"908":1290,"Bef":1291,"Com":1292,"Pop":1293,"Queue":1294,"Re":1295,"Recent":1296,"St":1297,"Spl":1298,"Tq":1299,"WX":1300,"au":1301,"base":1302,"cts":1303,"code":1304,"out":1305,"pon":1306,"pWindow":1307,"package":1308,"sActivity":1309,"upWindow":1310,"Ġ,":1311,"Ġal":1312,"Ġpolicy":1313,"Ġ57":1314,"Ġ2395":1315,"incall":1316,"tacts":1317,"2702":1318,"2739":1319,"Ġ1736":1320,"Entry":1321,"1554":1322,"ller":1323,"recent":1324,"oreQueue":1325,"Ġde":1326,"Ġdat":1327,"138":1328,"contacts":1329,"Ġnum":1330,"2691":1331,"4000":1332,"layout":1333,"Ġ8290":1334,"stub":1335,"entInfo":1336,"opActivity":1337,"Ġ2838":1338,"ocus":1339,"Ġcanceled":1340,"ĠtopActivity":1341,"removeLocked":1342,"Ġ3697":1343,"000002":1344,"0000700":1345,"10840000":1346,"10800000":1347,"Ġkeyguard":1348,"Ġkeycode":1349,"file":1350,"Ġinteractive":1351,"Ġresult":1352,"total":1353,"Ġ14640":1354,"plugin":1355,"qtl":1356,"ĠinterceptKeyBef":1357,"ĠinterceptKeyTq":1358,"staller":1359,"endingIntent":1360,"InCallActivity":1361,"18800000":1362,"10804000":1363,"ĠremoveNotification":1364,"ashActivity":1365,"Compon":1366,"PopupWindow":1367,"RecentsActivity":1368,"SplashActivity":1369,"WXEntry":1370,"ause":1371,"ĠpolicyFlags":1372,"incallui":1373,"recents":1374,"oreQueueing":1375,"ĠkeyguardActive":1376,"totalTasks":1377,"ĠinterceptKeyBeforeQueueing":1378,"ComponentInfo":1379,"WXEntryActivity":1380,"800":1381,"CH":1382,"La":1383,"Or":1384,"Sh":1385,"Top":1386,"Translation":1387,"YTranslation":1388,"cast":1389,"pTop":1390,"vio":1391,"ĠC":1392,"ĠM":1393,"ĠU":1394,"Ġ46":1395,"Ġactive":1396,"road":1397,"Ġ2250":1398,"():-":1399,"End":1400,"153":1401,"usNotification":1402,"revio":1403,"Ġfro":1404,"ade":1405,"Ġbroad":1406,"Ġ1815":1407,"ĠgetLocation":1408,"111":1409,"365":1410,"ĠnewYTranslation":1411,"484":1412,"NotificationSh":1413,"OnScreen":1414,"ĠupdateNotificationSh":1415,"Ġlocation":1416,"Ġprevio":1417,"ĠoverlapAmount":1418,"Ġtotal":1419,"765":1420,"clipTop":1421,"Ġ2556":1422,"ĠAlarmManager":1423,"Ġchange":1424,"Ġstop":1425,"usNotificationEnd":1426,"Ġbroadcast":1427,"ĠgetLocationOnScreen":1428,"ĠupdateNotificationShade":1429,"ĠpreviousNotificationEnd":1430,"clipTopAmount":1431,"'t":1432,"63":1433,"75":1434,"85":1435,"92":1436,"93":1437,"Child":1438,"Music":1439,"ON":1440,"Qs":1441,"Th":1442,"eed":1443,"lose":1444,"ren":1445,"Ġ4":1446,"Ġus":1447,"Ġlayout":1448,"unIn":1449,"Ġcause":1450,"Ġclose":1451,"Ġinit":1452,"ĠPendingIntent":1453,"read":1454,"Ġfind":1455,"Ġfocus":1456,"Ġstart":1457,"207":1458,"Ġneed":1459,"553":1460,"Visible":1461,"ĠDisplayManagerService":1462,"ĠmExpanded":1463,"ĠrunIn":1464,"497":1465,"598":1466,"482":1467,"LightsLocked":1468,"Ġ2644":1469,"ĠupdateLightsLocked":1470,"Ġlog":1471,"Ġ2839":1472,"ĠisMusic":1473,"ĠThe":1474,"899":1475,"Changes":1476,"Ġ2558":1477,"10111":1478,"Ġ23650":1479,"reamType":1480,"WifiDisplayScanLocked":1481,"WifiDisplayScanRe":1482,"NotificationVisibilityChanges":1483,"ĠcleanUpApplicationRecordLocked":1484,"Stream":1485,"ĠremoveNotificationChild":1486,"ĠCan":1487,"Ġfrom":1488,"ĠstopWifiDisplayScanLocked":1489,"Thread":1490,"Ġcaused":1491,"ĠcloseQs":1492,"ĠmExpandedVisible":1493,"ĠrunInThread":1494,"ĠlogNotificationVisibilityChanges":1495,"ĠisMusicActive":1496,"WifiDisplayScanRequ":1497,"ĠremoveNotificationChildren":1498,"233":1499,"94":1500,"Mi":1501,"OO":1502,"VI":1503,"audio":1504,"for":1505,"Ġ2514":1506,"Ġ09":1507,"anim":1508,"278":1509,"perfor":1510,"Ġ--":1511,"1041":1512,"Ġeuid":1513,"529":1514,"AppWindowToken":1515,"289":1516,"Ġ17633":1517,"26197":1518,"Ġapp":1519,"AudioMi":1520,"audioserver":1521,"perform":1522,"AudioMix":1523,"547":1524,"80":1525,"807":1526,"Count":1527,"CTI":1528,"Play":1529,"Package":1530,"SE":1531,"Sa":1532,"Vol":1533,"bar":1534,"tView":1535,"uch":1536,"Ġh":1537,"ĠĠ":1538,"Ġro":1539,"Ġplay":1540,"Ġanim":1541,"Ġsystem":1542,"notify":1543,"isten":1544,"edAutohide":1545,"Ġ63":1546,"208":1547,"105":1548,"Ġ7111":1549,"pplication":1550,"398":1551,"Ġeffect":1552,"499":1553,"583":1554,"070":1555,"091":1556,"AppStopped":1557,"veSurface":1558,"act":1559,"ĠTex":1560,"ĠtreamType":1561,"uspendedAutohide":1562,"eSuspendedAutohide":1563,"destroyOr":1564,"Ġexpand":1565,"Ġ27365":1566,"Ġ2794":1567,"761":1568,"26198":1569,"Ġresum":1570,"Ġ2555":1571,"activityStopped":1572,"Touch":1573,"ume":1574,"Ġnotification":1575,"2201":1576,"StreamVol":1577,"Player":1578,"SaveSurface":1579,"ĠplaySoundEffect":1580,"notifyAppStopped":1581,"ĠeffectType":1582,"ĠTextView":1583,"destroyOrSaveSurface":1584,"ĠresumeSuspendedAutohide":1585,"StreamVolume":1586,"352":1587,"517":1588,"769":1589,"Aud":1590,"Ce":1591,"De":1592,"Last":1593,"TE":1594,"cer":1595,"ment":1596,"vice":1597,"Ġg":1598,"Ġ38":1599,"008":1600,"info":1601,"cement":1602,"00508":1603,"ested":1604,"Ġinsta":1605,"ntCollapse":1606,"andle":1607,"010":1608,"011":1609,"WindowSurfacePla":1610,"ĠActivityRecord":1611,"ĠgetLast":1612,"498":1613,"599":1614,"Ġcalling":1615,"Ġ2107":1616,"Ġ2808":1617,"Ġaction":1618,"ibleStreamVolume":1619,"SurfacePlacement":1620,"80000508":1621,"performSurfacePlacement":1622,"AudibleStreamVolume":1623,"Cell":1624,"ĠinstantCollapse":1625,"WindowSurfacePlacer":1626,"ĠgetLastAudibleStreamVolume":1627,"057":1628,"1207":1629,"409":1630,"502":1631,"518":1632,"64":1633,"746":1634,"84":1635,"EW":1636,"Panel":1637,"TY":1638,"ion":1639,"ton":1640,"ved":1641,"yer":1642,"zone":1643,"Ġ<":1644,"Ġ48":1645,"Ġ208":1646,"Ġse":1647,"cei":1648,"0057":1649,"150":1650,"154":1651,"Ġ64":1652,"Ġ66":1653,"utton":1654,"Ġbe":1655,"ateCollapse":1656,"469":1657,"layed":1658,"Ġ868":1659,"Ġ8289":1660,"106":1661,"550":1662,"58482":1663,"224":1664,"291":1665,"694":1666,"Ġ2809":1667,"Ġ323":1668,"670":1669,"Note":1670,"Ġforce":1671,"790":1672,"calling":1673,"Ġ3714":1674,"Ġalarm":1675,"Ġdelayed":1676,"Layer":1677,"ĠanimateCollapse":1678,"CellInfo":1679,"120758482":1680,"Panels":1681,"Ġ8682":1682,"ĠanimateCollapsePanels":1683,"202":1684,"237":1685,"241":1686,"318":1687,"307":1688,"546":1689,"507":1690,"://":1691,"Cho":1692,"He":1693,"QQ":1694,"SU":1695,"Sub":1696,"Ten":1697,"av":1698,"application":1699,"bus":1700,"chi":1701,"em":1702,"gis":1703,"hed":1704,"ien":1705,"me":1706,"music":1707,"rec":1708,"sh":1709,"set":1710,"ula":1711,"vnd":1712,"yp":1713,"Ġ56":1714,"Ġ53":1715,"Ġend":1716,"Ġ156":1717,"001":1718,"003":1719,"iness":1720,"installer":1721,"orage":1722,"time":1723,"tart":1724,"tel":1725,"archi":1726,"270":1727,"Ġ603":1728,"essage":1729,"204":1730,"161":1731,"4000000":1732,"476":1733,"460":1734,"Ġ308":1735,"107":1736,"Installer":1737,"045":1738,"066":1739,"080":1740,"08000":1741,"392":1742,"storage":1743,"lockscreen":1744,"564":1745,"589":1746,"Ġ2643":1747,"190":1748,"atter":1749,"577":1750,"299":1751,"Ġwh":1752,"Ġ3258":1753,"Ġtype":1754,"Ġtyp":1755,"LockScreen":1756,"qqmusic":1757,"xxx":1758,"10808000":1759,"Ġrestart":1760,"872":1761,"992":1762,"994":1763,"apk":1764,"Ġ10027":1765,"xxxxxxxx":1766,"774":1767,"Ġ23689":1768,"oseSub":1769,"packageinstaller":1770,"CHOO":1771,"ĠbroadcastIntent":1772,"ĠPendingIntentRecord":1773,"VIEW":1774,"PackageInstaller":1775,"ceived":1776,"Ġbegin":1777,":///":1778,"ChooseSub":1779,"QQfile":1780,"SUB":1781,"Tencent":1782,"business":1783,"emula":1784,"gister":1785,"ientation":1786,"recv":1787,"archive":1788,"attery":1789,"LockScreenActivity":1790,"xxxxxxxxxxx":1791,"CHOOSE":1792,"PackageInstallerActivity":1793,"ChooseSubActivity":1794,"emulated":1795,"**":1796,"046":1797,"10057":1798,"250":1799,"338":1800,"346":1801,"311":1802,"459":1803,"527":1804,"516":1805,"539":1806,"61":1807,"603":1808,"609":1809,"83":1810,"820":1811,"811":1812,"90":1813,"932":1814,"ACTI":1815,"Battery":1816,"Ed":1817,"ME":1818,"Message":1819,"Pid":1820,"Sess":1821,"ak":1822,"back":1823,"iz":1824,"lu":1825,"mScreen":1826,"mInCall":1827,"mWifiDisplayScanRequ":1828,"os":1829,"qzone":1830,"ting":1831,"tur":1832,"xc":1833,"Ġ>":1834,"Ġx":1835,"Ġy":1836,"Ġid":1837,"Ġqui":1838,"erts":1839,"006":1840,"030":1841,"Ġclock":1842,"arch":1843,"isable":1844,"Ġoff":1845,"Ġover":1846,"Ġdisable":1847,"136":1848,"ome":1849,"162":1850,"164":1851,"igation":1852,"Ġnav":1853,"261":1854,"Ġback":1855,"475":1856,"Ġ367":1857,"Ġ==":1858,"Ġrecent":1859,"ĠmWifiDisplayScanRequ":1860,"061":1861,"065":1862,"Ġrecord":1863,"182":1864,"183":1865,"084":1866,"visible":1867,"590":1868,"595":1869,"568":1870,"569":1871,"077":1872,"542":1873,"528":1874,"Ġ2642":1875,"198":1876,"374":1877,"228":1878,"294":1879,"295":1880,"297":1881,"441":1882,"691":1883,"Ġ3255":1884,"estCount":1885,"Ġ502":1886,"Ġtoken":1887,"destroySurfaces":1888,"ĠcancelNotificationLocked":1889,"Ġreset":1890,"995":1891,"783":1892,"Ġ23469":1893,"ĠonNotificationVisibility":1894,"26187":1895,"ledNotification":1896,"TICK":1897,"}}},":1898,"Ġalerts":1899,"ĠUI":1900,"Ġhome":1901,"Ġrotation":1902,"istener":1903,"TouchEvent":1904,"ĠnotificationLight":1905,"Ġsearch":1906,"NoteEd":1907,"callingPid":1908,"setting":1909,"Ġ30852":1910,"Session":1911,"ize":1912,"mScreenOn":1913,"mWifiDisplayScanRequested":1914,"turn":1915,"Ġquick":1916,"igationbar":1917,"Ġnavigationbar":1918,"ĠmWifiDisplayScanRequestCount":1919,"ĠonNotificationVisibilityChanged":1920,"NoteEditor":1921,"settings":1922,"056":1923,"102":1924,"213":1925,"249":1926,"248":1927,"240":1928,"306":1929,"357":1930,"305":1931,"432":1932,"450":1933,"429":1934,"405":1935,"608":1936,"659":1937,"635":1938,"70":1939,"707":1940,"709":1941,"818":1942,"819":1943,"850":1944,"80000":1945,"95":1946,"926":1947,"937":1948,"942":1949,"For":1950,"Ne":1951,"New":1952,"Spe":1953,"Trans":1954,"UI":1955,"Wir":1956,"Xml":1957,"bor":1958,"blity":1959,"ge":1960,"hon":1961,"handle":1962,"hbor":1963,"il":1964,"ick":1965,"listener":1966,"phon":1967,"sDe":1968,"yManager":1969,"Ġor":1970,"erUI":1971,"Ġ133":1972,"Ġ139":1973,"002":1974,"Ġ218":1975,"tick":1976,"Ġsending":1977,"tail":1978,"170":1979,"178":1980,"038":1981,"277":1982,"028":1983,"repe":1984,"erval":1985,"ingCellInfo":1986,"139":1987,"1346":1988,"1393":1989,"382":1990,"386":1991,"146":1992,"148":1993,"149":1994,"209":1995,"166":1996,"ighbor":1997,"ActivityStack":1998,"ActivityManagerService":1999,"262":2000,"Value":2001,"479":2002,"getValue":2003,"466":2004,"Ġ366":2005,"339":2006,"ppWindowToken":2007,"Visiblity":2008,"04807":2009,"ĠgetNe":2010,"ĠmVisiblity":2011,"062":2012,"064":2013,"189":2014,"119":2015,"ĠAppWindowToken":2016,"368":2017,"Ġ1309":2018,"485":2019,"4869":2020,"Ġvisible":2021,"587":2022,"076":2023,"079":2024,"525":2025,"atInt":2026,"atch":2027,"ĠWifi":2028,"296":2029,"443":2030,"ams":2031,"amap":2032,"698":2033,"ĠgetRing":2034,"Ġ3259":2035,"Ġ3257":2036,"ĠTele":2037,"242":2038,"0000008":2039,"Ġ503":2040,"2619913":2041,"40000000":2042,"781":2043,"Ġ23685":2044,"uncherUI":2045,"974":2046,"LauncherUI":2047,"80583":2048,"activityStoppedLocked":2049,"7690":2050,"viceId":2051,"Ġ3807":2052,"Head":2053,"40000008":2054,"Ġwhen":2055,"80000608":2056,"NewsDe":2057,"Transact":2058,"Wired":2059,"XmlActivity":2060,"listenerTag":2061,"phonyManager":2062,"tailXmlActivity":2063,"repeatInt":2064,"134680583":2065,"ighboringCellInfo":2066,"Ġ3664":2067,"ĠgetNeighboringCellInfo":2068,"ĠTelephonyManager":2069,"NewsDetailXmlActivity":2070,"repeatInterval":2071,")],":2072,"115":2073,"122":2074,"216":2075,"300":2076,"354":2077,"414":2078,"410":2079,"436":2080,"458":2081,"451":2082,"419":2083,"428":2084,"538":2085,"65":2086,"614":2087,"619":2088,"669":2089,"640":2090,"719":2091,"757":2092,"743":2093,"735":2094,"846":2095,"839":2096,"859":2097,"853":2098,"896":2099,"879":2100,"938":2101,"916":2102,"955":2103,"939":2104,"936":2105,"944":2106,"931":2107,"967":2108,"979":2109,"AN":2110,"AT":2111,"Anim":2112,"Button":2113,"BAT":2114,"Da":2115,"FIN":2116,"Mode":2117,"PE":2118,"RO":2119,"RT":2120,"RY":2121,"Ro":2122,"Runn":2123,"Size":2124,"TOO":2125,"ax":2126,"aPlayer":2127,"eo":2128,"eta":2129,"iaPlayer":2130,"locked":2131,"mis":2132,"nal":2133,"oin":2134,"oing":2135,"queue":2136,"sUp":2137,"th":2138,"vid":2139,"xy":2140,"Ġhi":2141,"Ġen":2142,"Ġed":2143,"Ġper":2144,"Ġhas":2145,"Ġhide":2146,"Ġhe":2147,"Ġ122":2148,"Ġ1208":2149,"004":2150,"Ġ227":2151,"inLayer":2152,"onEvent":2153,"onTransact":2154,"Ġsource":2155,"ceChanged":2156,"ecu":2157,"tach":2158,"171":2159,"173":2160,"175":2161,"031":2162,"039":2163,"Ġcro":2164,"otionEvent":2165,"Ġinfo":2166,"ĠinRo":2167,"022":2168,"025":2169,"ediaPlayer":2170,"Ġscreen":2171,"Ġsched":2172,"Ġdisplay":2173,"idth":2174,"Ġ60":2175,"Ġ604":2176,"387":2177,"388":2178,"389":2179,"141":2180,"143":2181,"144":2182,"147":2183,"201":2184,"tusbar":2185,"Ġbutton":2186,"Ġblocked":2187,"471":2188,"018":2189,"467":2190,"104":2191,"332":2192,"552":2193,"554":2194,"player":2195,"Invisible":2196,"ĠActivityManagerService":2197,"ĠActivityInfo":2198,"049":2199,"Ġreceived":2200,"Ġregister":2201,"Ġmanager":2202,"ĠmBlock":2203,"Ġmake":2204,"ĠmHead":2205,"Ġmax":2206,"Ġmeta":2207,"ĠminLayer":2208,"180":2209,"185":2210,"187":2211,"olType":2212,"story":2213,"uling":2214,"ĠACTI":2215,"360":2216,"366":2217,"483":2218,"488":2219,"489":2220,"NotificationInter":2221,"566":2222,"586":2223,"071":2224,"524":2225,"192":2226,"196":2227,"375":2228,"379":2229,"attach":2230,"571":2231,"223":2232,"225":2233,"Ġ19609":2234,"Ġwidth":2235,"435":2236,"696":2237,"090":2238,"099":2239,"GED":2240,"GER":2241,"TART":2242,"281":2243,"Ġpkg":2244,"Ġpoin":2245,"ĠTak":2246,"Excep":2247,"Existen":2248,"Intercept":2249,"Proxy":2250,"235":2251,"ĠSTART":2252,"sion":2253,"Ġ},":2254,"terCount":2255,"Ġ3267":2256,"ĠtoolType":2257,"763":2258,"766":2259,"791":2260,"794":2261,"1002":2262,"882":2263,"Ġ23484":2264,"Ġ10020":2265,"ĠonNotification":2266,"ĠonExpand":2267,"ĠonIntercept":2268,"2618516":2269,"statusbar":2270,"10113":2271,"10112":2272,"866":2273,"ĠdownTime":2274,"}}}":2275,"ExpandedInvisible":2276,"ĠdeviceId":2277,"CHAN":2278,"ĠMotionEvent":2279,"ĠMediaPlayer":2280,"2332":2281,"VITY":2282,"Ġhandle":2283,"Ġrot":2284,"Touches":2285,"PlayerActivity":2286,"Device":2287,"TERY":2288,"Ġgoing":2289,"Ġ3848":2290,"ĠactionButton":2291,"4097":2292,"TYPE":2293,"shot":2294,"ACTION":2295,"lug":2296,"geFlags":2297,"Ġorientation":2298,"Ġ13094":2299,"261991304":2300,"Animation":2301,"BATTERY":2302,"Data":2303,"FINGER":2304,"Runnable":2305,"TOOL":2306,"mission":2307,"queueNotificationInter":2308,"sUpExisten":2309,"video":2310,"Ġhistory":2311,"ĠenqueueNotificationInter":2312,"ĠedgeFlags":2313,"Ġpermission":2314,"Ġheight":2315,"Ġ12236":2316,"Ġ22775":2317,"ceChangedRunnable":2318,"Ġcrop":2319,"ĠinRotation":2320,"Ġscreenshot":2321,"Ġschedule":2322,"ĠbuttonState":2323,"ĠmBlockTouches":2324,"ĠmakeExpandedInvisible":2325,"ĠmHeadsUpExisten":2326,"ĠmaxLayer":2327,"ĠmetaState":2328,"attachApplication":2329,"ĠpointerCount":2330,"ĠTaking":2331,"Exception":2332,"ĠonExpanding":2333,"ĠonInterceptTouchEvent":2334,"261851646":2335,"CHANGED":2336,"ĠhistorySize":2337,"ĠenqueueNotificationInternal":2338,"ĠmHeadsUpExistenceChangedRunnable":2339,");":2340,"047":2341,"050":2342,"126":2343,"215":2344,"246":2345,"211":2346,"259":2347,"236":2348,"232":2349,"244":2350,"245":2351,"2108":2352,"21080":2353,"327":2354,"304":2355,"359":2356,"319":2357,"321":2358,"312":2359,"341":2360,"345":2361,"403":2362,"402":2363,"408":2364,"425":2365,"549":2366,"536":2367,"602":2368,"616":2369,"652":2370,"622":2371,"641":2372,"625":2373,"630":2374,"689":2375,"687":2376,"718":2377,"736":2378,"756":2379,"729":2380,"745":2381,"778":2382,"81":2383,"82":2384,"802":2385,"816":2386,"808":2387,"856":2388,"821":2389,"809":2390,"840":2391,"830":2392,"834":2393,"8670":2394,"903":2395,"927":2396,"950":2397,"940":2398,"945":2399,"928":2400,"988":2401,"At":2402,"All":2403,"And":2404,"Bind":2405,"CON":2406,"Def":2407,"ED":2408,"FO":2409,"Hand":2410,"IME":2411,"LA":2412,"LO":2413,"Lo":2414,"Lw":2415,"Met":2416,"Run":2417,"STE":2418,"Tick":2419,"YSTE":2420,"af":2421,"ati":2422,"dis":2423,"eceived":2424,"ger":2425,"ging":2426,"gory":2427,"har":2428,"ient":2429,"ler":2430,"ms":2431,"ntent":2432,"patch":2433,"pati":2434,"ric":2435,"rted":2436,"sLocked":2437,"uti":2438,"Ġ.":2439,"ĠE":2440,"Ġun":2441,"Ġ**":2442,"erMode":2443,"Ġ127":2444,"Ġ147":2445,"007":2446,"inis":2447,"orient":2448,"Ġservice":2449,"172":2450,"17499":2451,"032":2452,"Ġcon":2453,"272":2454,"Start":2455,"Started":2456,"hich":2457,"026":2458,"etric":2459,"erred":2460,"155":2461,"Ġof":2462,"eduling":2463,"ush":2464,"ust":2465,"ĠICON":2466,"ĠIntent":2467,"register":2468,"ingDisplay":2469,"Ġ61":2470,"130":2471,"cons":2472,"140":2473,"205":2474,"165":2475,"igger":2476,"Ġnon":2477,"266":2478,"ategory":2479,"roidRun":2480,"462":2481,"465":2482,"Ġ368":2483,"Ġ3066":2484,"336":2485,"Input":2486,"043":2487,"ĠgetAll":2488,"Ġrequ":2489,"Powered":2490,"Ġmetric":2491,"069":2492,"181":2493,"186":2494,"087":2495,"Ġcompati":2496,"396":2497,"399":2498,"496":2499,"593":2500,"594":2501,"597":2502,"ĠApplication":2503,"361":2504,"364":2505,"367":2506,"480":2507,"481":2508,"487":2509,"hod":2510,"561":2511,"565":2512,"582":2513,"541":2514,"512":2515,"521":2516,"191":2517,"573":2518,"578":2519,"Ġcallback":2520,"531":2521,"535":2522,"324":2523,"325":2524,"328":2525,"505":2526,"509":2527,"ĠReceived":2528,"Ġ2106":2529,"Ġlast":2530,"442":2531,"Ġwhich":2532,"434":2533,"693":2534,"124":2535,"TATI":2536,"vel":2537,"280":2538,"282":2539,"ĠTIME":2540,"675":2541,"676":2542,"678":2543,"TimeUpdate":2544,"TimeTick":2545,"ĠSYSTE":2546,"342":2547,"Ġtrigger":2548,"Ġexecu":2549,"cheduling":2550,"764":2551,"768":2552,"963":2553,"9600":2554,"792":2555,"793":2556,"797":2557,"Ġ12025":2558,"897":2559,"898":2560,"Ġrescheduling":2561,"871":2562,"873":2563,"40000208":2564,"993":2565,"Ġ2121":2566,"784":2567,"883":2568,"888":2569,"Ġicons":2570,"CKED":2571,"770":2572,"772":2573,"INFO":2574,"Callback":2575,"TIME":2576,"661":2577,"Ġchanged":2578,"971":2579,"973":2580,"Ġ50926":2581,"Ġ5769":2582,"Ġ5784":2583,"Orientation":2584,"ĠMust":2585,"ĠUn":2586,"ĠUSE":2587,"9231":2588,"Ġgot":2589,"ĠcallingPackage":2590,"performSurfacePlacementInner":2591,"performSurfacePlacementLo":2592,"show":2593,"timeException":2594,"BatteryL":2595,"ĠrotationFor":2596,"Speed":2597,"handleMessage":2598,"ĠWifiController":2599,"ĠgetRingerMode":2600,"ROTATI":2601,"ĠregisterCallback":2602,"ĠhandleTimeUpdate":2603,"ĠscheduleTimeTick":2604,"21085":2605,"AtTime":2606,"AndroidRun":2607,"Binder":2608,"Deferred":2609,"Handler":2610,"LOCKED":2611,"Method":2612,"dispatch":2613,"harging":2614,"util":2615,"Ġunregister":2616,"Ġ***":2617,"1749923":2618,"ĠICONS":2619,"InputMethod":2620,"ĠgetAllCellInfo":2621,"Ġrequested":2622,"Ġmetrics":2623,"Ġcompatible":2624,"ĠSYSTEM":2625,"ĠtriggerAtTime":2626,"Ġexecute":2627,"OrientationLw":2628,"ĠUSER":2629,"performSurfacePlacementLoop":2630,"ĠrotationForOrientationLw":2631,"ROTATION":2632,"ĠscheduleTimeTickEvent":2633,"AndroidRuntimeException":2634,"dispatchMessage":2635,")}":2636,"016":2637,"055":2638,"059":2639,"054":2640,"103":2641,"127":2642,"113":2643,"129":2644,"214":2645,"210":2646,"254":2647,"252":2648,"253":2649,"24000000":2650,"2198":2651,"313":2652,"320":2653,"326":2654,"310":2655,"308":2656,"349":2657,"351":2658,"340":2659,"417":2660,"427":2661,"413":2662,"426":2663,"418":2664,"439":2665,"449":2666,"448":2667,"452":2668,"503":2669,"520":2670,"526":2671,"533":2672,"506":2673,"537":2674,"627":2675,"613":2676,"638":2677,"626":2678,"633":2679,"655":2680,"606":2681,"649":2682,"654":2683,"653":2684,"612":2685,"631":2686,"667":2687,"642":2688,"660":2689,"688":2690,"71":2691,"72":2692,"74":2693,"717":2694,"713":2695,"738":2696,"747":2697,"701":2698,"733":2699,"751":2700,"721":2701,"744":2702,"712":2703,"734":2704,"724":2705,"779":2706,"815":2707,"814":2708,"847":2709,"810":2710,"806":2711,"858":2712,"832":2713,"844":2714,"843":2715,"869":2716,"828":2717,"831":2718,"889":2719,"887":2720,"900":2721,"902":2722,"914":2723,"957":2724,"921":2725,"943":2726,"969":2727,"912":2728,"941":2729,"989":2730,"978":2731,"986":2732,"::":2733,"Ac":2734,"ATE":2735,"Bec":2736,"Blu":2737,"DO":2738,"Destroy":2739,"EN":2740,"ER":2741,"Fal":2742,"Fre":2743,"Focus":2744,"Fact":2745,"Finis":2746,"Is":2747,"IWindow":2748,"Mgr":2749,"NCH":2750,"Of":2751,"Op":2752,"Pl":2753,"Phone":2754,"PRI":2755,"PendingIntent":2756,"Plug":2757,"Qzone":2758,"Sim":2759,"Tr":2760,"UP":2761,"Uid":2762,"UNCH":2763,"VATE":2764,"WN":2765,"We":2766,"]}":2767,"ain":2768,"br":2769,"batch":2770,"bPl":2771,"co":2772,"cancel":2773,"chang":2774,"count":2775,"category":2776,"df":2777,"dNotification":2778,"ez":2779,"fMgr":2780,"ged":2781,"hec":2782,"hBattery":2783,"ibr":2784,"kn":2785,"king":2786,"ly":2787,"ling":2788,"log":2789,"nec":2790,"oot":2791,"oper":2792,"pr":2793,"pans":2794,"push":2795,"res":2796,"sing":2797,"sFor":2798,"tt":2799,"ty":2800,"tec":2801,"tone":2802,"tpush":2803,"view":2804,"vibr":2805,"Ġas":2806,"Ġad":2807,"ĠLock":2808,"Ġtick":2809,"ĠStart":2810,"Ġvel":2811,"Ġvibr":2812,"erphone":2813,"Ġ1000":2814,"Ġ141":2815,"Ġ10057":2816,"009":2817,"Ġ24":2818,"Ġ216":2819,"Ġ211":2820,"Ġ258":2821,"Ġ207":2822,"Ġ257":2823,"Ġ2153":2824,"Ġ01":2825,"ĠDe":2826,"Ġsound":2827,"Ġsub":2828,"Ġsize":2829,"179":2830,"17346":2831,"036":2832,"Ġcol":2833,"Ġcat":2834,"Ġcollapse":2835,"Ġchec":2836,"tell":2837,"arking":2838,"rocess":2839,"271":2840,"275":2841,"279":2842,"020":2843,"02333":2844,"etoot":2845,"bott":2846,"mote":2847,"ĠProcess":2848,"151":2849,"158":2850,"1556":2851,"1522":2852,"15564":2853,"reas":2854,"relayout":2855,"remote":2856,"protec":2857,"Ġfling":2858,"132":2859,"135":2860,"380":2861,"385":2862,"142":2863,"1499":2864,"Ġstack":2865,"206":2866,"tionState":2867,"tionsLocked":2868,"163":2869,"168":2870,"169":2871,"260":2872,"265":2873,"Ġbounds":2874,"470":2875,"472":2876,"ĠsetSpe":2877,"ĠsetWired":2878,"019":2879,"ationType":2880,"getKey":2881,"WindowAnimator":2882,"464":2883,"468":2884,"330":2885,"334":2886,"3310":2887,"551":2888,"557":2889,"042":2890,"0404":2891,"0489":2892,"ĠgetDevice":2893,"ĠgetData":2894,"Connec":2895,"Ġrebatch":2896,"060":2897,"063":2898,"184":2899,"085":2900,"089":2901,"391":2902,"397":2903,"Ġemp":2904,"596":2905,"faul":2906,"362":2907,"Ġ13003":2908,"486":2909,"NotificationLocked":2910,"562":2911,"563":2912,"075":2913,"078":2914,"0798":2915,"540":2916,"5244":2917,"193":2918,"195":2919,"197":2920,"19106":2921,"tentView":2922,"370":2923,"371":2924,"372":2925,"572":2926,"579":2927,"570404":2928,"21000":2929,"322":2930,"ĠRef":2931,"222":2932,"2227":2933,"293":2934,"298":2935,"29192":2936,"440":2937,"445":2938,"695":2939,"123":2940,"093":2941,"095":2942,"096":2943,"Ġ10112":2944,"284":2945,"285":2946,"287":2947,"28601":2948,"Ġplug":2949,"ĠisBatteryL":2950,"ĠisBlu":2951,"Ġ3247":2952,"Ġ1765":2953,"Ġthe":2954,"Expans":2955,"IntfMgr":2956,"cessory":2957,"PadActivity":2958,"ĠSending":2959,"Click":2960,"000000":2961,"00000000":2962,"Ġ549":2963,"762":2964,"964":2965,"261986":2966,"2619507":2967,"795":2968,"799":2969,"Ġ12278":2970,"894":2971,"895":2972,"Ġresid":2973,"874":2974,"875":2975,"877":2976,"878":2977,"40000108":2978,"acking":2979,"Ġ6733":2980,"Ġ6751":2981,"Ġ6750":2982,"Ġ6741":2983,"Ġ6740":2984,"Ġ6725":2985,"ToHe":2986,"10020":2987,"10037":2988,"785":2989,"786":2990,"884":2991,"885":2992,"ĠonTouchEvent":2993,"ĠonTr":2994,"2618499":2995,"1011":2996,"861":2997,"863":2998,"861522":2999,"771":3000,"UpFact":3001,"KeyguardMonitor":3002,"uginProxy":3003,"}})":3004,"121161":3005,"AudioEvent":3006,"AudioFocus":3007,"Ġ5092":3008,"ĠstreamType":3009,"980":3010,"Stub":3011,"Ġdefaul":3012,"auseOf":3013,"ĠMarking":3014,"6309":3015,"ĠstartAnimation":3016,"233570404":3017,"261972":3018,"2619733":3019,"2619732":3020,"Ġapply":3021,"performDeferred":3022,"ĠanimationType":3023,"091223":3024,"ĠexpandBec":3025,"2619887":3026,"Ġgt":3027,"ionChanged":3028,"Ġseen":3029,"NotePadActivity":3030,"callingUid":3031,"237091223":3032,"Ġwhat":3033,"603735":3034,"ACTIVITY":3035,"akerphone":3036,"10200000":3037,"handleAudioEvent":3038,"166121161":3039,"ĠWifiService":3040,"ĠgetRingtone":3041,"WiredAc":3042,"ĠACTION":3043,"ĠACTIVITY":3044,"ĠonNotificationExpans":3045,"ĠonNotificationClick":3046,"DeviceConnec":3047,"ĠonExpandingStarted":3048,"ĠonExpandingFinis":3049,"LAUNCH":3050,"ĠcontentView":3051,"Ġ509262332":3052,"ĠUnkn":3053,"SpeedUpFact":3054,"BinderProxy":3055,"219829192":3056,"77903":3057,"DOWN":3058,"Falsing":3059,"Freez":3060,"IsPowered":3061,"IWindowSession":3062,"OptionsLocked":3063,"PhoneIntfMgr":3064,"PRIVATE":3065,"PlugType":3066,"QzoneWe":3067,"bPluginProxy":3068,"cooper":3069,"cancelNotificationLocked":3070,"change":3071,"gedType":3072,"hBatteryInfo":3073,"logic":3074,"pri":3075,"reshBatteryInfo":3076,"sForStream":3077,"ĠaddNotification":3078,"Ġvibrate":3079,"ĠsubId":3080,"173466309":3081,"Ġcolor":3082,"ĠcollapseSpeedUpFact":3083,"Ġcheck":3084,"etooth":3085,"bottom":3086,"155652":3087,"155645244":3088,"reason":3089,"protected":3090,"ĠflingToHe":3091,"149977903":3092,"ĠsetSpeakerphone":3093,"ĠsetWiredDeviceConnec":3094,"04890":3095,"ĠgetDevicesForStream":3096,"ĠgetDataEnabled":3097,"Ġrebatching":3098,"Ġempty":3099,"191063310":3100,"ĠRefreshBatteryInfo":3101,"ĠpluggedType":3102,"ĠisBatteryLow":3103,"ĠisBluetooth":3104,"cessoryManager":3105,"ĠonTracking":3106,"86152250":3107,"Ġ509202333":3108,"Ġdefaults":3109,"auseOfFalsing":3110,"ĠapplyOptionsLocked":3111,"performDeferredDestroy":3112,"ĠexpandBecauseOfFalsing":3113,"60373518":3114,"ĠgetRingtonePlayer":3115,"WiredAccessoryManager":3116,"ĠonNotificationExpansionChanged":3117,"ĠonExpandingFinished":3118,"LAUNCHER":3119,"ĠUnknown":3120,"FreezingDisplay":3121,"QzoneWebPluginProxy":3122,"cooperation":3123,"ĠcollapseSpeedUpFactor":3124,"ĠflingToHeight":3125,"ĠsetSpeakerphoneOn":3126,"ĠsetWiredDeviceConnectionState":3127,"QzoneWebPluginProxyService":3128}